{
  "job_posting": {
    "search_keyword": "Information Officer",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Other Public Sector",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121493"
    },
    "metadata": {
      "posting_title": "Licensing and Information Officer, Consumer Protection BC",
      "posting_id": "121493",
      "job_title": "Licensing and Information Officer, Consumer Protection BC",
      "position_classification": "ABC Access",
      "classification_code": "ABC Access",
      "union": "N/A",
      "work_options": null,
      "locations": [
        "Victoria, BC V9B 6X2 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$58,279.17 - $66,127.14 annually",
        "min_amount": 58279.17,
        "max_amount": 66127.14,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/9/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Temporary (Auxiliary)",
      "temporary_end_date": "7/2/2027",
      "ministry_organization": "BC Public Service -> Other Public Sector",
      "ministry_branch_division": "Consumer Protection BC",
      "job_category": "Administrative Services"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "***Please DO NOT apply for this position by submitting your profile on this BC Government Hiring Centre website. Applications must be made via the following directions below.***",
          "Consumer Protection BC is a not-for-profit regulator responsible for overseeing certain sectors and specific types of consumer transactions. Our vision is a province where all citizens of BC are empowered in their transactions as a result of rigorous and consistent business compliance and through the provision of information.",
          "Consumer Protection BC is looking for a temporary Licensing & Information Officer to join our team!",
          "A day in the life:",
          "Today is an ‘in office day’ so you enter our Victoria office, grab a cup of coffee and have a quick chat with your colleagues before settling in for a new day of meaningful work. Looking at your Outlook calendar, today you will be responding to consumers who are experiencing a variety of issues with businesses in BC. You will be collecting information, creating complaint files, and referring to other organizations to try and help consumers resolve their complaints. Next you have a morning meeting with your Licensing and Information Services team to discuss the new online licensing platform.",
          "At lunch, you join your co-workers for a potluck in the lunchroom. Later this afternoon, you’re scheduled to renew debt collector licences and review their new applications. In between your scheduled meetings, you’re responding to licensee emails, following up on complaints, and processing payments. Towards the end of the day, you make a note to follow-up with the Business Practices team about a licensee who has not submitted their annual financial statements.",
          "As you close your laptop, you’re grateful that a day in the life of a Licensing and Information Officer is never the same as the day before. Being involved in projects that require you to obtain, review and process specific information is of a great value to our organization. You appreciate the ability to be involved with other departments and the opportunity to learn something new every single day.",
          "Who you are:",
          "• A team player and excellent communicator, with a positive attitude and a desire to work cooperatively with others to achieve group and organizational goals",
          "• A true service provider focused on identifying and serving the needs of clients, with a willingness to adapt to and work effectively within a variety of diverse situations and groups or individuals within a high volume, repetitive and demanding front-line atmosphere",
          "• A detailed-oriented employee, with excellent skills in standard Office 365 computer applications and information systems",
          "What you will be doing:",
          "• Providing information and assistance to consumers and businesses as the first point of contact for Consumer Protection BC",
          "• Receiving, processing and making decisions on whether or not to approve licensing and registration applications",
          "• Contacting applicants to obtain missing and further information and searching databases to obtain current information on the status of the applicant’s business",
          "• Calculating and collecting applicable fees and reconciling financial account information, and preparing and maintaining electronic files of documents and correspondence",
          "• Working independently and as part of a team to carry out administrative projects and increase efficiencies",
          "We are looking for people who have:",
          "• Completion of post‐secondary training in a related field and/or five years clerical/administrative support experience and/or a combination of formal training and experience.",
          "• Experience in handling difficult customers or conflict situations.",
          "• Experience receiving, evaluating and processing license or registration applications (or similar) and providing information to clients.",
          "• Experience providing web-based technical administrative support.",
          "• Experience analyzing, interpreting and applying legislation preferred.",
          "Are we a good fit for each other?",
          "We want to help you decide if we are a good fit for one another. Learn more about who we are as a regulator and employer by exploring our website, including our about us page and our careers page.",
          "Accessibility Do you need accommodation during the interview process? Please read our information about requesting an accommodation.",
          "DO NOT submit your application for this position through the BC Government Hiring Centre website. Applications submitted through the BC Government Hiring Centre will not be considered."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [],
      "preferred_experience_bullets": []
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": [
          "If you think you are interested in the role, review the complete job description and apply online by uploading your resume and answering a few screening questions within our Get Hired Application Portal.",
          "The application process:",
          "· We do not accept applications by email. We do not consider incomplete applications.",
          "· The full application process will take approximately four to six weeks to complete.",
          "· Steps in the application process include application screening, telephone interview, written assignment, in-person interview, CEO interview, professional references, and a criminal record check (post offer).",
          "Please note: This role is not eligible for internal transfers as Consumer Protection BC is a separate entity to the Public Service Agency. This is a union role with the BCGEU, though seniority transfer from an individual currently in the Public Service Agency does not apply. We may establish an eligibility list for this position.",
          "Please contact careers@consumerprotectionbc.ca with questions."
        ]
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": null,
      "flexible_work_statement": null,
      "indigenous_applicant_advisory_service": {
        "available": false,
        "description": null,
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "Licensing & Information Officer",
          "path_or_url": "/display_document.php?noheader=1&file_id=174760&action=download&req_attachment_id=52779"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121493",
    "scraped_at": "2025-11-09T17:47:54.685581",
    "matched_keyword": "Information Officer",
    "match_score": 100
  }
}