{
  "job_posting": {
    "search_keyword": "Unknown",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Water,Land,ResourceStewardship",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121492"
    },
    "metadata": {
      "posting_title": "CLK 12R - Client Service Representative",
      "posting_id": "121492",
      "job_title": "CLK 12R - Client Service Representative",
      "position_classification": "Clerk R12",
      "classification_code": "Clerk R12",
      "union": "GEU",
      "work_options": "On-Site",
      "locations": [
        "Kamloops, BC V2H 1B7 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$54,387.32 - $61,395.95 annually",
        "min_amount": 54387.32,
        "max_amount": 61395.95,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/17/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Water,Land,ResourceStewardship",
      "ministry_branch_division": "Permitting Transformation Division",
      "job_category": "Administrative Services, Communications, Natural Resource Sector, Policy, Research and Economics"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "The Team: The FrontCounter BC team within the Ministry of Water, Land and Resource Stewardship – Permitting Transformation Division is a dynamic and supportive group dedicated to helping clients navigate the permitting process. As a Client Services Representative, you’ll be part of an established team that operates as a one-stop shop for applications across multiple provincial agencies, including Land, Water, Agriculture, and Recreation Sites and Trails. With offices ranging from nine to twenty staff members, the team thrives on camaraderie and mutual support, working closely with Natural Resource Specialists and colleagues from other ministries to streamline applications and provide exceptional service to clients.",
          "The Role: As a Client Service Representative, you will play a key role in supporting clients and businesses across B.C. as they explore opportunities and apply for access to Crown resources. You’ll provide frontline customer service and financial administration, ensuring clients receive the guidance they need to navigate the permitting process. This role offers a meaningful way to contribute to the well-being of the province, balancing economic and environmental interests while delivering excellent client support. If you’re passionate about helping people and making a positive impact on B.C.’s natural resources, this is a great opportunity to start your career in the sector.",
          "Qualifications: Education and Experience Requirements:",
          "• Grade 12 graduation or GED.\n• A minimum three (3) years of clerical or administration experience in a formal business environment, which includes experience in all of the following: providing client/customer service to a diverse range of individuals, organizations, and industries; word processing, creating spreadsheets and working with standard computer applications (e.g., MS Word, MS Excel, MS PowerPoint and MS Outlook); providing client service in confrontational or highly sensitive situations; providing excellent written and oral communication with a variety of clients/customers in complex situations; multi-tasking, often in demanding and fast paced environments.",
          "• providing client/customer service to a diverse range of individuals, organizations, and industries;\n• word processing, creating spreadsheets and working with standard computer applications (e.g., MS Word, MS Excel, MS PowerPoint and MS Outlook);\n• providing client service in confrontational or highly sensitive situations;\n• providing excellent written and oral communication with a variety of clients/customers in complex situations;\n• multi-tasking, often in demanding and fast paced environments.",
          "For questions regarding this position, please contact Stacey.Allan@gov.bc.ca. About this Position: There are currently two (2) permanent, full time position available in Kamloops. These positions have full time on-site requirements. Employees of the BC Public Service must be located in BC at the time of employment. An eligibility list may be established to fill future temporary and permanent vacancies in Kamloops. A Criminal Record Check (CRC) will be required. Working for the BC Public Service: The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "We are committed to ensuring reasonable accommodations are available throughout the hiring process, including the assessment and selection stages. Please email the individual or contact listed on the posting if you require an accommodation to fully participate in the hiring process.",
          "The Indigenous Applicant Advisory Service is available to Indigenous (First Nations [status or non-status], Inuit, or Métis) applicants originating from the land known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
          "The BC Public Service is an award winning employer and offers employees competitive benefits, great learning opportunities and a chance to engage in rewarding work with exciting career development options. For more information, visit What the BC Public Service Offers. How to Apply: Your resume and/or cover letter must clearly show that you meet the education and experience requirements. Highlight the required qualifications and support them with specific examples, such as your responsibilities, projects you've worked on, or accomplishments. Find more information on the recruitment process, including helpful tips and videos about the application process, visit the Your Job Application page of MyHR. Gain insights into the hiring journey by joining a Career Conversation.",
          "Cover Letter: NO - Please do not submit a cover letter as it will not be reviewed.",
          "Resume: YES - Ensure your resume includes your educational accomplishments, employment history, including job titles, start and end dates (month and year) and your job related responsibilities for each job in your employment history, and any relevant information that relates to this position.",
          "Questionnaire: YES - You will need to complete a basic questionnaire to demonstrate how you meet the job requirements. Applicants who are selected to move forward in the hiring process may be assessed on their knowledge, skills, abilities, competencies and other position related requirements as outlined in the Job Profile at the bottom of the posting. Applications will be accepted until 11:00 pm Pacific Time on the closing date of the competition. If you are experiencing technical difficulty applying, visit the Technical Assistance page of MyHR."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "Grade 12 graduation or GED.",
        "A minimum three (3) years of clerical or administration experience in a formal business environment, which includes experience in all of the following: providing client/customer service to a diverse range of individuals, organizations, and industries; word processing, creating spreadsheets and working with standard computer applications (e.g., MS Word, MS Excel, MS PowerPoint and MS Outlook); providing client service in confrontational or highly sensitive situations; providing excellent written and oral communication with a variety of clients/customers in complex situations; multi-tasking, often in demanding and fast paced environments.",
        "providing client/customer service to a diverse range of individuals, organizations, and industries;",
        "word processing, creating spreadsheets and working with standard computer applications (e.g., MS Word, MS Excel, MS PowerPoint and MS Outlook);",
        "providing client service in confrontational or highly sensitive situations;",
        "providing excellent written and oral communication with a variety of clients/customers in complex situations;",
        "multi-tasking, often in demanding and fast paced environments."
      ],
      "preferred_experience_bullets": []
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "For questions regarding this position, please contact Stacey.Allan@gov.bc.ca. About this Position: There are currently two (2) permanent, full time position available in Kamloops. These positions have full time on-site requirements. Employees of the BC Public Service must be located in BC at the time of employment. An eligibility list may be established to fill future temporary and permanent vacancies in Kamloops. A Criminal Record Check (CRC) will be required. Working for the BC Public Service: The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": null,
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service is available to Indigenous (First Nations [status or non-status], Inuit, or Métis) applicants originating from the land known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "121492_Job Profile_CLK 12R - Client Service Representative",
          "path_or_url": "/display_document.php?noheader=1&file_id=174786&action=download&req_attachment_id=52795"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121492",
    "scraped_at": "2025-11-09T17:42:05.309512",
    "matched_keyword": "Unknown",
    "match_score": 100
  }
}