{
  "job_posting": {
    "search_keyword": "Unknown",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "BC Pension Corp",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121608"
    },
    "metadata": {
      "posting_title": "Band C - Board Officer",
      "posting_id": "121608",
      "job_title": "Band C - Board Officer",
      "position_classification": "Band C",
      "classification_code": "Band C",
      "union": "N/A",
      "work_options": null,
      "locations": [
        "Victoria, BC V9B 6X2 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$88,700.23 to $125,700.07 per annum",
        "min_amount": 88700.23,
        "max_amount": 125700.07,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/26/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> BC Pension Corp",
      "ministry_branch_division": "Office of the Municipal Pension Board of Trustees",
      "job_category": "Leadership and Management"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "Job Description",
          "Salary Range: $88,700.23 to $125,700.07 per annum Union/Excluded: Excluded Security Screening: Required Job Type: Regular full time Additional Info: An eligibility list to fill future vacancies may be established. Testing may be required. Lesser qualified applicants may be appointed at a lower level.",
          "We are seeking a Board Officer to join our team in the Office of the Municipal Pension Board of Trustees in VICTORIA, British Columbia, Canada.",
          "Are you ready to play a pivotal role in governance excellence?",
          "The Board Officer is a trusted advisor and key support to the Municipal Pension Plan’s management team, ensuring the integrity of the board’s governance framework and the smooth administration of its day-to-day operations. This position is central to maintaining compliance with governance documents and applicable legislation, while fostering transparency and accountability at every level.",
          "As Board Officer, you will lead meeting management, including agenda development, preparation of materials, and accurate record keeping. You’ll ensure board members have the resources they need to prepare thoroughly, engage meaningfully, and make informed decisions. Acting as a governance expert, you will advise on legal, fiduciary, and policy responsibilities, helping the board navigate complex issues with confidence.",
          "Beyond meetings, you will oversee the implementation of board decisions and directions, ensuring timely follow-up and clear communication. In addition, you will serve as the Appeals Registrar and may act as Board Secretary, providing continuity and leadership in critical governance functions.",
          "This is an opportunity for a detail-oriented professional who thrives in a fast-paced, collaborative environment and values integrity, precision, and strategic thinking. If you are passionate about governance and want to make an impact at the heart of decision-making, we want to hear from you.",
          "Responsibilities",
          "As Board Officer, you’ll be the cornerstone of governance excellence, providing leadership and expert advisory services to the board and its committees. Your responsibilities include:",
          "Governance Leadership: Deliver secretariat services, develop board policies, and ensure compliance with governance frameworks, legislation, and industry standards.",
          "Board Advisory: Guide trustees on fiduciary duties, policy application, and governance processes while fostering strong, collaborative relationships with stakeholders.",
          "Meeting Management: Plan and manage board and committee meetings, including agendas, materials, and records, ensuring accuracy and quality.",
          "Compliance & Quality: Monitor adherence to governance requirements and implement standards for board materials and processes.",
          "Appeals & Records: Serve as Appeals Registrar, manage the appeals process, and oversee requests under the Freedom of Information and Protection of Privacy Act.",
          "Operational Support: Contribute to strategic planning, project management, and information governance, ensuring proper documentation and safeguarding of board records.",
          "Stakeholder Communication: Act as a liaison between the board, Pension Corporation, BCI, and service providers to implement decisions and maintain transparency.",
          "Qualifications",
          "Must have",
          "• A bachelor's degree in a related discipline (law, commerce, business administration, public administration, arts, economics) or an equivalent combination of education, training, and experience may be considered\n• Experience working in a corporate governance environment such as supporting the roles, responsibilities and procedures of a board of trustees/directors\n• 3 years' experience required in each of the following:",
          "• Experience researching, writing materials and presenting a variety of technical topics, which may include pensions, investment, actuarial, legal, and regulatory\n• Experience in development, analysis and interpretation of legislation regulations, contracts and/or policy\n• Demonstrated leadership and change management skills with proven ability to take initiative, motivate and influence others, including senior executives",
          "• An equivalent combination of education, training and relevant experience may be considered.",
          "Nice to have:",
          "• Experience in investment, actuarial science, pension administration and/or legal practice preferred\n• CFA designation or similar credential is preferred",
          "Knowledge, Skills and Abilities",
          "• General working knowledge of: Public sector pension plans and pension administration, Pension plan regulation, e.g. Income Tax Act and Pension Benefits Standards Act, Investment and economic concepts, and Actuarial and financial concepts, with strong knowledge in at least one of these areas, coupled with a willingness to enhance knowledge in these areas over time;\n• Knowledge of leadership, management and corporate governance theory and practice\n• Demonstrated ability to work calmly under pressure while exercising tact, diplomacy and good judgment\n• Excellent organizational and project management skills and attention to detail\n• Excellent communication (verbal, written and presentation) and interpersonal skills\n• Exercises good judgment and discretion, demonstrating flexibility and composure in a fast-paced environment\n• Ability to work independently and as part of a team\n• Ability to manage multiple reporting relationships\n• Ability to establish and maintain effective working relationships with a variety of individuals and groups\n• Proficient with the Microsoft Office suite of products (Word, PowerPoint, Excel etc.)",
          "• Public sector pension plans and pension administration,\n• Pension plan regulation, e.g. Income Tax Act and Pension Benefits Standards Act,\n• Investment and economic concepts, and\n• Actuarial and financial concepts, with strong knowledge in at least one of these areas, coupled with a willingness to enhance knowledge in these areas over time;",
          "Application requirements",
          "Cover letter: Required.",
          "Resume: A resume is required as part of your application. Ensure your resume includes your education, the start and end dates (month and year) of your employment, and any relevant information that relate to the job requirements.",
          "Applications will be accepted until 11:59 pm PST on the closing date. Late applications will not be considered.",
          "Diversity & Inclusion",
          "BC Pension Corporation is an equal opportunity employer committed to establishing an inclusive, equitable, and accessible environment for all. All qualified applicants will receive consideration for employment without regard to race, national origin, age, religion, disability, sexual orientation, gender identity or expression, marital status or any other basis protected by applicable law.",
          "We are committed to ensuring that reasonable accommodations are made available to persons with disabilities during the recruitment, assessment and selection processes and will provide reasonable accommodations upon request. If you require assistance or accommodation due to a disability, please email us at jobs@pensionsbc.ca.",
          "Thank you for your interest in working with us. We will let you know about your status in this competition as soon as possible. If you have questions about this opportunity, please email us at jobs@pensionsbc.ca."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "A bachelor's degree in a related discipline (law, commerce, business administration, public administration, arts, economics) or an equivalent combination of education, training, and experience may be considered",
        "Experience working in a corporate governance environment such as supporting the roles, responsibilities and procedures of a board of trustees/directors",
        "3 years' experience required in each of the following:",
        "Experience researching, writing materials and presenting a variety of technical topics, which may include pensions, investment, actuarial, legal, and regulatory",
        "Experience in development, analysis and interpretation of legislation regulations, contracts and/or policy",
        "Demonstrated leadership and change management skills with proven ability to take initiative, motivate and influence others, including senior executives",
        "An equivalent combination of education, training and relevant experience may be considered."
      ],
      "preferred_experience_bullets": [
        "Experience in investment, actuarial science, pension administration and/or legal practice preferred",
        "CFA designation or similar credential is preferred",
        "General working knowledge of: Public sector pension plans and pension administration, Pension plan regulation, e.g. Income Tax Act and Pension Benefits Standards Act, Investment and economic concepts, and Actuarial and financial concepts, with strong knowledge in at least one of these areas, coupled with a willingness to enhance knowledge in these areas over time;",
        "Knowledge of leadership, management and corporate governance theory and practice",
        "Demonstrated ability to work calmly under pressure while exercising tact, diplomacy and good judgment",
        "Excellent organizational and project management skills and attention to detail",
        "Excellent communication (verbal, written and presentation) and interpersonal skills",
        "Exercises good judgment and discretion, demonstrating flexibility and composure in a fast-paced environment",
        "Ability to work independently and as part of a team",
        "Ability to manage multiple reporting relationships",
        "Ability to establish and maintain effective working relationships with a variety of individuals and groups",
        "Proficient with the Microsoft Office suite of products (Word, PowerPoint, Excel etc.)",
        "Public sector pension plans and pension administration,",
        "Pension plan regulation, e.g. Income Tax Act and Pension Benefits Standards Act,",
        "Investment and economic concepts, and",
        "Actuarial and financial concepts, with strong knowledge in at least one of these areas, coupled with a willingness to enhance knowledge in these areas over time;"
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": [
          "Please use the following link to apply for this job:",
          "https://fa-exby-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1013"
        ]
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "Diversity & Inclusion",
      "flexible_work_statement": null,
      "indigenous_applicant_advisory_service": {
        "available": false,
        "description": null,
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": []
    }
  },
  "scraping_metadata": {
    "job_id": "121608",
    "scraped_at": "2025-11-09T17:42:05.454552",
    "matched_keyword": "Unknown",
    "match_score": 100
  }
}