{
  "job_posting": {
    "search_keyword": "Information Officer",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "BC Pension Corp",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121551"
    },
    "metadata": {
      "posting_title": "ADMN O 18R - Training Specialist - Amendment - Close Date",
      "posting_id": "121551",
      "job_title": "ADMN O 18R - Training Specialist - Amendment - Close Date",
      "position_classification": "Administrative Officer R18",
      "classification_code": "Administrative Officer R18",
      "union": "GEU",
      "work_options": "Hybrid",
      "locations": [
        "Victoria, BC V9B 6X2 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$64,123.59 to $72,674.35 per annum",
        "min_amount": 64123.59,
        "max_amount": 72674.35,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/13/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> BC Pension Corp",
      "ministry_branch_division": "Operational Performance Optimization",
      "job_category": "Administrative Services"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "***Please DO NOT apply for this position by submitting your profile on this BC Government Hiring Centre website. Applications must be made via the following directions below.***",
          "**Amendment - This posting is now scheduled to close on October 13th, 2025. Applications will be accepted until 11:59 pm Pacific Standard Time on the closing date of the competition**",
          "Job Description",
          "Classification: Administrative Officer R18",
          "Salary Range: $64,123.59 to $72,674.35 per annum",
          "Union/Excluded: BCGEU",
          "Security Screening: Required",
          "Job Type: Regular full time",
          "Additional Info: An eligibility list to fill future vacancies may be established. Testing will be required.",
          "We are seeking a Training Specialist to join our team in VICTORIA, British Columbia, Canada.",
          "Are you passionate about empowering others through learning?",
          "In this role, you’ll design and develop engaging training programs that boost employee performance and enhance service to members and employers. You’ll collaborate with leaders and learning partners to assess needs, build curriculum, and measure impact supporting everything from onboarding to ongoing development.",
          "You will bring a digital mindset, a strong grasp of adult learning principles, and a drive to modernize training for a mobile, flexible workforce. If you're ready to make a meaningful impact through learning, we’d love to hear from you.",
          "Hybrid Work Model",
          "This position is located in our Victoria, BC office. You will have the opportunity to work part of the time on-campus and part of the time off-campus. Guidelines and requirements for in-office presence are determined by operational need and vary according to the unique needs of each business area.",
          "Responsibilities",
          "Training Design & Development",
          "• Design, develop, and maintain training programs and curriculum to support operational needs and enhance employee performance.\n• Identify knowledge gaps and create targeted learning solutions.\n• Review and revise existing training materials to ensure alignment with corporate standards and service expectations.\n• Establish clear learning outcomes and performance improvement goals.",
          "Training Delivery",
          "• Deliver training in various formats including in-person workshops, virtual sessions (MS Teams), e-learning modules, simulation training, and webinars.\n• Coordinate and support onboarding and ongoing employee training initiatives.\n• Ensure training facilities, technologies, and resources are available and operational.",
          "Collaboration & Stakeholder Engagement",
          "• Partner with Assistant Directors, Client Service Managers, Quality Analysts, and Learning Consultants to assess training needs and measure learning outcomes.\n• Collaborate with Performance and Talent Development on training design and resource planning.\n• Work with the Knowledge Management Lead to ensure timely and relevant workflow aids are provided to employees.",
          "Performance & Quality Improvement",
          "• Analyze quality metrics and performance data to inform training strategies.\n• Provide input into probation and development plans, recommending additional training or coaching as needed.\n• Identify service improvement opportunities and contribute to enhancements in the quality program and knowledge base.\n• Support continuous learning and development to improve service delivery and business outcomes.",
          "Evaluation & Continuous Improvement",
          "• Conduct evaluations to assess training effectiveness and recommend improvements.\n• Provide ongoing training support based on feedback and performance trends.\n• Align training initiatives with corporate programs, policies, processes, and service standards.",
          "Qualifications",
          "Must have",
          "• Bachelor’s degree in a related field (e.g. Business Administration, Communications, Education or English).\n• Certification of adult education in one of the followings programs: Instructional Skills Workshop (ISW), Adult Continuing Education (CACE), Provincial Instructor Diploma (PID) programs, or other equivalent training/technical instructional certification.\n• Two years of recent experience that includes each of the following:",
          "-Design and develop training material in a client facing role.",
          "-Experience understanding and applying complex policy, rules or legislation with a focus on delivering consistent, high quality service experience to stakeholders.",
          "-Experience developing and delivering training curriculum to individuals and in a group setting.",
          "-Experience with computer applications including M365, SharePoint, Power BI, Articulate RISE.",
          "-Experience analyzing data to measure learning outcomes.",
          "-An equivalent combination of education, training and relevant experience may be considered.",
          "Knowledge, Skills and Abilities",
          "• Ability to adapt to and provide guidance and support to internal stakeholders in an evolving business environment\n• Comprehensive knowledge of pension plan process, procedures, theory and related legislation\n• Digital mindset and aptitude in design and development of learning curriculum\n• Excellent oral and written communications skills that articulate detailed information and comprehensive explanations to employees to help them successfully perform their role\n• Ability to present and articulate information to employees at all levels, providing succinct and thoughtful responses to questions\n• Ability to be work independently and as part of a team to accomplish work assignments\n• Ability to work under pressure, with competing tasks while meeting deadlines\n• Identify and think through problems with a view to a successful resolution\n• Ability to establish and maintain strong working relationships, trust and respect in order to provide superior support to business areas and employees\n• Strong analytical skills and the ability to gather information and make recommendations\n• Ability to plan, organize and coordinate work effectively while dealing with conflicting demands, shifting priorities and deadlines\n• Conduct business in a confidential nature, using professionalism, tact, diplomacy and good judgment at all times;\n• High proficiency with computer software applications (M365 and SharePoint) and related industry software.\n• Good leadership, problem solving, organizational, and communication (written and oral) skills",
          "Application requirements",
          "Cover letter: Please do not submit a cover letter; it will not be reviewed.",
          "Resume: A resume is required as part of your application. Ensure your resume includes your education, the start and end dates (month and year) of your employment, and any relevant information that relate to the job requirements.",
          "Questionnaire: As part of the application process, you will be prompted to complete an online questionnaire to demonstrate how you meet the job requirements. Responses will be used to shortlist applicants against the job requirements. Please allow approximately 15 minutes to complete this questionnaire.",
          "Applications must be submitted via this link: https://fa-exby-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1013",
          "Applications will be accepted until 11:59 pm PST on the closing date. Late applications will not be considered.",
          "Diversity & Inclusion",
          "BC Pension Corporation is an equal opportunity employer committed to establishing an inclusive, equitable, and accessible environment for all. All qualified applicants will receive consideration for employment without regard to race, national origin, age, religion, disability, sexual orientation, gender identity or expression, marital status or any other basis protected by applicable law.",
          "We are committed to ensuring that reasonable accommodations are made available to persons with disabilities during the recruitment, assessment and selection processes and will provide reasonable accommodations upon request. If you require assistance or accommodation due to a disability, please email us at jobs@pensionsbc.ca.",
          "Thank you for your interest in working with us. We will let you know about your status in this competition as soon as possible. If you have questions about this opportunity, please email us at jobs@pensionsbc.ca.",
          "DO NOT submit your application for this position through the BC Government Hiring Centre website. Applications submitted through the BC Government Hiring Centre will not be considered."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "Bachelor’s degree in a related field (e.g. Business Administration, Communications, Education or English).",
        "Certification of adult education in one of the followings programs: Instructional Skills Workshop (ISW), Adult Continuing Education (CACE), Provincial Instructor Diploma (PID) programs, or other equivalent training/technical instructional certification.",
        "Two years of recent experience that includes each of the following:",
        "Ability to adapt to and provide guidance and support to internal stakeholders in an evolving business environment",
        "Comprehensive knowledge of pension plan process, procedures, theory and related legislation",
        "Digital mindset and aptitude in design and development of learning curriculum",
        "Excellent oral and written communications skills that articulate detailed information and comprehensive explanations to employees to help them successfully perform their role",
        "Ability to present and articulate information to employees at all levels, providing succinct and thoughtful responses to questions",
        "Ability to be work independently and as part of a team to accomplish work assignments",
        "Ability to work under pressure, with competing tasks while meeting deadlines",
        "Identify and think through problems with a view to a successful resolution",
        "Ability to establish and maintain strong working relationships, trust and respect in order to provide superior support to business areas and employees",
        "Strong analytical skills and the ability to gather information and make recommendations",
        "Ability to plan, organize and coordinate work effectively while dealing with conflicting demands, shifting priorities and deadlines",
        "Conduct business in a confidential nature, using professionalism, tact, diplomacy and good judgment at all times;",
        "High proficiency with computer software applications (M365 and SharePoint) and related industry software.",
        "Good leadership, problem solving, organizational, and communication (written and oral) skills"
      ],
      "preferred_experience_bullets": []
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": [
          "Applications must be submitted via this link: https://fa-exby-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1013"
        ]
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "Diversity & Inclusion",
      "flexible_work_statement": "You will bring a digital mindset, a strong grasp of adult learning principles, and a drive to modernize training for a mobile, flexible workforce. If you're ready to make a meaningful impact through learning, we’d love to hear from you.",
      "indigenous_applicant_advisory_service": {
        "available": false,
        "description": null,
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": []
    }
  },
  "scraping_metadata": {
    "job_id": "121551",
    "scraped_at": "2025-11-09T17:47:45.743540",
    "matched_keyword": "Information Officer",
    "match_score": 100
  }
}