{
  "job_posting": {
    "search_keyword": "Unknown",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Liquor Distribution Branch",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121578"
    },
    "metadata": {
      "posting_title": "ADMN O 18R - Merchandise Analyst - Amended",
      "posting_id": "121578",
      "job_title": "ADMN O 18R - Merchandise Analyst - Amended",
      "position_classification": "Administrative Officer R18",
      "classification_code": "Administrative Officer R18",
      "union": "GEU",
      "work_options": "Hybrid",
      "locations": [
        "Burnaby, BC V3J 1N3 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$64,123.59 - $72,674.35 per annum",
        "min_amount": 64123.59,
        "max_amount": 72674.35,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/20/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Liquor Distribution Branch",
      "ministry_branch_division": "BC Liquor Distribution Branch",
      "job_category": "Administrative Services"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "About the BCLDB:",
          "The BC Liquor Distribution Branch (LDB) is one of two branches of government that provide oversight for the beverage alcohol and non-medical cannabis industries in the province. The LDB is responsible for the wholesale distribution of liquor and cannabis, and operates the retail brands BCLIQUOR and BC Cannabis Stores.",
          "The LDB is committed to government’s goals of making life better for people in B.C., improving services, and ensuring a sustainable province for future generations. The revenue generated by the LDB helps fund essential public services like health care, education, and community programming. Learn more on the LDB careers page.",
          "Liquor Retail Operations, encompassing the three retail business units of Merchandising, Marketing and Store Operations, is responsible for the daily operations of the 198 BC LIQUOR stores. The Retail division develops and executes key strategies to drive business, creates systems and processes, and establishes daily retail procedures to maximize operational excellence, while upholding BCLDB’s core values of service, relationships and results. Working in this vibrant, creative and supportive team environment will see your knowledge, skills and innovativeness thrive to unparalleled levels.",
          "About this role:",
          "The Merchandise Analyst is an important member of the BCL Merchandising department and Category Management team overseeing a group of BCL products, providing information, detailed research and analysis, and recommendations regarding all aspects of merchandising functions. The position is also responsible for supporting category management projects, contributing to the development of category profitability strategies and maintaining product information records. The position works closely with Category Managers, contacts in the retail (i.e., Marketing, Store Operations) and Wholesale departments, and industry representatives (i.e., agents), providing a variety of services in support of BCL’s product management and profitability objectives.",
          "Amendment (November 6th, 2025): Work option was updated to hybrid.",
          "A criminal record check is required.",
          "Candidates may be required to travel occasionally to visit BC Liquor Stores.",
          "For complete details about this opportunity, including accountabilities, please refer to the attached job description, also located in the Additional Information section at the bottom of the posting.",
          "An eligibility list for permanent or temporary future opportunities may be established.",
          "Position requirements:",
          "Education and Experience:",
          "• A degree or diploma in business administration, marketing, operations management, category management or related discipline and a minimum of two (2) years recent, related experience*.",
          "OR",
          "• An equivalent combination of education, training and experience may be considered, i.e., secondary (high) school diploma or equivalent certificate with three (3) years of recent, related experience*.",
          "*Recent experience must be within the last 5 years and include the following:",
          "• Experience with leading and managing qualitative and quantitative analysis techniques, including cost/benefit analysis and recommendations on pricing.\n• Experience interpreting sales trends, inventory data, and market insights to support merchandising decisions.\n• Experience with using Microsoft Excel (i.e., pivot tables, VLOOKUP, data modeling) for data analysis.",
          "Preference may be given to candidates with experience in any of the following:",
          "• Experience with business intelligence tools such as Power BI or Tableau for reporting and visualization.\n• Experience working within a retail, wholesale or distribution environment in the beverage alcohol industry.\n• Experience with merchandising, marketing and/or product management.",
          "Application instructions:",
          "To be considered for this position, your application must clearly demonstrate how you meet the education and experience as outlined in the position requirements section above. Applicants selected to move forward in the hiring process may be assessed on the knowledge, skills, abilities and competencies as outlined in the attached Job Description. Applicants must meet the requirements as described below to be considered:",
          "• A cover letter is required as part of your application. The content and/or format of your cover letter may be evaluated as part of the assessment process.\n• Ensure your resume includes your educational accomplishments, employment history including start and end dates (month and year) of your employment, and any relevant information that relates to the job to which you are applying.",
          "For specific position-related enquiries, please contact Evelyn Chen, HR Advisor at evelyn.y.chen@bcldb.com .",
          "Only applications submitted using the BC Public Service Recruitment System on this website will be accepted. For more information about how to create or update your profile, please refer to the attached Application Instructions or refer to the Job Application page on the MyHR website. If you are experiencing technical difficulty applying for a competition, please send an e-mail to BCPSA.Hiring.Centre@gov.bc.ca before the stated closing time, and they will respond as soon as possible to assist you.",
          "Note: Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition.",
          "Working for the BC Public Service:",
          "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
          "The Indigenous Applicant Advisory Service Service is available to Indigenous (First Nations [status or non-status], Inuit or Métis) applicants originating from the land now known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
          "The BC Public Service is an award-winning employer and offers employees competitive benefits, great learning opportunities and a chance to engage in rewarding work with exciting career development options. For more information, visit What the BC Public Service Offers."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "A degree or diploma in business administration, marketing, operations management, category management or related discipline and a minimum of two (2) years recent, related experience*.",
        "An equivalent combination of education, training and experience may be considered, i.e., secondary (high) school diploma or equivalent certificate with three (3) years of recent, related experience*.",
        "Experience with leading and managing qualitative and quantitative analysis techniques, including cost/benefit analysis and recommendations on pricing.",
        "Experience interpreting sales trends, inventory data, and market insights to support merchandising decisions.",
        "Experience with using Microsoft Excel (i.e., pivot tables, VLOOKUP, data modeling) for data analysis."
      ],
      "preferred_experience_bullets": [
        "Experience with business intelligence tools such as Power BI or Tableau for reporting and visualization.",
        "Experience working within a retail, wholesale or distribution environment in the beverage alcohol industry.",
        "Experience with merchandising, marketing and/or product management."
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": "Evelyn Chen",
        "title": "HR Advisor",
        "email": "evelyn.y.chen@bcldb.com"
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service Service is available to Indigenous (First Nations [status or non-status], Inuit or Métis) applicants originating from the land now known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "Job_Profile_Merchandise_Analyst",
          "path_or_url": "/display_document.php?noheader=1&file_id=174856&action=download&req_attachment_id=52836"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121578",
    "scraped_at": "2025-11-09T17:42:05.419891",
    "matched_keyword": "Unknown",
    "match_score": 100
  }
}