{
  "job_posting": {
    "search_keyword": "Finance Officer",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Liquor Distribution Branch",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121599"
    },
    "metadata": {
      "posting_title": "COMM O 21R - Senior Communications Officer,*Closing Date amended*",
      "posting_id": "121599",
      "job_title": "COMM O 21R - Senior Communications Officer,*Closing Date amended*",
      "position_classification": "Communications Officer R21",
      "classification_code": "Communications Officer R21",
      "union": "GEU",
      "work_options": "Hybrid",
      "locations": [
        "Burnaby, BC V3J 1N3 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$69,760.70 - $79,322.69 per annum",
        "min_amount": 69760.7,
        "max_amount": 79322.69,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/27/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Temporary (Auxiliary)",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Liquor Distribution Branch",
      "ministry_branch_division": "BC Liquor Distribution Branch",
      "job_category": "Communications"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "About the BCLDB:",
          "The BC Liquor Distribution Branch (LDB) is one of two branches of government that provide oversight for the beverage alcohol and non-medical cannabis industries in the province. The LDB is responsible for the wholesale distribution of liquor and cannabis, and operates the retails brands BCLIQUOR and BC Cannabis Stores.",
          "The LDB is committed to government’s goals of making life better for people in B.C., improving services, and ensuring a sustainable province for future generations. The revenue generated by the LDB helps fund essential public services like health care, education, and community programming. Learn more on the LDB careers page.",
          "As part of the Office of the Chief Administrative Officer, the Corporate Services (CS) team plays a critical role in supporting the entire organization. Comprised of Corporate Communications & Stakeholder Relations, Corporate Policy, Corporate Privacy & Information, Sourcing and Vendor Performance, Strategy & Business Transformation, Social Impact & Environmental Sustainability and the Corporate Project Management Office, CS is driven by customer-service and taking action to advise, consult and support each business area throughout the LDB.",
          "The CS team is comprised of approximately 70 staff. What brings CS together as a team is the ability to work together to support both the operational areas of the business and other corporate service areas (e.g., Corporate Operations, Finance, Human Resources, Information Technology). The group has a strategic lens with a focus on ensuring the organization aligns and complies with corporate priorities, policies, legislation, best practices, and government mandate.",
          "About this role:",
          "The Senior Communications Officer operates with a high degree of autonomy and is responsible for the development and planning for LDB’s corporate and employee communications vehicles and messaging.",
          "This position promotes and enhances the LDB’s reputation by providing expert communications advice for messaging around highly sensitive issues and delivering strategic, engaging communications for all employees.",
          "The Senior Communications Officer often works directly with the CEO and General Manager, as well as other executive members, providing strategic communications advice. The incumbent also provides expert communications counsel to senior staff and regularly drafts highly sensitive and confidential materials that support organizational priorities, issues management and internal communications for the LDB.",
          "The incumbent works closely with team members to develop and maintain a corporate communications strategy that considers LDB’s diverse employee base (the majority of which do not have email addresses) and stakeholder audiences, and ensures timely, clear and consistent messaging across all platforms.",
          "As part of the Corporate Communications and Stakeholder Relations team, the position is called on to identify emerging issues, research and develop strategic responses and deliver them to the media and external stakeholders. This role may act as a corporate spokesperson when appropriate.",
          "Special requirements and working conditions include the ability to work extended hours and be part of an on-call team in the event of an emergency, if required. A successful completion of a criminal record check is required.",
          "For complete details about this opportunity, including accountabilities, please refer to the attached job description, also located in the Additional Information section at the bottom of the posting.",
          "An eligibility list for temporary future opportunities may be established.",
          "Position requirements:",
          "Education and Experience:",
          "• Degree or diploma in communications, public relations, journalism or a related discipline and a minimum of one (1) year of recent, related experience*.",
          "OR",
          "• A combination of education, training and experience may be considered, i.e., secondary (high) school diploma or equivalent certification with three (3) years of recent, related experience*.",
          "*Recent, related experience must have occurred within the last five (5) years and must include the following:",
          "• Experience coordinating a variety of communications materials, including but not limited to, communications plans, key messages, news releases, story pitches, information materials, speeches, backgrounders, briefing notes and correspondence.\n• Experience planning and creating clear communications goals and strategies for the future.",
          "Preference may be given to candidates with any of the following experience:",
          "• Experience providing communications support for corporate social responsibility programs.\n• Experience identifying opportunities and risks when it comes to employee communications.\n• Experience using digital communications/social media for public relations purposes.\n• Experience providing communications support for the liquor or non-medical cannabis industry.\n• Experience providing strategic communications advice, messaging and direction to senior leaders.\n• Experience identifying media and public issues and preparing appropriate responses for spokespeople and/or for use by the media.",
          "Application instructions:",
          "To be considered for this position, your application must clearly demonstrate how you meet the education and experience as outlined in the position requirements section above. Applicants selected to move forward in the hiring process may be assessed on the knowledge, skills, abilities and competencies as outlined in the attached Job Description. Applicants must meet the requirements as described below to be considered:",
          "• A cover letter is required as part of your application. The content and/or format of your cover letter may be evaluated as part of the assessment process.\n• Ensure your resume includes your educational accomplishments, employment history including start and end dates (month and year) of your employment, and any relevant information that relates to the job to which you are applying.",
          "For specific position-related enquiries, please contact Evelyn Chen, HR Advisor, Talent & Compensation at evelyn.y.chen@bcldb.com.",
          "Only applications submitted using the BC Public Service Recruitment System on this website will be accepted. For more information about how to create or update your profile, please refer to the attached Application Instructions or refer to the Job Application page on the MyHR website. If you are experiencing technical difficulty applying for a competition, please send an e-mail to BCPSA.Hiring.Centre@gov.bc.ca before the stated closing time, and they will respond as soon as possible to assist you.",
          "Note: Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition.",
          "Working for the BC Public Service:",
          "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
          "The Indigenous Applicant Advisory Service is available to Indigenous (First Nations [status or non-status], Inuit or Métis) applicants originating from the land now known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
          "The BC Public Service is an award-winning employer and offers employees competitive benefits, great learning opportunities and a chance to engage in rewarding work with exciting career development options. For more information, visit What the BC Public Service Offers."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "Degree or diploma in communications, public relations, journalism or a related discipline and a minimum of one (1) year of recent, related experience*.",
        "A combination of education, training and experience may be considered, i.e., secondary (high) school diploma or equivalent certification with three (3) years of recent, related experience*.",
        "Experience coordinating a variety of communications materials, including but not limited to, communications plans, key messages, news releases, story pitches, information materials, speeches, backgrounders, briefing notes and correspondence.",
        "Experience planning and creating clear communications goals and strategies for the future."
      ],
      "preferred_experience_bullets": [
        "Experience providing communications support for corporate social responsibility programs.",
        "Experience identifying opportunities and risks when it comes to employee communications.",
        "Experience using digital communications/social media for public relations purposes.",
        "Experience providing communications support for the liquor or non-medical cannabis industry.",
        "Experience providing strategic communications advice, messaging and direction to senior leaders.",
        "Experience identifying media and public issues and preparing appropriate responses for spokespeople and/or for use by the media."
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service is available to Indigenous (First Nations [status or non-status], Inuit or Métis) applicants originating from the land now known as Canada, seeking work or already employed in the BC Public Service. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "COMM O 21R - Senior Communications Officer",
          "path_or_url": "/display_document.php?noheader=1&file_id=174896&action=download&req_attachment_id=52853"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121599",
    "scraped_at": "2025-11-09T17:47:41.333302",
    "matched_keyword": "Finance Officer",
    "match_score": 100
  }
}