{
  "job_posting": {
    "search_keyword": "Information Officer",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Public Safety & Sol General",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121419"
    },
    "metadata": {
      "posting_title": "COR SRV 18R - Correctional Officer",
      "posting_id": "121419",
      "job_title": "COR SRV 18R - Correctional Officer",
      "position_classification": "Correctional Serv (Growth>18)",
      "classification_code": "Correctional Serv (Growth>18)",
      "union": "GEU",
      "work_options": "On-Site",
      "locations": [
        "Kamloops, BC V2H 1B7 CA",
        "Maple Ridge, BC V4R 2S1 CA",
        "Multiple Locations, BC CA (Primary)",
        "Nanaimo, BC V9T 6L8 CA",
        "Oliver, BC V0H 1T2 CA",
        "Port Coquitlam, BC V3C 4W6 CA",
        "Prince George, BC V2N4P7 CA",
        "Victoria, BC V9B 6X2 CA"
      ],
      "salary": {
        "raw_text": "$60,662.32- $89,322.69 annually which includes a Temporary Market Adjustment of up to $254.83 bi-weekly and a $10,000 recruitment and incentive payment. Eligible employees will receive the recruitment and incentive payment of $10,000 annually (payable in two semi-annual installments of $5,000 and pro-rated for partial periods of employment), as well as a benefits package worth up to $19,851 annually.” (New recruits are paid $57,422.29 annually during the 33-day training program).",
        "min_amount": 60662.32,
        "max_amount": 89322.69,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "1/4/2026",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Public Safety & Sol General",
      "ministry_branch_division": "Adult Custody Division",
      "job_category": "Compliance and Enforcement, Correctional Services, Court and Judicial Services"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "The Team",
          "Welcome to the Adult Custody Division team. As an employee at one of ten correctional centres, you will work alongside a team of correctional officers towards the common goal of maintaining the safety and security of the individuals in our custody. Correctional officers have the opportunity to rotate through designated posts in several departments, each of which is overseen by a correctional supervisor and the broader management team to provide direction and guidance. This position is responsible for case management, and program facilitation to support our organizational efforts to reduce recidivism and create positive change. Through this process, correctional officers collaborate with numerous professionals committed to the same purpose, including educators, health professionals, chaplains, Indigenous Cultural Liaisons, volunteers and community partners.",
          "The Role",
          "The Adult Custody correctional officer is responsible for maintaining the security and safety of individuals in custody through pro-social modelling, program delivery, and offering positive guidance and clear direction. This position offers a rewarding opportunity to take an active role in creating a supportive environment and behavioural change for individuals in custody. This role offers an opportunity to work in multiple departments within the correctional centre alongside a team of dedicated professionals. As a correctional officer you will have the opportunity to utilize and strengthen your skills in communication, conflict resolution, and leadership.",
          "Adult Custody Division, part of BC Corrections, is responsible for the care and custody of approximately 2,800 individuals and plays a leading role in the criminal justice system.",
          "Interested in what our correctional officers have to say about the role? View this video!",
          "For more information about BC Corrections and our Correctional Centres please go to our BC Corrections Career Opportunity Page. Qualifications: Education and Experience Requirements",
          "• 19 years of age or older\n• Grade 12 or equivalent*\n• Grade 12 English with a final grade of 70% or equivalent*\n• Valid BC Driver's license (minimum class 5), or equivalent from another province.\n• Legally entitled to work in Canada (you must be legally permitted to work in Canada at the time you apply for a position either through citizenship or permanent residency)",
          "*For detailed information on Grade 12 and Grade 12 English equivalencies, view the “Applicant Process” attachment at the bottom of this posting.",
          "Note: Current BC Correctional Officers with Adult Custody Division are deemed to meet the initial requirements for the role and will be exempt from the screening/assessment stages preceding the interview. About this Position:",
          "There are multiple regular full-time positions available, based out of the location listed above. This position has full time on-site requirements. Correctional centres are 24-hour operations. Successful applicants will be required to work evenings/weekends/holidays and a variety of shift patterns. An eligibility list may be established to fill both current and/or future permanent vacancies. Please refer to MyHR for more information on Temporary Market Adjustments. Enhanced Security Screening will be required. Employees of the BC Public Service must be located in BC at the time of employment.",
          "For details about BC Corrections, correctional centres, and the hiring process, view the attachments in the Additional Information section. For more information, visit our BC Corrections Career Opportunity Page or email a recruiter at BCCorrections.Recruiting@gov.bc.ca to discuss the position in more detail, specifying your preferred location (Prince George, Kamloops, Oliver (Okanagan), Victoria, Nanaimo or the Lower Mainland).",
          "Working for the BC Public Service:",
          "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "We are committed to ensuring that reasonable accommodations are available throughout the hiring process, including the assessment and selection stages. Please email the individual or contact listed on the posting if you require an accommodation to fully participate in the hiring process.",
          "The Indigenous Applicant Advisory Service is available to Canadian Indigenous (First Nations [status or non-status], Métis, or Inuit) applicants. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
          "The BC Public Service is an award-winning employer and offers employees competitive benefits, amazing learning opportunities and a chance to engage in rewarding work with exciting career development opportunities. For more information, please see What We Offer.",
          "How to Apply: (view the “Applicant Process” attachment below for more detailed instructions on How to Apply)",
          "1. Short Questionnaire – YES 2. Resume – YES 3. Documentation in support of Grade 12 graduation, English language proficiency, Driver’s License and entitlement to work in Canada - YES 4. Cover Letter Required – NO",
          "NOTE: Have all Step 3 documentation ready before applying as incomplete applications will not be assessed. Correctional Officer positions are open year-round, offering ongoing opportunities to apply.",
          "Assessment Process",
          "Applicants that meet the minimum requirements AND submit the required documentation for Grade 12 graduation, English language proficiency, Driver’s License and legal entitlement to work permanently in Canada will be invited to complete further assessments in the hiring process below, according to the tentative assessment schedule.",
          "• Security Screening Questionnaire (SSQ)\n• Correctional Officer Physical Abilities Test (COPAT)\n• Written Communication Skills Assessment\n• Interview\n• Reference/Past Work Performance Checks\n• Valid Basic First Aid (OFA 1) or a Worksafe BC approved equivalent\n• Enhanced Security Screening\n• Medical Assessment",
          "In person attendance is required for most of the above assessments, namely: Written Assessment, Interview, Enhanced Security Screening, Medical.",
          "Assessment Schedule",
          "If you are unable to attend assessments during these dates, please wait to apply until you can. Correctional Officer positions are open year-round, offering ongoing opportunities to apply.",
          "Complete applications received by Nov 16",
          "Complete applications received by Jan 4/26",
          "COPAT/Written Communication Skills testing",
          "Dec 8-12",
          "Jan 26-30",
          "Interviews",
          "Jan 5-16",
          "Feb 17-27",
          "Enhanced Security Screening",
          "Feb 16-27",
          "Mar 30-Apr 10",
          "Medical Assessments",
          "Mar 2- 13",
          "Apr 13-May 1",
          "Applicants selected to move forward in the hiring process may be assessed on the Knowledge, Skills, Abilities and Competencies as outlined in the attached Job Profile located at the bottom of the posting.",
          "Additional Information:",
          "Correspondence about this competition will be sent to you from @gov.bc.ca email addresses. Please add @gov.bc.ca to your safe senders list to avoid missing out on these emails.",
          "Find more information on the recruitment process, including helpful tips and videos about the application process, visit the Your Job Application page of MyHR. Gain insights into the hiring journey by joining a Career Conversation. Applications will be accepted until 11:00 pm Pacific Standard Time on the closing date of the competition. If you are experiencing technical difficulty applying, visit the Technical Assistance page of MyHR."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "19 years of age or older",
        "Grade 12 or equivalent*",
        "Grade 12 English with a final grade of 70% or equivalent*",
        "Valid BC Driver's license (minimum class 5), or equivalent from another province.",
        "Legally entitled to work in Canada (you must be legally permitted to work in Canada at the time you apply for a position either through citizenship or permanent residency)"
      ],
      "preferred_experience_bullets": [
        "Security Screening Questionnaire (SSQ)",
        "Correctional Officer Physical Abilities Test (COPAT)",
        "Written Communication Skills Assessment",
        "Interview",
        "Reference/Past Work Performance Checks",
        "Valid Basic First Aid (OFA 1) or a Worksafe BC approved equivalent",
        "Enhanced Security Screening",
        "Medical Assessment"
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": null,
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service is available to Canadian Indigenous (First Nations [status or non-status], Métis, or Inuit) applicants. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "COR SRV 18R - Correctional Officer Job Profile",
          "path_or_url": "/display_document.php?noheader=1&file_id=174688&action=download&req_attachment_id=52760"
        },
        {
          "label": "Application Process",
          "path_or_url": "/display_document.php?noheader=1&file_id=174689&action=download&req_attachment_id=52761"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121419",
    "scraped_at": "2025-11-09T17:47:50.193184",
    "matched_keyword": "Information Officer",
    "match_score": 100
  }
}