{
  "job_posting": {
    "search_keyword": "Research Officer",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Royal BC Museum",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121508"
    },
    "metadata": {
      "posting_title": "Chief Executive Officer",
      "posting_id": "121508",
      "job_title": "Chief Executive Officer",
      "position_classification": "Deputy Minister Non-OIC",
      "classification_code": "Deputy Minister Non-OIC",
      "union": "N/A",
      "work_options": null,
      "locations": [
        "Victoria, BC V9B 6X2 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$243,000 - $309,309 annually",
        "min_amount": 243000.0,
        "max_amount": 309309.0,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "12/5/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Royal BC Museum",
      "ministry_branch_division": "CEO's Office",
      "job_category": "Leadership and Management"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "***Please DO NOT apply for this position by submitting your profile on this BC Government Hiring Centre website. Applications must be made via the following directions below.*** Chief Executive Officer ROYAL BC MUSEUM Victoria, BC Situated in the traditional territories of the Lekwungen - Songhees and Xwsepsum (Esquimalt) Nations - the Royal BC Museum and Archives (RBCM) holds a special place in the hearts and minds of British Columbians, Canadians and international visitors alike. RBCM’s collections, research and exhibitions enable visitors to understand and experience the stories of British Columbia in ways that enlighten, stimulate and inspire. By exploring British Columbia’s complex social and environmental histories and geographies, the RBCM advances new knowledge and understanding of the province and provides a dynamic forum for discussion and reflection. It is committed to acting on the Truth and Reconciliation Commission (TRC) Calls to Action, the United Nations Declaration on the Rights of Indigenous Peoples (UNDRIP) and British Columbia’s corresponding legislation, the Declaration on the Rights of Indigenous Peoples Act (DRIPA). Furthermore, RBCM continues to work towards decolonizing its policies and is committed to repatriating Indigenous belongings through its province-wide partnerships and relationships with Indigenous communities.",
          "With an opportunity to reimagine, renew and rebuild this iconic organization, the CEO will bring a steady hand to lead the organization through significant change, repatriation initiatives and the move to a two-campus operating model with the opening of the world-class PARC(Provincial Archives Research and Collections) building. The CEO will work closely and collaboratively with the Board to support their vision for the future of the Royal BC Museum & Archives and will lead a team of professionals in the implementation of a vigorous plan to realize that vision.",
          "As the leader and public representative of the organization, the CEO will represent the Royal BC Museum & Archives, creating opportunities for community and donor engagement that will increase attendance, earned revenue opportunities and donations. With the engaged oversight of the Board, the CEO will be accountable for activities such as policy development, budgets, financial management, planning, and staffing.",
          "As an advocate, the CEO will also look at avenues for collaboration within various constituencies to support and enhance the organization’s strategic priorities. The work of the CEO will be guided by a commitment to excellence, accessibility, community engagement, growth and sustainability with meaningful pursuit of reconciliation woven throughout each of these priorities. Demonstrating leadership attributes that bring staff, communities, and ideas together, the ideal candidate for this position is a highly creative visionary thinker with significant senior leadership experience in government and/or, operations in a museum or major cultural not-for-profit setting. An exceptional, engaged leader with sound judgement, critical thinking and the ability to work independently and collaboratively with all partner groups to optimize administrative efficiency, is critical in this role. Given the nature of the collections at the RBCM, preference will be given to candidates with demonstrated positive experience working with Indigenous peoples.",
          "The targeted salary range for this position is $243,000 - $309,309 annually, supplemented by a competitive total rewards package. Salary will be based on the candidate’s experience. Individuals with lived experience and knowledge of Indigenous (First Nations, Métis, or Inuit) communities, histories, values, legal orders, and cultural practices are encouraged to apply.",
          "If this is the next step in your professional career, please visit our website and submit your application to Shelina Esmail and Jennifer Madden at www.pfmsearch.com.",
          "DO NOT submit your application for this position through the BC Government Hiring Centre website. Applications submitted through the BC Government Hiring Centre will not be considered."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [],
      "preferred_experience_bullets": []
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": [
          "If this is the next step in your professional career, please visit our website and submit your application to Shelina Esmail and Jennifer Madden at www.pfmsearch.com."
        ]
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": null,
      "flexible_work_statement": null,
      "indigenous_applicant_advisory_service": {
        "available": false,
        "description": null,
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": []
    }
  },
  "scraping_metadata": {
    "job_id": "121508",
    "scraped_at": "2025-11-09T17:48:26.159286",
    "matched_keyword": "Research Officer",
    "match_score": 100
  }
}