{
  "job_posting": {
    "search_keyword": "Economic",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Ministry of Forests",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121254"
    },
    "metadata": {
      "posting_title": "LSO FORS 2 - Practices Forester – Closing date extended",
      "posting_id": "121254",
      "job_title": "LSO FORS 2 - Practices Forester – Closing date extended",
      "position_classification": "Licensed Sc Off Forester 2",
      "classification_code": "Licensed Sc Off Forester 2",
      "union": "PEA",
      "work_options": "Hybrid",
      "locations": [
        "Powell River, BC V8A 5G7 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$69,969.42 - $89,774.32 annually",
        "min_amount": 69969.42,
        "max_amount": 89774.32,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/18/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Ministry of Forests",
      "ministry_branch_division": "BCTS",
      "job_category": "Natural Resource Sector, Scientific and Technical"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "The Team: Join the Sunshine Coast Field Team at BC Timber Sales, Chinook Business Area, Sunshine Coast Office, and become part of a dedicated group of forest professionals. Based in Powell River, BC, our established team of approximately ten members manages the full forestry development lifecycle, ensuring sustainable and resilient forest ecosystems. Since 2003, we've been committed to inclusive and adaptive forest management practices, working closely with Indigenous Relations Staff and engaging meaningfully with First Nations and the public to balance social, economic, and cultural benefits while supporting over 8,000 jobs across British Columbia.",
          "The Role: As a Practices Forester, you'll play a crucial role in operational planning, cut block and forest road layout, silviculture activities, and ensuring compliance with the Forest Stewardship Plan. Your work will support BCTS’s commitment to sound forest management and sustainable environmental stewardship, positively impacting B.C.'s economy and communities. Join our cohesive and friendly Sunshine Coast field team, enjoy a balanced 35-hour work week, and contribute to initiatives that support highways, schools, and healthcare services. Embrace this opportunity to make a difference in B.C.’s forests and in your professional growth. To learn more about this opportunity, check out Why Work for the Ministry of Forests and the BC Timber Sales website.",
          "Qualifications:",
          "• A Registered Professional Forester (RPF), or be eligible for registration as an RPF with Forest Professionals British Columbia (FPBC) and two years of experience in operational field forestry activities.",
          "Operational field forestry activities include the following:",
          "• Timber harvesting monitoring/conformance\n• Cut-block development\n• Forest road engineering\n• Silviculture\n• Timber tenure development and administration\n• Planning integrated resource management\n• Must possess at minimum a valid Class 5 B.C. Driver’s License that does not limit or restrict the ability to conduct the duties of the job.",
          "Preference may be given to applicants with one (1) or more of the following:",
          "• Experience in more than one operational field forestry activity\n• Experience working with Indigenous Peoples\n• Experience in contract management",
          "Provisos:",
          "• Must be willing and able to withstand the rigors of fieldwork.\n• Must be willing to work in adverse weather conditions.\n• Must be willing and able to travel to meet job requirements.\n• Must be willing and able to travel in fixed and or rotary winged aircraft and or watercraft.\n• Must be able to maintain membership with Forest Professionals British Columbia (FPBC) as a member in good standing.",
          "For questions regarding this position, please contact Manuel.Medeiros@gov.bc.ca. About this Position: Amendment November 3, 2025: Posting closing date extended to November 18, 2025. This position is located in Powell River. Flexible work options are available; this position may be able to work up to 2 days at home per week subject to an approved telework agreement. An eligibility list may be established for similar vacancies within the BC Timber Sales Chinook Business Area, Powell River. Applicants who do not fully meet the required qualifications may be considered for this position, but at a lower classification. A Criminal Record Check (CRC) will be required. Employees of the BC Public Service must be located in BC at the time of employment.",
          "Working for the BC Public Service: The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "We are committed to ensuring that reasonable accommodations are available throughout the hiring process, including the assessment and selection stages. Please email the individual or contact listed on the posting if you require an accommodation to fully participate in the hiring process.",
          "The Indigenous Applicant Advisory Service is available to Canadian Indigenous (First Nations [status or non-status], Métis, or Inuit) applicants. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
          "The BC Public Service offers a healthy work/life balance, excellent benefits, including one of the best pension plans available, and a variety of opportunities for career learning and development. Regular, full time Professional Employee Association members are also entitled to 7% allowance in Lieu of Overtime Shiftwork and Standby (taken as time or money), have a 35 hour work week, and 4 weeks’ annual paid leave entitlement. To find out more, explore What the BC Public Service offers You.",
          "How to Apply: Your application must clearly demonstrate how you meet the job requirements listed above. Applicants who are selected to move forward in the hiring process may be assessed on their knowledge, skills, abilities, competencies and other position related requirements as outlined in the Job Profile at the bottom of the posting. Professional Designation: YES - Please include your registration number in your application. You must be registered (or immediately eligible for registration) as a Professional Forester with Forest Professionals British Columbia (FPBC). Note: immediately eligible for registration is defined as being able to transfer a current membership from an applicable jurisdiction. Applicants must confirm their eligibility with FPBC. Confirmation of registration/eligibility will be required before an offer of employment can be made.",
          "Cover Letter: NO - Please do not submit a cover letter as it will not be reviewed.",
          "Resume: YES - Ensure your resume includes your educational accomplishments, employment history including start and end dates (month and year) of your employment, and any relevant information that relates to the job to which you are applying.",
          "Questionnaire: YES - You will need to complete a basic questionnaire to demonstrate how you meet the job requirements.",
          "Find more information on the recruitment process, including helpful tips and videos about the application process, visit the Your Job Application page of MyHR. Gain insights into the hiring journey by joining a Career Conversation. Applications will be accepted until 11:00 pm Pacific Time on the closing date of the competition. If you are experiencing technical difficulty applying, visit the Technical Assistance page of MyHR."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "A Registered Professional Forester (RPF), or be eligible for registration as an RPF with Forest Professionals British Columbia (FPBC) and two years of experience in operational field forestry activities.",
        "Timber harvesting monitoring/conformance",
        "Cut-block development",
        "Forest road engineering",
        "Silviculture",
        "Timber tenure development and administration",
        "Planning integrated resource management",
        "Must possess at minimum a valid Class 5 B.C. Driver’s License that does not limit or restrict the ability to conduct the duties of the job."
      ],
      "preferred_experience_bullets": [
        "Experience in more than one operational field forestry activity",
        "Experience working with Indigenous Peoples",
        "Experience in contract management",
        "Must be willing and able to withstand the rigors of fieldwork.",
        "Must be willing to work in adverse weather conditions.",
        "Must be willing and able to travel to meet job requirements.",
        "Must be willing and able to travel in fixed and or rotary winged aircraft and or watercraft.",
        "Must be able to maintain membership with Forest Professionals British Columbia (FPBC) as a member in good standing."
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "Working for the BC Public Service: The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": "For questions regarding this position, please contact Manuel.Medeiros@gov.bc.ca. About this Position: Amendment November 3, 2025: Posting closing date extended to November 18, 2025. This position is located in Powell River. Flexible work options are available; this position may be able to work up to 2 days at home per week subject to an approved telework agreement. An eligibility list may be established for similar vacancies within the BC Timber Sales Chinook Business Area, Powell River. Applicants who do not fully meet the required qualifications may be considered for this position, but at a lower classification. A Criminal Record Check (CRC) will be required. Employees of the BC Public Service must be located in BC at the time of employment.",
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service is available to Canadian Indigenous (First Nations [status or non-status], Métis, or Inuit) applicants. Indigenous applicants can contact this service for personalized guidance on the BC Public Service hiring process including job applications and interviews.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "Job Profile_Practices Forester_121254",
          "path_or_url": "/display_document.php?noheader=1&file_id=174570&action=download&req_attachment_id=52672"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121254",
    "scraped_at": "2025-11-09T17:47:36.884629",
    "matched_keyword": "Economic",
    "match_score": 100
  }
}