{
  "job_posting": {
    "search_keyword": "Unknown",
    "source": {
      "jurisdiction": "British Columbia",
      "job_board": "BC Public Service",
      "organization": "Liquor Distribution Branch",
      "url": "https://bcpublicservice.hua.hrsmart.com/hr/ats/Posting/view/121577"
    },
    "metadata": {
      "posting_title": "ISL 27R - Senior QA Analyst",
      "posting_id": "121577",
      "job_title": "ISL 27R - Senior QA Analyst",
      "position_classification": "Information Systems R27",
      "classification_code": "Information Systems R27",
      "union": "GEU",
      "work_options": null,
      "locations": [
        "Burnaby, BC V3J 1N3 CA (Primary)"
      ],
      "salary": {
        "raw_text": "$83,071.72 - $94,752.42 per annum (plus Temporary Market Adjustment of 9.9%)",
        "min_amount": 83071.72,
        "max_amount": 94752.42,
        "frequency": "per annum",
        "currency": "CAD",
        "temporary_market_adjustment": null
      },
      "close_date": "11/20/2025",
      "close_time": "11:00 pm Pacific Time",
      "job_type": "Regular Full Time",
      "temporary_end_date": null,
      "ministry_organization": "BC Public Service -> Liquor Distribution Branch",
      "ministry_branch_division": "BC Liquor Distribution Branch",
      "job_category": "Information Management/Information Technology"
    },
    "amendments": [],
    "job_summary": {
      "about_organization": {
        "heading": null,
        "body": []
      },
      "about_business_unit": {
        "heading": null,
        "body": []
      },
      "about_role": {
        "heading": "Job Description",
        "body": [
          "About the BCLDB:",
          "The BC Liquor Distribution Branch (LDB) is one of two branches of government that provide oversight for the beverage alcohol and non-medical cannabis industries in the province. The LDB is responsible for the wholesale distribution of liquor and cannabis, and operates the retails brands BCLIQUOR and BC Cannabis Stores.",
          "The LDB is committed to government’s goals of making life better for people in B.C., improving services, and ensuring a sustainable province for future generations. The revenue generated by the LDB helps fund essential public services like health care, education, and community programming. Learn more on the LDB careers page.",
          "LDB’s Information Technology (IT) team consists of 7 competency areas: Customer Experience, Infrastructure & Operations (I&O), Information Security, Enterprise Architecture, Software Services, Data Services, and IT Program Governance. Currently 4 divisions managed by IT Directors collectively are responsible for all of the 7 competency areas to deliver the IT mandate of supporting LDB’s corporate and business operations and enabling future needs and initiatives.",
          "At present, the IT team consists of more than 260 full-time employees and includes a sourcing strategy to leverage external expertise to ensure the integrated IT team continues to deliver LDB’s strategic initiatives timely and in high quality.",
          "IT department of the LDB is responsible for the entire computing infrastructure for all of the 230+ BC Liquor Stores, BC Cannabis Stores as well as LDB’s head office in Burnaby and 4 Warehouse/Distribution Centres including Delta, Kamloops, Richmond, and Victoria. IT department also manages three data centres located in Burnaby, Delta and Kamloops.",
          "About this role:",
          "Reporting to the QA Manager, the Senior QA Analyst is responsible for test planning, presenting plans, identifying areas of improvement, creating and upgrading QA processes, creating reports, analyzing QA metrics, enforcing established QA processes, and liaising and coordinating with the operational lines of business. The Senior QA Analyst performs analysis of requirements, analyzing and confirming ability to test; defect tracking; development of automated test scripts/scenarios traceable to requirements using programming in Java, Python or C# and using tools(such as EggPlant). This role is responsible for performing manual and automated testing, performance testing, analysis and initial prioritization of defects, issues or change requests; running defect triage meetings and daily scrums to track project testing progress and designing, establishing, maintaining the test automation framework along with the automated regression and sanity test suite. The Senior QA Analyst provides coaching and mentoring to junior QAs on best QA practices and processes.",
          "A successful completion of a criminal record check is required.",
          "For complete details about this opportunity, including accountabilities, please refer to the attached job description, also located in the Additional Information section at the bottom of the posting.",
          "An eligibility list for permanent or temporary future opportunities may be established.",
          "Position requirements:",
          "Education and Experience:",
          "Degree or diploma in information technology, computer science or a related field, with a minimum of 6 years of recent, related experience*.",
          "OR",
          "A combination of education, training and experience may be considered i.e., secondary (high) school diploma or equivalent certification, and relevant coursework or certification in information technology, computer science or a related field, with 8 years of recent, related experience*.",
          "*Recent, related experience must have occurred in the last 10 years and must include the following:",
          "• Experience with developing and maintaining performance test suite using C# or Java.\n• Experience developing test automation framework based on Selenium WebDriver, Rest API, Appium, Sikuli, or similar application.\n• Experience deploying test automation in Continuous Integration and DevOps, e.g., Git, Azure DevOps.\n• Experience developing test automation scripts in one or more of the programming or scripting languages: Java or C#.\n• A minimum of 3 years’ experience leading QA projects such as task allocation, designing test automation frameworks, metrics collection, risk management etc.\n• Experience managing test environments (TEM).",
          "Preference may be given to candidates with any of the following experience:",
          "• Experience testing under an Agile environment.\n• Experience with test planning, test execution, test monitoring/control.\n• Experience with developing, executing and maintaining test automation scripts.\n• Experience with developing master test plans.\n• Experience utilizing test and defect management tools including Jira, Azure DevOps, Testlink.\n• Experience in writing test automation strategies, test automation demos and training.\n• Experience in developing and maintaining performance / load / stress testing framework and Java/C# scripts based on JMeter.\n• Software development experience with any object-oriented programming languages, for example, Java, C#, Python,\n• Experience with Oracle, SQL or MySQL.\n• Experience with Behavior-driven development (BDD).\n• Experience with test automation tool (preferably Eggplant).",
          "• Experience in testing data transformations.",
          "Application instructions:",
          "To be considered for this position, your application must clearly demonstrate how you meet the education and experience as outlined in the position requirements section above. Applicants selected to move forward in the hiring process may be assessed on the knowledge, skills, abilities and competencies as outlined in the attached Job Description. Applicants must meet the requirements as described below to be considered:",
          "• A cover letter is required as part of your application. The content and/or format of your cover letter may be evaluated as part of the assessment process.\n• Ensure your resume includes your educational accomplishments, employment history including start and end dates (month and year) of your employment, and any relevant information that relates to the job to which you are applying.",
          "For specific position-related enquiries, please contact Jennifer Robinson, HR Advisor, Talent and Compensation at jennifer.robinson@bcldb.com.",
          "Only applications submitted using the BC Public Service Recruitment System on this website will be accepted. Find more information on the recruitment process, including helpful tips and videos about the application process, visit the Your Job Application page of MyHR. Gain insights into the hiring journey by joining a Career Conversation. Applications will be accepted until 11:00 pm Pacific Time on the closing date of the competition. If you are experiencing technical difficulty applying, visit the Technical Assistance page of MyHR.",
          "Note: Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition.",
          "Working for the BC Public Service:",
          "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
          "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
          "The Indigenous Applicant Advisory Service is available to applicants that self-identify as Indigenous (First Nations, status or non-status, Métis, or Inuit) seeking work or already employed in the BC Public Service. For guidance on applying and interviewing, please contact IndigenousApplicants@gov.bc.ca or 778-405-3452.",
          "The BC Public Service is an award-winning employer and offers employees competitive benefits, great learning opportunities and a chance to engage in rewarding work with exciting career development options. For more information, visit What the BC Public Service Offers."
        ]
      },
      "special_conditions": [],
      "eligibility_list_note": null
    },
    "position_requirements": {
      "heading": "Position requirements",
      "education_and_experience": {
        "required_paths": [],
        "equivalency_statement": null,
        "recent_experience_note": null
      },
      "required_experience_bullets": [
        "Experience with developing and maintaining performance test suite using C# or Java.",
        "Experience developing test automation framework based on Selenium WebDriver, Rest API, Appium, Sikuli, or similar application.",
        "Experience deploying test automation in Continuous Integration and DevOps, e.g., Git, Azure DevOps.",
        "Experience developing test automation scripts in one or more of the programming or scripting languages: Java or C#.",
        "A minimum of 3 years’ experience leading QA projects such as task allocation, designing test automation frameworks, metrics collection, risk management etc.",
        "Experience managing test environments (TEM)."
      ],
      "preferred_experience_bullets": [
        "Experience testing under an Agile environment.",
        "Experience with test planning, test execution, test monitoring/control.",
        "Experience with developing, executing and maintaining test automation scripts.",
        "Experience with developing master test plans.",
        "Experience utilizing test and defect management tools including Jira, Azure DevOps, Testlink.",
        "Experience in writing test automation strategies, test automation demos and training.",
        "Experience in developing and maintaining performance / load / stress testing framework and Java/C# scripts based on JMeter.",
        "Software development experience with any object-oriented programming languages, for example, Java, C#, Python,",
        "Experience with Oracle, SQL or MySQL.",
        "Experience with Behavior-driven development (BDD).",
        "Experience with test automation tool (preferably Eggplant).",
        "Experience in testing data transformations."
      ]
    },
    "application_instructions": {
      "heading": "Application instructions",
      "evaluation_note": null,
      "requirements": {
        "cover_letter_required": true,
        "resume_details_required": true,
        "other_documents": []
      },
      "hr_contact": {
        "name": null,
        "title": null,
        "email": null
      },
      "submission_method": {
        "system_name": "BC Public Service Recruitment System",
        "notes": []
      },
      "technical_help_contact": {
        "email": "BCPSA.Hiring.Centre@gov.bc.ca",
        "notes": []
      },
      "deadline_note": "Applications will be accepted until 11:00pm Pacific Time on the closing date of the competition."
    },
    "working_for_bc_public_service": {
      "diversity_statement": "The BC Public Service is committed to creating a diverse workplace to represent the population we serve and to better meet the needs of our citizens. Consider joining our team and being part of an innovative, inclusive and rewarding workplace.",
      "flexible_work_statement": "This position is eligible for flexible work arrangements, such as a hybrid work combination of in-office and work-from-home, following the guidelines established for flexible workplaces.",
      "indigenous_applicant_advisory_service": {
        "available": true,
        "description": "The Indigenous Applicant Advisory Service is available to applicants that self-identify as Indigenous (First Nations, status or non-status, Métis, or Inuit) seeking work or already employed in the BC Public Service. For guidance on applying and interviewing, please contact IndigenousApplicants@gov.bc.ca or 778-405-3452.",
        "contact_email": null,
        "contact_phone": null
      },
      "employer_value_proposition": []
    },
    "attachments": {
      "job_description_files": [
        {
          "label": "Senior_Analyst_QA",
          "path_or_url": "/display_document.php?noheader=1&file_id=174846&action=download&req_attachment_id=52834"
        }
      ]
    }
  },
  "scraping_metadata": {
    "job_id": "121577",
    "scraped_at": "2025-11-09T17:42:05.378753",
    "matched_keyword": "Unknown",
    "match_score": 100
  }
}