{
  "poster_id": "2037132",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2037132",
  "title": "Development Program Officer",
  "department": "Indigenous Services Canada - First Nations and Inuit Health Branch",
  "branch": null,
  "city": "Ottawa",
  "province": "Ontario",
  "location_raw": "Ottawa (Ontario)",
  "classification_group": "PM",
  "classification_level": "01",
  "classification_raw": "PM-01",
  "closing_date": "2025-12-14T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 60424.0,
  "salary_max": 67582.0,
  "salary_raw": "$60,424 to $67,582",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad.",
  "employment_types": "Acting, Assignment, Deployment, Indeterminate, Secondment, Specified period",
  "positions_to_fill": null,
  "language_requirements_raw": "English essential",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "Program Officer",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:55:20.605151+00:00",
  "structure_type": "structure_2",
  "details": {
    "sections": {
      "work_environment": "In the First Nations and Inuit Health Branch (FNIHB) of Indigenous Services Canada, we strive to provide access to quality health services, improve health outcomes, and support greater control of the health system for First Nations and Inuit. We are searching for a collaborative and strategic individual who enjoys working in a dynamic environment, with a strong focus on quality client service. By joining our department, you will have the opportunity to provide direct support related to health services and community-based programming. You will build and support strong working relationships with First Nations and Inuit communities, families, and individuals, with a focus on improving health outcomes and reducing health risks.WORKPLACE:The official workplace for the position(s) to be filled is located in National Capital Region (NCR). Successful candidates will be required to maintain a presence at the NCR site or another ISC-CIRNAC facility depending on the position to be staffed . A part-time telework agreement (in a hybrid work mode) may be discussed and implemented at the time of hiring in accordance with the operational needs of the position to be filled.",
      "duties": "Do you like a challenge when you come to work? If so, the position of Program Officer in the Jordan’s Principle unit could be the perfect opportunity for you. You will work in a fast-paced environment, responding to inquiries over the phone and processing and triaging requests. This could be an opportunity for you to develop new skills and start a career with the federal public service. Successful candidates will be customer-service oriented, and have good attention to detail, communication skills, and computer skills.",
      "important_messages": "We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. Assessment accommodation When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies. As positions become available, applicants who meet the qualifications may be contacted for further assessment. If you are not familiar with inventories, please consult the ''Frequently Asked Questions'' section at the bottom of the advertisement.Indigenous Services Canada will periodically pull and review the applications received and contact applicants selected for further assessment based on the needs. The first pull of applications may be as early as January 3, 2024.**IMPORTANT INSTRUCTIONS TO FOLLOW**1) With the exception of the \"Ability to communicate in writing\", you MUST provide concrete and detailed examples to clearly demonstrate how you meet the essential criteria of education, experience and any asset education and asset experience if applicable. Your response must include HOW (concrete examples), WHEN(dates) and WHERE (location of work) you meet the essential criteria required. An online Screening Questionnaire has been created to assist you in completing this information.2)Your application, screening questions and text questions will be used to assess the Ability to communicate effectively in writing. Your responses to the screening questions will be used as the primary source of information and your resume will only be used to validate this information. Lack of examples and details, or indicating \"please refer to resume\", will result in your application being rejected as the Assessment Board will have insufficient information to determine if the requirement is met.3) Depending on the number of applicants, ISC needs and HR plans, volume management strategies such as random selection, application of one (1) or more assets, top-down approach, and/or cut-off scores MAY be used for the purpose of managing applications/candidates. Breadth and depth of the assessed qualifications may be considered.🎥 For tips on how to apply, check out this video:http://www.youtube.com/watch?v=0GW7P3g9hhIl",
      "operational_requirements": "",
      "conditions_of_employment": "Reliability Status security clearance",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Information on the preference to veterans We thank all those who apply. Only those selected for further consideration will be contacted.",
      "organization_information": "",
      "other_information": "The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply. Information on employment equity • Acknowledgment of receipt of applications will not be sent.• All communications relating to this process, including email correspondence may be used in the assessment of qualifications.• Communication for this process will be sent via email or via the Public Service Resourcing System (PSRS). It is the responsibility of the candidate to ensure accurate contact information is provided and updates as required. Candidates who apply to this selection process must include an email address that accepts email from unknown users (some email systems block these types of email).• Candidates are required to submit their application by using the online system. If you are unable to apply online, please contact the email address indicated in the \"Contact information\" section below. Please provide an explanation as to why you are not applying on-line for consideration. (Note: You must state the Selection Process number in the Subject of enquiry)• You must meet all essential qualifications in order to be appointed to the position. Other qualifications may be a deciding factor in choosing the person to be appointed. Some essential and other qualifications will be assessed through your application. It is your responsibility to provide appropriate examples that illustrate how you meet each qualification. Failing to do so could result in your application being rejected.• Depending on the requirements of the position(s) being staffed from this process, for current or future vacancies, any or all of the asset qualifications, operational requirements, and organizational needs may be applied at any stage in this selection process (i.e. screening and appointment stage).• Various means of assessment may be used (for example: interview, written exam, reference checks, performance assessments, achievement record), depending on the needs of the hiring manager.• Applicants are entitled to participate in the staffing process in the official language of their choice and are required to indicate their preferred official language in their application profile.• Candidates are expected to make a reasonable effort to make themselves available for assessments as scheduled. Rescheduling will only permitted for accommodation measures or for other exceptional/extenuating circumstances, to be determined on a case-by-case basis.• Candidates invited to the assessment stage will be required to provide proof of their education credentials, i.e., their degree or official transcript. Failure to do so may result in you not being considered further in the selection process.• Candidates with foreign credentials must provide proof of Canadian equivalency. Consult the Canadian Information Centre for International Credentials for further information at http://www.cicic.ca/_____________________________________________________________________FREQUENTLY ASKED QUESTIONS¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯◦ How does an inventory work?An inventory is a selection process that can be used by various hiring managers to meet their current and future needs. As a result, you will apply only once to be considered for multiple job opportunities at the PM-01 level.◦ Why was my application automatically rejected when I submitted it?In order to be placed in the inventory, you must meet the essential education qualification at the time you submit your application. If you receive a message \"Application rejected at screening\" immediately after submitting your application, you probably answered \"No\" to the screening question assessing the essential qualification of education. If you have incorrectly indicated \"No\" for this qualification, simply retrieve your application and update your answer to the screening question.◦ What happens if my application expires?Your application will be kept in the inventory for 90 days. A notice will be posted in the \"My Job File\" menu of your account 12 days before your application expires. If you do not take this into account, your application will be deactivated and it will no longer be considered for submissions from this inventory. In the event that your application expires during the effective period of this inventory, a notice will be posted in your account. If you wish to confirm your interest and reactivate your application, select the \"Renewal of my application\" link.◦ I have a disability that does not allow me to apply online, who do I contact to help me with the submission of my job application?We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request accommodation. All information received in relation to accommodation will be kept confidential.",
      "intent_of_process": "This process aims to create and maintain an inventory of applications that may be used to fill various term or indeterminate appointment opportunities. A pool of qualified candidates may be established and may be used to fill similar positions, in various locations and tenures.When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies. As positions become available, applicants who meet the qualifications may be contacted for further assessment. Based on the hiring needs, additional essential qualifications, asset qualifications, organizational needs, operational requirements and/or conditions of employment may be identified and applied during the assessment and/or selection of candidates.Re-evaluation period: If you submitted an application and/or underwent assessment and were found not qualified, you may resubmit an application to be considered after a 3 month waiting period, from the time when the last assessment was completed. Positions to be filled: Number to be determined",
      "reference_number": "DIS23J-130301-000088",
      "selection_process_number": "23-DIS-ON-EA-609394"
    },
    "qualifications": {
      "essential": {
        "education": [
          "A secondary school diploma or employer-approved alternatives (see Note 1).Note:1. The employer-approved alternatives to a secondary school diploma are:o A satisfactory score on the Public Service Commission test approved as an alternative to a secondary school diploma; oro An acceptable combination of education, training and/or experience.Candidates who already meet both of the following criteria must be accepted as meeting the secondary school diploma requirement:o Candidates who have achieved a satisfactory score on the Public Service Commission test approved as an alternative to a secondary school diploma; ando Candidates who have been appointed or deployed for an indeterminate period to a position in the PM classification."
        ],
        "experience": [
          "- Experience in using technology (e.g. Outlook, Excel, Microsoft Word or Internet) - Experience in investigating issues in a client service environment"
        ],
        "knowledge": [],
        "abilities": [
          "- Ability to manage a high volume workload"
        ],
        "competencies": [],
        "personal_suitability": [
          "- Planning, Organizing, and Monitoring"
        ]
      },
      "asset": {
        "education": [],
        "experience": [
          "- Experience in data entry and maintaining spreadsheets and/or databases for the tracking of various types of information - Experience delivering services or support to Indigenous clients; involving providing information requiring explanation or clarification. - Experience in booking and coordinating travel, accommodations and meals - Experience working in a call center environment - Experience using a financial management system or customer service management system. - Experience using Systems Applications and Products in Data Processing (SAP). - Experience using Medical Transportation Records System (MTRS). - Experience working with the Jordan’s Principle initiative. - Experience reviewing and processing applications or submissions or requests against relevant policies or guidelines."
        ],
        "knowledge": [],
        "abilities": [
          "- Respect for Diversity"
        ],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "Jaclyn Gartner, Human Resources Advisor dotationnonex-nonexstaffing@sac-isc.gc.ca Apply online"
        }
      ]
    }
  }
}