{
  "poster_id": "2305996",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2305996",
  "title": "Site Manager",
  "department": "Statistics Canada - Various locations",
  "branch": null,
  "city": null,
  "province": null,
  "location_raw": "",
  "classification_group": "EG",
  "classification_level": "06",
  "classification_raw": "EG-06",
  "closing_date": "2025-11-30T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 86801.0,
  "salary_max": 109119.0,
  "salary_raw": "$86,801 to $109,119",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad.",
  "employment_types": null,
  "positions_to_fill": 1,
  "language_requirements_raw": "",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "Manager",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:53:52.366538+00:00",
  "structure_type": "structure_2",
  "details": {
    "sections": {
      "work_environment": "WHO ARE WE?Statistics Canada provides Canadians with high-quality statistical information that matters.EVERYONE IS WELCOMEStatistics Canada is the winner of Canada's Best Diversity Employers and is dedicated to building an inclusive workforce that welcomes individuals who have an array of identities, abilities, background, culture, skills, perspectives, and experiences that are representative of Canada's current and evolving population.Once you have been hired, workplace accommodations or adjustments will be provided to give you the opportunity to fully use your competencies at work. Tools such as the Accessibility Passport will help you and your manager identify possible accommodation measures to be implemented, giving you the tools, you would need to thrive in your job.BRING YOUR WHOLE SELF TO WORKWe encourage all qualified candidates to apply, regardless of race, colour, religion, sex (including gender identity and/or expression), national origin, sexual orientation, civil union or relationship status, disability, age, parental status, military service, or other status protected under federal law.To learn more about us, visit our website: https://www.statcan.gc.ca/eng/startWHY JOIN STATISTICS CANADA?Statistics Canada is dedicated to an inclusive work environment where employees are treated equitably and reflect the Canadian population we ultimately serve. We are a competent, engaged and productive workforce. We embrace new ways of working and encourage a diversity of talent to help fulfill Statistics Canada’s mandate to the highest standards.🌍 Statistics Canada is a world-renowned leader in its domain, and its employees are proud to fulfill its mission: to serve Canada with high-quality statistical information that matters. We want to help Canadians better understand their country, so they can make more thoughtful decisions. The advantages of a strong workplace cannot be understated. Diverse. Accommodating. Nurturing. Rewarding. For employees to reach their full potential, a workplace MUST meet all of these criteria. Our success lies with a dynamic workforce that strives for excellence and innovation. We are proud to provide a healthy, respectful and supportive work environment for all employees and offer opportunities to develop and acquire new skills.👏 We encourage our employees to innovate and strive for excellence, we promote career advancement, encourage continued learning and training, and embrace new technologies that allow us to increase efficiency and flexibility in our work environment.",
      "duties": "- The successful candidate will work in the temporary examination centre (TEC) of a unique national study and continuously travel to various collection sites across Canada.- The successful candidate will plan and supervise the work of technical staff in the conduct of the physical measures testing; develop work plans; assign and coordinate the work of the field team; provide technical leadership and guidance to field staff; evaluate performance; and administer and manage allocated financial and materiel resources of the temporary examination centre (TEC). - The candidate will plan, organize and oversee the daily operations of the TEC including security, shipping & receiving, inventory control, waste disposal, modification and application of processes, procedures, and techniques.- The candidate will assess the physical measures processes and procedures and provide recommendations to improve procedures and processes.- The candidate will liaise with external partners at the TEC location including, health region officials, local dignitaries, media, visitors to the clinic, survey respondents and internal (StatCan) project team members at head office.- The candidate will provide interpretation, instruction and ensure compliance of health and safety guidelines, quality control and data security measures, policies and procedures while on the work site.- The candidate will provide tours of the TEC, meet with local dignitaries and represent Statistics Canada through explanation, and provide information products for local and national audiences. - The candidate will work closely with the interview team to ensure a seamless operation between information flow and scheduling of respondents’ appointments for both the home interviews and TEC visits. - The candidate will ensure appropriate procedures are being maintained for data entry, data verification and data transfer.- The candidate will participate in the development of procedure manuals, training and communication material and organize and present staff training sessions.- The candidate will ensure appropriate physical measures protocols are being employed and document adverse events that occur within the TEC environment and take corrective action as required.",
      "important_messages": "We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. Assessment accommodation When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies. As positions become available, applicants who meet the qualifications may be contacted for further assessment. Join the Centre for Direct Health Measures (CDHM) at Statistics Canada! If you have an adventurous spirit and enjoy travel, this is the position for you. During collection, you may be on continuous travel status, travelling across Canada as part of a survey collection team who moves to a new Canadian city every few weeks gathering direct health measures. Travel accommodations, transportation and per diems are included, under the National Joint Council (NJC) travel directive, for further information regarding this please consult the NJC website.To learn more information about CDHM activities, consult the video showcasing the temporary examination centre (TEC) where you could potentially be working.www.statcan.gc.ca/en/survey/household/5071https://www.youtube.com/watch?v=z7w0avNMUtkhttp://www.statcan.gc.ca/eng/sc/video/chms-mobile-centre💻 You must complete the assessment independently without external help, including unauthorized internet resources or Artificial Intelligence (AI) tools (for example, Copilot, ChatGPT or any other form of AI). You may be asked to explain or elaborate on your answers in a follow-up interview. Any violation may be investigated and result in serious consequences, including the rejection of your application.",
      "operational_requirements": "",
      "conditions_of_employment": "- Reliability Status security clearance.- Working on the move continuously. CDHM’s direct health measures surveys travel every few weeks to a new collection site somewhere in Canada.- Willingness to work shifts (evenings, weekends), holidays and overtime, depending on operational needs.- Must possess a valid Canadian driver’s license.",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Information on the preference to veterans We thank all those who apply. Only those selected for further consideration will be contacted.",
      "organization_information": "",
      "other_information": "The Public Service of Canada is committed to building a skilled and diverse workforce that reflects the Canadians we serve. We promote employment equity and encourage you to indicate if you belong to one of the designated groups when you apply. Information on employment equity Statistics Canada is committed to hiring and promoting a skilled and diversified workforce representative of the population it serves. In order to achieve this representative workforce, preference may be given to candidates who, at the time of application, indicate that they are belonging to one of the following Employment Equity groups (self-declaration): Indigenous peoples, Women, Visible Minorities and Persons with Disabilities.At Statistics Canada we recognize that a diverse and inclusive workplace that can harness the diverse backgrounds, talents and perspectives of its employees is essential to building a better, more productive and more innovative Canada. Statistics Canada promotes the advantages of diversity and inclusion in the federal government and offers interesting career opportunities and rewarding challenges for everyone.Candidates must meet the essential qualifications to be appointed to a position.Candidates may be required to meet the asset qualifications or the organizational needs, depending on the requirements of the specific position being staffed.The following evaluation tools may be used during this selection process:1. Written exam2. Track record3. Interview4. Reference checkAcknowledgment of receipt of applications will not be sent. We will contact candidates when the screening process is completed.E-mail correspondence will be used as the main method of communication for this selection process. Candidates who do not wish to receive their results by e-mail must contact the human resources representative listed on this advertisement to inform them of their preferred method of communication. Please note that the onus is on the candidates to provide valid contact information and to update it, if required. Candidates must also ensure that their contact information is accurate and up to date as Statistics Canada will not be held responsible for errors related to the transmission of correspondence.In order to determine if you meet the education requirement, your proof of education is required and needs to be provided as soon as requested.Persons are entitled to participate in the appointment process in the official language(s) of their choice. Applicants are asked to indicate their preferred official language(s) in their application.Candidates who have been assessed and found to have met all essential qualifications may update their Second Language Evaluation (SLE) results for as long as the pool is valid. Please note that candidates can undergo SLE testing only once within the context of a selection process; any update to a candidate’s linguistic profile must be as a result of subsequent SLE testing done outside of the scope of this selection process.Statistics Canada is committed to fostering a diverse, inclusive and barrier-free workplace. When completing your application and preparing for the evaluations, we encourage you to provide non-work-related examples if you consider them more relevant to the position being filled. Your examples may be from your professional experience or from your studies, volunteer work, hobbies or any other personal experience that is relevant to demonstrating how you meet the position’s essential criteria.Resumes will only be used as a secondary source to validate the education and experience described in the questionnaire. Failure to provide sufficient details concerning the EDUCATION AND EXPERIENCE essential qualifications in the SCREENING QUESTIONS portion of your application will result in your elimination from the process. If applicable, in your application, please demonstrate with examples how you meet the asset qualifications. The asset qualifications are desirable and may be a deciding factor in choosing the person to be appointed.Here is a suggestion to help you explain your examples:S = What was the situation or context?T = What were your tasks or responsibilities?A = What actions did you take?R = What was the result of your actions?Please note that the first assessment process that will be conducted via this inventory will begin in April 2025, with the screening phase. Other screening processes will be conducted periodically as vacancies arise.TRACK RECORDInformation for applicants:The track record is an assessment tool that provides a template for the applicant to describe work-related accomplishments and behaviours.You must clearly demonstrate how you meet each of the essential education, experience, and key leadership competencies by concretely describing situations where you demonstrated behaviours associated with each qualification.For each qualification you must provide one or more examples from your own experience that demonstrate how you meet the qualification.The example must reflect your typical work performance that demonstrate on a regular basis. You must provide sufficient details in your track record to demonstrate:1) That you possess the essential qualification (e.g. possess the experience or meet the competency);AND2) That the quality of your work demonstrates that you are qualified for the position to be staffedQUESTIONS AND ANSWERS CONCERNING THE TRACK RECORDQ1. Can I ask for accommodation or an adapted format when filling out the track record?Yes, if you experience barriers when completing the track record, or need an alternate method of demonstrating these competences, please contact us.Q2. What are some guidelines that could help me prepare my track record?Use the STAR method (situation, task, action, result) to respond to the questions. This structure is a way to discuss specific situations from your past experiences.Situation: Describe the specific scenario you were in, including when and where it occurred, who was involved, and any relevant background details necessary for understanding the situation.Task: Clearly define the goal or objective you were trying to accomplish within that particular context. Explain why this goal was important and what was at stake.Action: Describe in detail the actions you personally took to address the situation and make progress towards achieving your goal. Use concrete examples, emphasizing your individual contributions with action verbs in the past tense. Avoid vague statements like \"we decided\" or \"we organized\", focusing instead on your own role and impact.Result: Describe the outcome of your actions and how the situation was resolved. Highlight any positive results or accomplishments that resulted from your efforts. Reflect on the complexity and impact of your examples, ensuring they effectively showcase your abilities. Write in clear, concise paragraphs, and steer clear of acronyms. Remember, it's up to you to independently complete your track record, as management won't provide assistance. Your home Director will be asked to validate the provided information for accuracy and confirm your readiness for the position to be staffed. The Director may contact your supervisor or clients to obtain the necessary information to validate your examples.Q3. Can my supervisor or any other members of management help me complete my track record?No, supervisors and managers should not assist employees with the completion of their track record.Q4. I do not express myself as well in writing as other employees. Will I be disadvantaged?No, the ability to communicate in writing will not be assessed with the track record.Applicants must be clear in the examples they provide so that the Director validating the track record can understand the examples provided.If you require accommodation or experience accessibility barriers when completing the track record please contact us.Q5. Can employees use the same example for more than one qualification?Yes, if the example provided answers the questions and illustrates the qualifications evaluated.Q6. My Manager is not aware of my day-to-day work. How can he/she validate my example?The Manager may contact your immediate supervisor or clients to obtain the necessary information to validate your example.Q7. Will Managers be able to comment or add information to the employee’s track record?The Manager may comment if they determine an employee has significantly overrepresented or underrepresented their work on the track record.Q8. How will the evaluation and rating work? Will there be a passing mark for each qualification or will it be an overall score?A pass/fail will be assigned for each of the essential qualifications.",
      "intent_of_process": "This inventory will be used to staff various EG-06 positions, or equivalents, for which the duration of employment, language and security requirements, conditions of employment and work locations will vary according to the position to be staffed. Please also note that, depending on the position to be filled, asset qualifications mentioned in this posting may be required for the job and therefore considered essential qualifications. In addition, other qualifications, whether essential or asset, may be added depending on the position to be filled. You may therefore be assessed for additional qualifications not included in this posting. Positions to be filled: 1",
      "reference_number": "STC25J-176825-000199",
      "selection_process_number": "25-STC-EA-NCR-823-818"
    },
    "qualifications": {
      "essential": {
        "education": [
          "Graduation with a degree from a recognized university with an acceptable medical specialization related to the position or acceptable health professional specialization from a recognized post-secondary institution."
        ],
        "experience": [
          "EXP1. Recent* experience in supervising a multidisciplinary team, creating schedules and assigning work.EXP2. Recent* experience in implementing and monitoring quality control or quality assurance programs.EXP3. Recent* experience in developing operational policies and procedures and managing and implementing health and safety programs.EXP4. Experience with operational arrangements, planning, organizing and carrying out administrative activities such as resources, materials, time and cost estimates.EXP5. Experience in writing procedure manuals, developing and delivering training plans and assessing performance.EXP6. Experience in establishing or maintaining partnerships or collaborative relationships with various stakeholders (such as internal partners, central agencies, federal, provincial or territorial partners or interest groups).*Recent is defined as having performed the duties within the last five (5) years."
        ],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      },
      "asset": {
        "education": [],
        "experience": [
          "Recent* experience in collecting direct physical health measures from a diverse population.*Recent is defined as having performed the duties within the last five (5) years. ASSET"
        ],
        "knowledge": [
          "Knowledge of physical health measures. Selection may be limited to members of the following Employment Equity groups: Aboriginal persons, persons with disabilities, visible minorities, women Information on employment equity"
        ],
        "abilities": [
          "abilities, visible minorities, women Information on employment equity"
        ],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "Cindy Gauvin, Human Resources Advisor Laurie Martin, Senior Administrative Assistant in Staffing cindy.gauvin@statcan.gc.ca laurie.martin@statcan.gc.ca Apply online"
        }
      ]
    }
  }
}