{
  "poster_id": "2362919",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2362919",
  "title": "IT Analyst, IT Software Solutions - Eastern Region",
  "department": "National Defence - Bagotville (Québec), Montréal Island (Québec), Québec (Québec), Saint-Jean-sur-Richelieu (Québec), Valcartier (Québec)",
  "branch": null,
  "city": null,
  "province": null,
  "location_raw": "",
  "classification_group": "IT",
  "classification_level": "02",
  "classification_raw": "IT-02",
  "closing_date": "2025-12-16T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 85854.0,
  "salary_max": 105080.0,
  "salary_raw": "$85,854 to $105,080",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad.",
  "employment_types": null,
  "positions_to_fill": null,
  "language_requirements_raw": "",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "IT Analyst",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:52:48.807615+00:00",
  "structure_type": "structure_2",
  "details": {
    "sections": {
      "work_environment": "Are you seeking a rewarding career opportunity within the Department of National Defence (DND) in the Eastern Region? Look no further. This process is designed to identify talented individuals seeking to make a difference and grow professionally while surrounded by the history of our nation, and vibrant life simultaneously. Whether you want to be submerged in nature, or immersed in energy of the metropolitan cities, Quebec, Montreal and their surrounding areas awaits you.If you are looking for a change or looking to further your career, this process is tailored to candidates LIKE YOU to cater to the information technology needs of the Eastern Region.Together, DND and the Canadian Armed Forces (CAF) form the largest and most complex organization in Canada. DND's role is to provide services and support to the CAF in their operations and missions at home and abroad. DND and the CAF work side-by-side to fulfill the Government of Canada’s mission to defend Canada and Canadians and contribute to international peace, security and stability efforts.Don't miss out on this chance to expand your skillset and career journey within DND and apply now!",
      "duties": "",
      "important_messages": "We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. Assessment accommodation When you apply to this selection process, you are not applying for a specific job, but to an inventory for future vacancies. As positions become available, applicants who meet the qualifications may be contacted for further assessment. On October 16th, 2025 we will be pulling applications to fill immediate needs in the following locations:↪ Saint-Jean-sur-Richelieu↪ Montreal↪ Valcartier↪ BagotvilleThe first applications will be collected from this process on October 16th, 2025. Apply before this date to be considered for our immediate vacancies.The second round of applications will be collected from this process on November 20th, 2025.----------------------------------------------------------📢 How does this work?✅ Step 1: Read the entire advertisement. Want to join our team? Let us know you’re interested! Click “Apply Online”✅ Step 2: Tell us about yourself! Attach your resume and answer the screening questions in the online application.✅ Step 3: We will carefully review all your qualifications. If your talent matches one of our immediate or upcoming opportunities, we may contact you for further information or assessment.Creating an environment where diverse perspectives are valued begins with self-declaration. Count yourself in and self-declare by identifying to which employment equity group(s) you belong. In order to self-declare, please ensure to indicate this by checking off the appropriate box within the online application as part of the Employment Equity section.________________________________________________________________________________________________________Please note that our assessments will require the use of technology, including email, as part of the process. However, we are committed to ensuring equal access for everyone. If you do not have access to the necessary technology or face any challenges, we are happy to provide accommodations to support your participation. Please feel free to reach out, and we will work with you to find a solution that meets your needs.INTEREST IN OTHER LOCATIONSIn support of mobility and accessibility, we invite those who are interested in indeterminate opportunities and able to work onsite from Department of National Defence locations other than those listed on this poster, to apply on the regional selection processes for those locations. (Pro-tip: you may cut and paste your answers).Selection Processes:↪ 25-DND-EA-NAST-540378-A (Atlantic)↪ 25-DND-EA-NAST-540378-C (Ontario)↪ 25-DND-EA-NAST-540378-D (Prairies)↪ 25-DND-EA-NAST-540378-E (Pacific)↪ 25-DND-EA-NAST-540378-F (Northern)Candidates who apply on various regional posters will only be assessed once. Results of this assessment will be applied to each individual process, if more than one application is submitted.The information you will be providing in this application must be true and may be verified. Any false information may result in the rejection of your application and/or not hiring you. Please only check off the locations that you are truly willing and able to work from. We value honesty. Choosing a location that you are not truly willing and able to work from slows down the process and impacts our ability to staff positions within the Department. Any false information provided on a location of interest may result in your removal from this process.The following refers to Indeterminate/Term Employees of the government only: This process may also be used for temporary opportunities (actings appointments, assignments, or secondments) which may be outside your current work location. This will provide candidates from across the country the opportunity to fill temporary needs in different Department of National Defence locations, work permitting, while still adhering to the Common hybrid work model and Directive on Prescribed Presence in the Workplace.",
      "operational_requirements": "",
      "conditions_of_employment": "Various security clearances - Reliability, Secret, or Top SecretNOTE: Top Secret (TS) clearances will only be granted to Canadian citizens.COE1. Strict adherence to the Department of National Defence and Canadian Forces Code of Values and Ethics, Values and Ethics Code for the Public Sector, Directive on Conflict of Interest, and Defence Administrative Orders and Directives (DAOD) 7021-1, Conflict of Interest.Copy and paste these links in your browser for more information:https://www.canada.ca/en/department-national-defence/services/benefits-military/defence-ethics/policies-publications/code-value-ethics.htmlhttps://www.tbs-sct.canada.ca/pol/doc-eng.aspx?id=25049https://www.tbs-sct.canada.ca/pol/doc-eng.aspx?id=32627https://www.canada.ca/en/department-national-defence/corporate/policies-standards/defence-administrative-orders-directives/7000-series/7021/7021-1-conflict-of-interest.html",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Information on the preference to veterans We thank all those who apply. Only those selected for further consideration will be contacted.",
      "organization_information": "",
      "other_information": "______________________________________________________ ▶ Persons are entitled to participate in the appointment process in the official language of their choice.▶ Our organization will only accept on-line applications for this opportunity. Please click “Apply online” to submit your application. If there are limitations or special circumstances preventing you from submitting your application via the GC Jobs online portal, you must contact us and receive approval to apply via an alternate means PRIOR to the closing date.▶ Depending on the position being staffed:↪ Additional qualifications, operational requirements and/or conditions of employment may be required↪ Varying degrees of breadth and depth of experience may be deemed essential↪ Asset qualifications may be invoked as essential qualifications↪ You may be contacted and asked to submit information or be further assessed▶ Applicants who apply to this selection process must include in their application a valid email address and make sure that this address is functional at all times and accepts messages from unknown users.▶ All information obtained throughout the selection process, from the time of application to close of process, may be used to evaluate the applicants. Your overall conduct and communications, including email correspondence, may be used in the assessment of qualifications and competencies.▶ To ensure the integrity of the selection process, the content and questions of the assessment must remain confidential. Please do not discuss or share the assessment content with anyone, including other candidates. You must complete the assessment, including screening questions, by yourself, without the help of others, including the use of unapproved internet resources and artificial intelligence (such as ChatGPT or any other forms of artificial intelligence). Plagiarism and the use of artificial intelligence is strictly prohibited throughout the entire process and suspected non-compliance will be investigated. Any violation may result in potential consequences which could include your elimination from this selection process.▶ If, at any point in this process or upon qualifying in this process, your Values and Ethics do not align with that of the Department of National Defence and Canadian Forces Code of Values and Ethics and Values and Ethics Code for the Public Sector, you will be eliminated from further consideration in this process. (Copy and paste these links in your browser for more information: https://www.canada.ca/en/department-national-defence/services/benefits-military/defence-ethics/policies-publications/code-value-ethics.html AND https://www.tbs-sct.canada.ca/pol/doc-eng.aspx?id=25049)▶ Appointment decisions may be based on one or more of the following criteria:↪ Matching of the individual's experience or qualifications to the strengths and weaknesses of the work team;↪ Matching of the individual's experience or qualifications to the specific duties of the position being staffed;↪ Depth, breadth, type of work-specific experience;↪ Level/degree of one or more competencies/qualifications;↪ Organizational Needs.",
      "intent_of_process": "A pool of partially or essentially qualified candidates may be established through this process and used to staff identical or similar positions with various employment tenures (temporary and permanent), various language profiles, operational requirements, and conditions of employment at the Department of National Defence which includes the Canadian Coast Guard.In line with Treasury Board Secretariat (TBS) direction, the Department of National Defence has adopted a common hybrid work model where employees work at their designated worksite at least 3 days each week, or 60% of their regular schedule. Positions to be filled: Number to be determined",
      "reference_number": "DND25J-146895-000112",
      "selection_process_number": "25-DND-EA-NAST-540378-B"
    },
    "qualifications": {
      "essential": {
        "education": [
          "1. Graduation from a two-year program of study from a recognized post-secondary institution with acceptable specialization in computer science, information technology, information management or another specialty relevant to the position to be staffed.Note:1. Indeterminate incumbents in the IT group on December 9, 2021 who do not possess the education prescribed above, are deemed to meet the minimum education standard based on their education, training and/or experience. They must be accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the IT group.2. Indeterminate incumbents of positions in the CS group on May 10, 1999, who do not possess the education prescribed above, are deemed to meet the minimum education standard based on their education, training and/or experience. They must be accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the IT group.3. At the manager’s discretion, an acceptable combination of education, training and/or experience may serve as an alternative to the minimum education stated above. Whenever the minimum education is met using this alternative, it is met for the specific position only and must be re-assessed for other positions for which this alternative has been specified by the manager.*An acceptable combination of “education, training and/or experience” refers to a QL 5 qualified military member from a relevant IT-related military occupation. Vocational training credentials (12 months + programmes of study) combined with relevant work experience will also be considered. The candidate should be prepared to describe this combination of study and experience in detail in the application. EXPERIENCEEX1. Experience in developing software solutions on various technology platforms (for example on any one or more of the following: C #, React, Oracle Apex. Other platforms, as applicable.) EX2. Experience in System Development Life Cycles (SDLC) (e.g. Waterfall, V-Model, iterative)."
        ],
        "experience": [
          "experience. They must be accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the IT group.2. Indeterminate incumbents of positions in the CS group on May 10, 1999, who do not possess the education prescribed above, are deemed to meet the minimum education standard based on their education, training and/or experience. They must be accepted as having met the minimum education standard whenever this standard is called for when staffing positions in the IT group.3. At the manager’s discretion, an acceptable combination of education, training and/or experience may serve as an alternative to the minimum education stated above. Whenever the minimum education is met using this alternative, it is met for the specific position only and must be re-assessed for other positions for which this alternative has been specified by the manager.*An acceptable combination of “education, training and/or experience” refers to a QL 5 qualified military member from a relevant IT-related military occupation. Vocational training credentials (12 months + programmes of study) combined with relevant work experience will also be considered. The candidate should be prepared to describe this combination of study and experience in detail in the application. EXPERIENCEEX1. Experience in developing software solutions on various technology platforms (for example on any one or more of the following: C #, React, Oracle Apex. Other platforms, as applicable.) EX2. Experience in System Development Life Cycles (SDLC) (e.g. Waterfall, V-Model, iterative)."
        ],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      },
      "asset": {
        "education": [],
        "experience": [
          "1. Experience working or volunteering in a mixed civilian and military environment.AEX2. Experience in Entity-Relationship or Object data modeling. AEX3. Experience in the object-oriented approach and Unified Modeling Language (UML). AEX4. Experience conducting research with clients to identify appropriate existing or new IT solutions.AEX5. Experience managing short-term software solutions projects as lead or participating as key team member.AEX6. Experience providing software solutions services in an academic institution. ORGANZATIONAL NEEDSThe Department of National Defence is committed to creating a diverse and inclusive team that reflects Canada's population.To achieve a representative workforce, selection may be based on qualified candidates self-declaring as belonging to one or more of the designated groups: Indigenous Peoples, members of visible minorities, persons with disabilities, and women.We encourage you to indicate if you belong to any of the designated groups when you apply.As a means to support our military families, consideration may be first given to the spouses or common-law partners of serving Canadian Armed Forces (CAF) members. Information on employment equity"
        ],
        "knowledge": [],
        "abilities": [
          "abilities, and women.We encourage you to indicate if you belong to any of the designated groups when you apply.As a means to support our military families, consideration may be first given to the spouses or common-law partners of serving Canadian Armed Forces (CAF) members. Information on employment equity"
        ],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "National Advertised Staffing Team DNDAdvertisedProcesses-ProcessusannoncesMDN@forces.gc.ca Apply online"
        }
      ]
    }
  }
}