{
  "poster_id": "2370982",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2370982",
  "title": "Junior Data Analyst",
  "department": "Office of the Chief Electoral Officer",
  "branch": "Digital Transformation",
  "city": "Gatineau",
  "province": "Québec",
  "location_raw": "Gatineau (Québec)",
  "classification_group": "EC",
  "classification_level": "02",
  "classification_raw": "EC-02",
  "closing_date": "2025-11-10T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 70338.0,
  "salary_max": 80642.0,
  "salary_raw": "$70,338 to $80,642",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad.",
  "employment_types": null,
  "positions_to_fill": 2,
  "language_requirements_raw": "Applied / assessed at a later date",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "Junior Data Analyst",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:52:55.762794+00:00",
  "structure_type": "structure_1",
  "details": {
    "sections": {
      "work_environment": "Work environment Come work with us and contribute to Canada’s democracy! At Elections Canada, you will work in a welcoming environment where you will be supported to succeed. WELLNESS Elections Canada prioritizes work-life balance. We follow the federal public service’s common hybrid work model, which allows most employees to work remotely a few days a week. Some positions require to work on site full time due to operational requirements. PROFESSIONAL DEVELOPMENT At Elections Canada, you will work in an environment that provides the training you need to fulfill your job well. Whether you have professional experience or are a recent graduate, you can have a fulfilling experience with us. CENTRAL, MODERN AND UNIQUE OFFICES Our building at 30 Victoria Street in Gatineau is in the heart of downtown, with several restaurants nearby. It has modern facilities featuring collaborative workspaces. There’s also a locker room with showers and secure indoor bike storage.",
      "duties": null,
      "important_messages": "Important messages Candidates must meet all the essential criteria in order to be appointed. All information gathered during the selection process, from the moment of application to the end of the process, may be used to assess candidates. Information received relating to accommodation measures will be addressed confidentially. We will communicate with you regarding this process by email. Therefore, you must update your profile in the Public Service Resourcing System if any changes occur. Candidates must use an email address that accepts messages from unknown senders (some email systems block such messages). If you do not respond to our emails, we will consider that you are voluntarily withdrawing from the process. During the process, you will be asked to provide us with and a proof of citizenship or permanent residency and a proof of education (diploma, certificate, degree). If you obtained your diploma outside of Canada, you must already have received your Canadian equivalency at the time of submitting your application, or have already initiated the official process to obtain a recognized equivalency in Canada. For more information, please consult the following page: https://www.canada.ca/en/public-service-commission/jobs/services/gc-jobs/degree-equivalency.html Persons are entitled to participate in the appointment process in the official language(s) of their choice. Please note that the use of Generative Artificial Intelligence to answer questions at any stage of this process is prohibited. If such use were proven, this could result in you being eliminated from this process. In addition, Elections Canada will also inform the Public Service Commission of any case in which a candidate is suspected of engaging in fraudulent or deceptive practices with regard to the process. This selection process consists of several assessment steps. At each stage, only candidates who achieve the passing score will be invited to proceed to the next step: - Test to assess attention to detail. - Validation of citizenship and education. - Assessment of essential experiences and assets. The ability to communicate effectively in writing will be assessed during this step. -Structured Interview to assess the following key competencies and ability: - Working effectively with others - Showing initiative and being action-oriented - Thinking things through - Demonstrating integrity and respect - Ability to communicate effectively orally",
      "operational_requirements": "Operational Requirements Willingness and ability to work overtime as and when needed and on short notice.",
      "conditions_of_employment": "Conditions of employment Reliability Status security clearance Learn more about personnel security screening processes. OTHER CONDITION OF EMPLOYMENT Consent to observe strict political impartiality and neutrality for the duration of employment.",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Learn more about preference to veterans.",
      "organization_information": "",
      "other_information": null,
      "intent_of_process": "Intent of the process The immediate intention of this process is to staff two (2) specified period (term) positions. A pool of qualified candidates may be established to staff similar positions with varying tenures (such as indeterminate, specified period, acting) and various linguistic profiles (English Essential, French Essential, English or French Essential, Bilingual - Imperative BBB/BBB).",
      "reference_number": "CEO25J-145895-000096",
      "selection_process_number": "25-CEO-EA-DT-30029"
    },
    "qualifications": {
      "essential": {
        "education": [
          "EDUCATION Graduation with a degree from a recognized post-secondary institution with acceptable specialization in economics, sociology or statistics. Note: Candidates must always have a degree. The courses for the specialization must be acceptable and may have been taken at a recognized post-secondary institution, but not necessarily within a degree program in the required specialization. The specialization may also be obtained through an acceptable combination of education, training and/or experience."
        ],
        "experience": [
          "EXPERIENCES 1. Experience* in the application of various data management principles and practices, in a minimum of two (2) of the following areas including, but not limited to: • Data collection, processing and validation; • Data governance, stewardship, and standards; • Access, security and interoperability; and • Data sharing. 2. Experience* writing reports, designing and delivering presentations. 3. Experience* collecting and analyzing LARGE AMOUNTS of information and data from various sources. * We consider all forms of experience, whether acquired through studies, internships, jobs, or various projects normally equivalent to performing tasks for a minimum period of approximately four (4) months."
        ],
        "knowledge": [],
        "abilities": [
          "ABILITIES 1. Ability to communicate effectively orally 2. Ability to communicate effectively in writing 3. Attention to detail"
        ],
        "competencies": [
          "KEY COMPETENCIES 1. Working effectively with others 2. Showing initiative and being action-oriented 3. Thinking things through 4. Demonstrating integrity and respect"
        ],
        "personal_suitability": []
      },
      "asset": {
        "education": [],
        "experience": [
          "ASSET EXPERIENCES 1. Experience* developing data visualization tools (using Power BI, Denodo, Tableau, RShiny, D3 or other) 2. Experience* in application of principles and techniques of research including: - Hypothesis formulation and validation; - Data source identification or data collection design; and - Model design and interpretation; 3. Experience* in application of data science, machine learning or artificial intelligence methods, tools and processes 4. Experience* using a statistical software or database query language (ex: SAS, SPSS, STATA, Python, R or SQL/MS Access). * We consider all forms of experience, whether acquired through studies, internships, jobs, or various projects normally equivalent to performing tasks for a minimum period of approximately four (4) months."
        ],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "Hiring organization contact Name: Monique Bernier, Human Resources Advisor Email address: Monique.Bernier@elections.ca Name: Staffing Team Email address: Dotation-Staffing@elections.ca"
        }
      ]
    }
  }
}