{
  "poster_id": "2371200",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2371200",
  "title": "Manager, Program Delivery (Northwest Region)",
  "department": "Federal Economic Development Agency for Northern Ontario",
  "branch": null,
  "city": "Thunder Bay",
  "province": "Ontario",
  "location_raw": "Thunder Bay (Ontario)",
  "classification_group": "CO",
  "classification_level": "03",
  "classification_raw": "CO-03",
  "closing_date": "2025-11-16T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 111682.0,
  "salary_max": 141340.0,
  "salary_raw": "$111,682 to $141,340",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad. **Applicants are encouraged to apply if they are willing and able to work in, or relocate to or within 40 km of Thunder Bay, Ontario .",
  "employment_types": null,
  "positions_to_fill": 1,
  "language_requirements_raw": "Applied / assessed at a later date",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "Manager",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:53:49.080764+00:00",
  "structure_type": "structure_1",
  "details": {
    "sections": {
      "work_environment": "Work environment Federal Economic Development Agency for Northern Ontario (FedNor) is the Government of Canada's economic development organization for Northern Ontario, supporting job creation and economic growth through programs, services and project funding. By partnering with businesses and communities, it fosters a strong, diversified and competitive regional economy. A position with FedNor allows you to be part of a nimble department that has a broad mandate to work on a variety of economic development activities. Why Choose FedNor: • Work with a great team who supports each other. • Be part of a small department with a big heart. • Meaningful work that makes a difference to the region and country. • Flexible work arrangements (hybrid environment – mix of working in-person at the office and at home).",
      "duties": null,
      "important_messages": "",
      "operational_requirements": "Operational Requirements Operational Requirements: • Availability to travel • Availability to work outside regular office hours",
      "conditions_of_employment": "Conditions of employment Secret security clearance Learn more about personnel security screening processes. Must have a valid driver’s license",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Learn more about preference to veterans.",
      "organization_information": "",
      "other_information": null,
      "intent_of_process": "Intent of the process The intent of this process is to immediately fill one (1) position in the Thunder Bay area with a bilingual imperative BBB/BBB second language profile.",
      "reference_number": "NOR25J-170807-000050",
      "selection_process_number": "2025-NOR-EA-036"
    },
    "qualifications": {
      "essential": {
        "education": [
          "Education: • Graduation with a degree from a recognized post-secondary institution with acceptable specialization in a field relevant to the duties of the position or acceptable combination of education, training, and experience."
        ],
        "experience": [],
        "knowledge": [],
        "abilities": [
          "Abilities and Competencies: • Create vision and strategy • Mobilize people • Uphold integrity and respect • Collaborate with partners and stakeholders • Promote innovation and guide change • Achieve results • Effective written and oral communication ** **Written communication skills may be assessed throughout the application. **The use of artificial intelligence (AI) tools is prohibited and may result in disqualification. **Applicants are encouraged to provide as much relevant information as possible in their application to allow for a thorough assessment of their writing ability."
        ],
        "competencies": [],
        "personal_suitability": []
      },
      "asset": {
        "education": [],
        "experience": [],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "Hiring organization contact Name: FedNor HR Support Email address: fednorhrsupport-soutienrhfednor@FedNor.gc.ca"
        }
      ]
    }
  }
}