{
  "poster_id": "2371530",
  "url": "https://psjobs-emploisfp.psc-cfp.gc.ca/psrs-srfp/applicant/page1800?poster=2371530",
  "title": "Policy Advisor",
  "department": "Indian Oil and Gas Canada (IOGC)",
  "branch": null,
  "city": "Tsuut'ina",
  "province": "AB",
  "location_raw": "Tsuut'ina, AB",
  "classification_group": "AB",
  "classification_level": "09",
  "classification_raw": "AB-09",
  "closing_date": "2025-11-14T23:59:00",
  "closing_time_raw": "23:59",
  "date_modified": null,
  "salary_min": 101931.0,
  "salary_max": 127505.0,
  "salary_raw": "$101,931 to $127,505",
  "who_can_apply": "Persons residing in Canada, and Canadian citizens and Permanent residents abroad.",
  "employment_types": null,
  "positions_to_fill": 2,
  "language_requirements_raw": "Applied / assessed at a later date",
  "is_external_link": false,
  "external_redirect_url": null,
  "external_job_title": null,
  "search_title": "Policy Advisor",
  "search_type": "production",
  "scraped_at": "2025-11-09T03:54:29.308897+00:00",
  "structure_type": "structure_1",
  "details": {
    "sections": {
      "work_environment": "Work environment IOGC manages and regulates oil and gas resources on designated First Nation lands across Canada. We are a non-unionized special operating agency within Indigenous Services Canada. Our dual mandate is to fulfill the Crown's fiduciary and statutory obligations related to the management of oil and gas resources on First Nation lands and to further First Nation initiatives to manage and control their oil and resources such as governance.",
      "duties": null,
      "important_messages": "Important messages We are committed to providing an inclusive and barrier-free work environment, starting with the hiring process. If you need to be accommodated during any phase of the evaluation process, please use the Contact information below to request specialized accommodation. All information received in relation to accommodation will be kept confidential. BENEFITS OF WORKING AT IOGC: 1. Performance pay 2. Family Day stat 3. Free parking 4. Work-life balance 5. Banked Time program 6. A small agency with many exciting opportunities 7. Located on the Tsuut'ina First Nation with views of downtown Calgary and the Rocky Mountain. Candidates must apply online in order to answer the screening questions. When answering these questions, you must provide concrete and detailed examples to clearly demonstrate how you meet the education and experience requirements listed in the essential qualifications and asset qualifications section. Please specify when, where and how you gained this experience using specific examples, including dates and the role you played at that time. The screening board cannot make any assumptions about your experience. It is not sufficient to say that you have the required qualifications or to list your current duties. Failure to provide the above information may result in your application being rejected from the process. A written exam will be administered. Interviews will be conducted. Reference checks will be conducted. Candidates must meet all of the essential qualifications to be appointed to a position. A candidate may be appointed to a position even though he/she does not meet any or all of the asset qualifications or an organizational need. However, meeting these criteria is desirable and may be a deciding factor in choosing the person to be appointed. Candidates are entitled to participate in the appointment process in the official language of their choice. Our intention is to communicate with candidates via email. Candidates who apply on this selection process must include in their application a valid e-mail address and to make sure that this address is functional at all times and accepts messages from unknown users. It is the candidate's responsibility to provide any changes to their personal information to the contact indicated on this job advertisement.",
      "operational_requirements": "Operational Requirements - Willingness and ability to travel when required. - Possession of a valid driver's license.",
      "conditions_of_employment": "Conditions of employment Reliability Status security clearance Learn more about personnel security screening processes.",
      "how_to_apply": "",
      "equity_diversity_inclusion": "",
      "our_commitment": "",
      "preference": "Preference Preference will be given to veterans first and then to Canadian citizens and permanent residents, with the exception of a job located in Nunavut, where Nunavut Inuit will be appointed first. Learn more about preference to veterans.",
      "organization_information": "",
      "other_information": null,
      "intent_of_process": "Intent of the process The immediate need is to staff: one (1) indeterminate English essential position and one (1) term English essential positions. A pool of partially or fully qualified candidates may be established from this selection process and may be used to staff similar positions with various tenures and various security clearances within Indian Oil and Gas Canada.",
      "reference_number": "DIS25J-181922-000012",
      "selection_process_number": "25-IOG-EA-SI-44"
    },
    "qualifications": {
      "essential": {
        "education": [
          "EDUCATION Graduation with a degree from a recognized post-secondary institution with a specialization in economics, sociology, or statistics. Candidates must always have a degree. The courses for the specialization must be acceptable and may have been taken at a recognized post-secondary institution, but not necessarily within a degree program in the required specialization. The specialization may also be obtained through an acceptable combination of education, training and/or experience. An indeterminate incumbent of a former ES position on June 30, 1967 who became an EC on June 22, 2009, who does not possess the minimum level of education as indicated for Part A above is deemed to meet this minimum educational standard based on his/her education, training and/or experience."
        ],
        "experience": [],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      },
      "asset": {
        "education": [],
        "experience": [],
        "knowledge": [],
        "abilities": [],
        "competencies": [],
        "personal_suitability": []
      }
    },
    "contact": {
      "contacts": [
        {
          "name": "",
          "role": "",
          "email": "",
          "phone": "",
          "notes": "Hiring organization contact Name: Sarah Mwemera Email address: hriogc@sac-isc.gc.ca"
        }
      ]
    }
  }
}