{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Senior-Budget-Analyst/596917117/"
    },
    "header": {
      "job_title": "Senior Budget Analyst",
      "posting_date": "Oct 28, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Senior Budget Analyst",
      "job_requisition_id": "76562",
      "ministry": "Primary and Preventative Health Services",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 12, 2025",
      "classification": "Budget Officer 3",
      "salary": {
        "raw_text": "​$3,697.91 to $4,872.00 bi-weekly ($96,515 - $127,180/year)",
        "biweekly_min": 3697.91,
        "biweekly_max": 4872.0,
        "annual_min": 96515.0,
        "annual_max": 127180.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Public Service",
      "body": [
        "The Alberta Public Service (APS) is taking a One Finance approach to the delivery of financial services. Financial services include the delivery of financial planning, reporting and operations, as well as ongoing engagement with policy and program areas to provide strategic decision-making support. There are three top leadership priorities that support this One Finance approach: proactively supporting our talent across the finance community; providing collaborative and responsive services to our business partners; and actively engaging in continuous improvement of the way we support each other and do business within our teams and across the entire finance community. To learn more about the Government of Alberta finance community and how you can make a positive difference in the lives of Albertans, we encourage you to visit our Finance Career Hub for more information."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": null,
      "intro_paragraphs": [
        "The Senior Budget Analyst provides support and guidance to the Assistant Deputy Minister (ADM) and Executive Directors in the department of PPHS, providing financial expertise in the management and administration of department finances. The position is responsible for coordinating with professional and technical staff to ensure the integrity of financial information. To be effective in the role, the incumbent must consult directly with forecast preparers, reviewers and expenditure officers, in addition to providing strategic advice regarding budgeting, forecasting, reporting, grants, and internal controls.",
        "This position requires an in-depth understanding of accounting and finance functions including economic/forecast modeling, a comprehensive knowledge of programs and operations offered by the Ministry. The incumbent must demonstrate sound analytical skills, the ability to multi-task and provide leadership and guidance to one divisional budget analyst (Budget Officer 2 classification) in an environment where the objectives are not always clear with tight timelines.",
        "This position plans and coordinates processes to ensure staff are provided with instructions, guidance and support required for budgeting and forecasting. The incumbent also reviews, analyzes, compiles and consolidates budget/forecast information prior to submission to the Corporate Financial Planning area (FP) for exercises such as funding requirements, salary and benefit reconciliations and business planning requirements. The incumbent will identify best practices regarding grant processes and reporting. The incumbent must demonstrate sound analytical abilities, the ability to multi-task and the ability to balance the needs of divisions with those of FP.",
        "Providing strategic advice, and responding to divisional inquiries on budgeting, forecasting, and information requests from the Minister, Executive Team and Treasury Board and Finance is also a function of this position."
      ],
      "responsibility_groups": [],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. Agility – You are able to anticipate, assess, and readily adapt to changing priorities, maintain resilience in times of uncertainty and effectively work in a changing environment.Creative Problem Solving – You are able to assess options and implications in new ways to achieve outcomes and solutions.Systems Thinking – Ability to consider the whole system and recognize links between everything from the complex network of global to departmental priorities. Set goals within the context of long-term outcomes and broad perspectives.Develop Self and Others – Desire to invest in the development of the long-term capability of self and others.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [
          "Experience in preparing and overseeing complex budget and forecast submissions within a large organization.",
          "Experience preparing briefing materials that translate financial data into meaningful information for decision makers.",
          "Experience working with relevant financial information systems, reporting tools, and software (e.g., Excel, Power BI, Enterprise Resource Planning (ERP) / System Analysis Program (SAP) and ability to manipulate data sets.",
          "Experience in data management software or language (Business Intelligence Tools, SQL, VBA, Python, Tableau, Power BI)"
        ],
        "other": [
          "Knowledge of financial administration, monitoring, forecasting, costing and budgeting concepts.",
          "Advanced skills in Microsoft Office, including Word, Outlook, Excel and PowerPoint."
        ]
      },
      "equivalency": {
        "text": "An equivalent combination of education and experience which includes as a minimum, completion of a recognized applied accounting degree or diploma program.",
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Canadian professional accounting designation (CPA or legacy designation) or equivalent.",
          "Experience working in financial planning area within public sector (Federal, Provincial, Municipal) in the last five years",
          "Knowledge of government financial legislations, regulations and policies.",
          "Experience using Fiscal Amounts Tracking Sheet (FATS) and 1GX",
          "A cover letter",
          "must",
          "accompany your application and should indicate how your previous work experience aligns to the qualifications and competencies required. Please provide clear examples of how you meet the criteria and skills required in your cover letter. Failure to provide a cover letter will lead to the application being screened out. Cover letter will be one of the ways to assess communication skills of candidates.",
          "In your resume, please include dates (including months and years) associated with all education and work experience. As well, please indicate whether your work experience is casual, part-time or full-time. For example, January 15, 2006 - June 25, 2009: Assistant (PT three 8 hrs. shifts/week).",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [
        "Candidates will be required to undertake a written assessment. An interview may follow, contingent upon the outcome of the assessment."
      ],
      "security_screening": [
        "Final candidates will be required to undergo a security screening."
      ],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "PSC.FTA@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "596917117",
    "scraped_at": "2025-11-09T19:16:31.597958",
    "matched_keyword": "Business Analyst",
    "match_score": 90
  }
}