{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Intelligence-Collator-&-Analyst/597084417/"
    },
    "header": {
      "job_title": "Intelligence Collator & Analyst",
      "posting_date": "Nov 3, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Intelligence Collator & Analyst",
      "job_requisition_id": "76683",
      "ministry": "Public Safety and Emergency Services",
      "location": "Edmonton or Calgary",
      "full_or_part_time": "Full-Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 10, 2025",
      "classification": "Program Services 1",
      "salary": {
        "raw_text": "$2,297.14 to $2,989.82 bi-weekly ($59,955 to $78,034 per year)",
        "biweekly_min": 2297.14,
        "biweekly_max": 2989.82,
        "annual_min": null,
        "annual_max": null,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Intelligence Collator & AnalystJob Requisition ID: 76683Ministry: Public Safety and Emergency ServicesLocation: Edmonton or CalgaryFull or Part-Time: Full-Time Hours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open Competition Closing Date: November 10, 2025Classification: Program Services 1Salary: $2,297.14 to $2,989.82 bi-weekly ($59,955 to $78,034 per year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.he Provincial Security and Intelligence Office (PSIO) provides timely intelligence and security advice pertaining to areas of public safety and national security that fall within provincial responsibility. PSIO activities support cross-government efforts to protect Albertans, provincial infrastructure, government operations, and Alberta’s strategic interests from a range of human-induced intentional threats. The Provincial Intelligence Bureau, a core subunit of the PSIO, facilitates the dissemination, integration, and utilization of information, intelligence, and advice in respect of matters relevant to the security and interests of Alberta. The Bureau provides a conduit for the flow of information between Alberta government ministries, law enforcement, and security partners.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": null,
      "body": [
        "diversity-inclusion-policy.aspx.he Provincial Security and Intelligence Office (PSIO) provides timely intelligence and security advice pertaining to areas of public safety and national security that fall within provincial responsibility. PSIO activities support cross-government efforts to protect Albertans, provincial infrastructure, government operations, and Alberta’s strategic interests from a range of human-induced intentional threats. The Provincial Intelligence Bureau, a core subunit of the PSIO, facilitates the dissemination, integration, and utilization of information, intelligence, and advice in respect of matters relevant to the security and interests of Alberta. The Bureau provides a conduit for the flow of information between Alberta government ministries, law enforcement, and security partners."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Knowledge and abilities required are:",
      "intro_paragraphs": [
        "Are you passionate about turning data into actionable insights that protect communities and support emergency response? The Ministry of Public Safety and Emergency Services is seeking a sharp, detail-oriented Intelligence Collator & Analyst to help drive informed decision-making in critical situations. In this dynamic role, you’ll work with multidisciplinary teams to gather, analyze, and synthesize intelligence that supports public safety operations across Alberta. If you thrive in high-stakes environments and have a keen eye for patterns, this is your opportunity to make a meaningful impact.",
        "In this position, you directly support the Collection Coordination and Information Requirements Management (CCIRM) system. The Intelligence Collator provides integrated information management services to assist unit personnel in the collection, correlation, evaluation, and dissemination of information, intelligence, and risk assessments relevant to the strategic interests of the Government of Alberta and the protection of officials, employees, assets and critical infrastructure from human induced intentional threats. The position collaborates with working-level counterparts in other PSES and Justice units, law enforcement, security, and other government partners to understand government and stakeholder information requirements, collate relevant reporting, process requests for information (RFIs), and develop conduits for the sharing of information and analysis.",
        "Duties and responsibilities include but, are not limited to:• Maintain a collation system - including electronic databases, filing systems, reference material management, and the tracking of requests for information (RFIs) - that enables the effective organization and retrieval of data/information. • Monitor incoming information and ensure relevant reporting is disseminated in accordance with program responsibilities and interests. • Support the unit’s Collection Coordination and Information Requirements Management (CCIRM) system.• Develop understanding of provincial assets, services, networks, and facilities critical to Alberta's economy, public safety, and security.• Provide information management, coordination, and administrative supports for the Wild Rose Shield (WRS) Program.• Conduct intelligence analysis on issues relevant to the security and interests of Alberta.• Facilitate efforts to enhance security-related knowledge, training, education, and analysis capabilities throughout Alberta.",
        "• Advanced analytical skills - demonstrated ability to systematically gather, analyze, and interpret information to solve problems, identify patterns, and make well-informed decisions. • Ability to work in a high intensity environment, self-manage priorities to meet competing deadlines, demonstrate the ability to structure time, take responsibility for and manage duties to successfully achieve required reporting time frames.• Technical acumen in relation to emerging technologies and scientific innovation.Please click on this link to view the job description for this position."
      ],
      "responsibility_groups": [],
      "job_description_link_text": "Please click on this link to view the job description for this position",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/bbbaspu3/jr76683_intelligence_collator_analyst_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.The successful candidate will possess the following Alberta Public Service competencies: SYSTEMS THINKING: You consistently take a holistic and long-term view of challenges and opportunities at multiple levels across related areas.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "SYSTEMS THINKING: You consistently take a holistic and long-term view of challenges and opportunities at multiple levels across related areas.",
        "BUILD COLLABORATIVE ENVIRONMENTS: You lead and contribute to the conditions and environments that allow people to work collaboratively and productively to achieve outcomes.",
        "CREATIVE PROBLEM SOLVING: You are able to assess options, and implications in new ways to achieve outcomes and solution.",
        "DEVELOP SELF AND OTHERS: You have a commitment to ongoing learning and desire to invest in the development of the long-term capability of not only yourself but others as well.",
        "AGILITY: You can anticipate, assess, and readily adapt to changing priorities, maintain resilience in times of uncertainty and effectively work in a changing environment.",
        "DEVELOP NETWORKS: You proactively build networks, connecting and building trust in relationships with different stakeholders."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "•    Two-year diploma in a related field; including, but not limited to: Public Administration, Public Policy, Social Sciences, Criminology, Security Management, etc.",
          "•    Cover letter will be required demonstrating how your education and experience meet the qualifications listed.",
          "•    A Graduate Degree from a recognized post-secondary institution in a discipline related to the position.",
          "•    Education or training in intelligence analysis."
        ],
        "experience": [
          "•    Experience in a role related to the position.",
          "•    Experience working with databases and records management systems.",
          "•    Experience researching complex public policy issues.",
          "•    Experience developing and sustaining rapport-based networks.",
          "•    Experience applying security risk assessment methodologies and frameworks.",
          "•    Experience in a law enforcement role."
        ],
        "other": [
          "Assets & Preference:",
          "•    Preference will be given to Canadian citizens due to security clearance requirements."
        ]
      },
      "equivalency": {
        "text": "•    One year of experience for one year of education OR •    One year of education for one year of experience. •    Related fields of study may include political science, psychology, international relations, intelligence studies, strategic studies, criminal justice, law enforcement studies, Science, Technology, Engineering or Mathematics (STEM), or other similar fields. •    Related experience may include experience in an intelligence or related role, such as: security intelligence, criminal intelligence, military intelligence, national security, special operations, economic or research security, security and defence research, security risk management, or other similar roles. https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards .",
        "rules": [
          "•    One year of experience for one year of education OR",
          "•    One year of education for one year of experience."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": []
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This is a full-time permanent position located in Edmonton or Calgary.Hours of Work: 36.25 hours per week, Monday to Friday. Applicants must include a cover letter with their application. Your cover letter must clearly demonstrate how your education and experience meet the qualifications listed. Your cover letter may be used as an assessment tool for written communication skills.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "• Final candidates will be required to undergo a security screening.• The successful candidate will also be required to be eligible to obtain a Government of Canada Security Clearance. Candidates must be willing to undergo a detailed background check that may include law enforcement enquiries, fingerprinting, intelligence indices check, a credit check, and a subject interview; wherein questions may include (but not limited to), reference checks, previous employment, on-line activities, financial activities, alcohol and/or drug use, and out-of-county verification.• Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. • Out-of-province applicants can obtain the required documents/checks from the province they currently reside in.• Successful candidate is required to obtain high level Government of Canada Security ClearenceClearance.Conditions of Employment• Eligible for appointment as an Alberta Peace Officer under the Peace Officer Act. • Possess a valid Class 5 Driver's License with a good driving record.• Ability to travel up to 25% of the time.• Successfully obtaining and maintaining necessary security clearances will be a condition of ongoing employment. • To begin or continue working for the Government of Alberta, you must be a Canadian citizen, permanent resident or have a valid work permit issued by the Government of Canada. Note that Canadian citizens will be considered before permanent residents for jobs requiring a higher levelhigher-level security clearance. A longer and more thorough background check is common for permanent residents, especially regarding their history of living or traveling outside of Canada. To minimize the risk of recruitment disruption from the screening process, the hiring manager will need to demonstrate that no suitable Canadian citizen is available before selecting an alternate candidate."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Krista.Lammie@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Krista Lammie at"
    }
  },
  "scraping_metadata": {
    "job_id": "597084417",
    "scraped_at": "2025-11-09T19:17:09.949872",
    "matched_keyword": "Business Analyst",
    "match_score": 81
  }
}