{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Financial-Reporting-Analyst/596888517/"
    },
    "header": {
      "job_title": "Financial Reporting Analyst",
      "posting_date": "Oct 27, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Financial Reporting Analyst",
      "job_requisition_id": "76519",
      "ministry": "Jobs, Economy, Trade and Immigration",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 10, 2025",
      "classification": "Finance 3",
      "salary": {
        "raw_text": "$2,849.89 to $3,738.14 bi-weekly ($74,382 - $97,565/year)",
        "biweekly_min": 2849.89,
        "biweekly_max": 3738.14,
        "annual_min": 74382.0,
        "annual_max": 97565.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Public Service",
      "body": [
        "The Alberta Public Service (APS) is taking a One Finance approach to the delivery of financial services. Financial services include the delivery of financial planning, reporting and operations, as well as ongoing engagement with policy and program areas to provide strategic decision-making support. There are three top leadership priorities that support this One Finance approach: proactively supporting our talent across the finance community; providing collaborative and responsive services to our business partners; and actively engaging in continuous improvement of the way we support each other and do business within our teams and across the entire finance community. To learn more about the Government of Alberta finance community and how you can make a positive difference in the lives of Albertans, we encourage you to visit our Finance Career Hub for more information."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "This position will also examine, analyze and interpret complex financial data, and provide sound advice to senior management.",
      "intro_paragraphs": [
        "Reporting to the Manager, Financial Reporting, the Financial Reporting Analyst is responsible for coordinating the Ministry's financial reporting functions. This position is responsible for the preparation of the Ministry financial statements. This position also makes a contribution to the Financial Reporting team by engaging in the planning and instruction of monthly, quarterly, and year-end requirements to all ministry staff, preparation and review of related working papers, and working with the Office of the Auditor General for the year-end audit. The Financial Reporting Analyst works closely with Service Alberta and Red Tape Reduction and Treasury Board and Finance to resolve ministry financial reporting issues as they arise. Other responsibilities include identifying, recommending and implementing required modifications to ministry financial controls, policies, procedures and guidelines to ensure that financial reporting is in compliance with Canadian Public Sector Accounting Standards, the production of financial statements is timely, and that a high degree of financial control and accountability is established. In addition, this position contributes to all Government of Alberta (GoA) financial reporting initiatives and directives, as well as addresses and resolves observations made by the Office of the Auditor General (OAG) with respect to financial reporting and ensures recommendations are implemented.This position is responsible for capital asset administration, including the establishment, maintenance and conclusion of the assets, and the generation of monthly, quarterly and year-end continuity schedule."
      ],
      "responsibility_groups": [],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. Systems Thinking – You are able to consider the whole system and recognize links between everything from the complex network of global to departmental priorities. Set goals within the context of long-term outcomes and broad perspectives.Build Collaborative Environments – You are able to lead and contribute to the conditions and environments that allow people to work collaboratively and productively to achieve outcomes.Creative Problem Solving – You are able to assess options and implications in new ways to achieve outcomes and solutions.Drive for Results – You are able to determine what outcomes are important and maximize the use of resources to achieve results that are aligned with the goals of the organization, while maintaining accountability to each other and all stakeholders. Agility – You are able to anticipate, assess, and readily adapt to changing priorities, maintain resilience in times of uncertainty and effectively work in a changing environment.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [
          "Experience working with relevant financial information systems, reporting tools and software (e.g., Excel, Enterprise Resource Planning (ERP) / System Analysis Program (SAP) and ability to manipulate data sets.",
          "Experience preparing, reviewing and presenting financial statements.",
          "Experience preparing briefing materials that translate financial data into meaningful information for decision makers.",
          "Solid understanding and experience with the application and research of accounting policies, practices and theories such as Generally Accepted Accounting Principles (GAAP)."
        ],
        "other": [
          "Advanced skills in Microsoft Office, including Word, Outlook, Excel and PowerPoint."
        ]
      },
      "equivalency": {
        "text": "Related diploma plus 5 years directly related experience. Accounting designation and 1-year additional related experience.",
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Canadian professional accounting designation (CPA or legacy designation) or equivalent",
          "Knowledge of the Government of Alberta's applicable legislation (e.g., Financial Administration Act, Fiscal Planning and Transparency Act, Government Organizational Act and Alberta Public Agencies Act)",
          "Knowledge of Public Sector Accounting Standards (PSAS) and the ability to interpret PSAS for the monitoring, recording, reporting and interpretation of financial information.",
          "A cover letter",
          "must",
          "accompany your application and should indicate how your previous work experience aligns to the qualifications and competencies required. Please provide clear examples of how you meet the criteria and skills required in your cover letter. Failure to provide a cover letter will lead to the application being screened out. Cover letter will be one of the ways to assess communication skills of candidates.",
          "In your resume, please include dates (including months and years) associated with all education and work experience. As well, please indicate whether your work experience is casual, part-time or full-time. For example, January 15, 2006 - June 25, 2009: Assistant (PT three 8 hrs. shifts/week).",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "Final candidates will be required to undergo a security screening."
      ],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "PSC.FTA@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "596888517",
    "scraped_at": "2025-11-09T19:16:44.475516",
    "matched_keyword": "Business Analyst",
    "match_score": 82
  }
}