{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Records-Management-Supervisor/597208217/"
    },
    "header": {
      "job_title": "Records Management Supervisor",
      "posting_date": "Nov 6, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Records Management Supervisor",
      "job_requisition_id": "75028",
      "ministry": "Assisted Living and Social Services",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 13, 2025",
      "classification": "Administrative Support 5",
      "salary": {
        "raw_text": "$2,128.30 to $2,692.98 bi-weekly ($55,548 - $70,286/year)",
        "biweekly_min": 2128.3,
        "biweekly_max": 2692.98,
        "annual_min": 55548.0,
        "annual_max": 70286.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Records Management Supervisor Job Requisition ID: 75028Ministry: Assisted Living and Social ServicesLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 13, 2025Classification: Administrative Support 5Salary: $2,128.30 to $2,692.98 bi-weekly ($55,548 - $70,286/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.Assisted Living and Social Services (ALSS) provides supports for seniors, families, and communities, and helps Albertans access disability services, continuing care, financial supports, affordable housing, services for the homeless, and other social-based programs. The Ministry supports Albertans through a person-centered, integrated service delivery model that recognizes the unique circumstances, experiences and strengths of individuals and families. For more information on the ALSS Ministry, please visit: https://www.alberta.ca/assisted-living-and-social-services",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": null,
      "body": [
        "diversity-inclusion-policy.aspx.Assisted Living and Social Services (ALSS) provides supports for seniors, families, and communities, and helps Albertans access disability services, continuing care, financial supports, affordable housing, services for the homeless, and other social-based programs. The Ministry supports Albertans through a person-centered, integrated service delivery model that recognizes the unique circumstances, experiences and strengths of individuals and families. For more information on the ALSS Ministry, please visit: https://www.alberta.ca/assisted-living-and-social-services The Office of the Public Guardian and Trustee (OPGT) provides essential support for individuals that are not able to make personal or financial decisions. It offers guardianship and trusteeship services, administers estates, and manages benefits. OPGT also oversees capacity assessments, investigates complaints regarding decision-makers, and provides guidance on advance planning and personal directives. For more information on OPGT, please visit: https://www.alberta.ca/opgt-supports"
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Key Responsibilities:",
      "intro_paragraphs": [
        "The Office of the Public Guardian and Trustee (OPGT) is dedicated to providing high-quality services to Albertans. We are looking for a dynamic Records Management Supervisor to lead the records management operations."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Supervise records management administrative staff. Monitor workloads and standards to ensure effective workflow and use of manpower. Provide training and development opportunities. Establish unit goals and objectives to meet branch requirements.",
            "Monitor workloads and standards to ensure effective workflow and use of manpower.",
            "Provide training and development opportunities.",
            "Establish unit goals and objectives to meet branch requirements.",
            "Supervise the operation of the records management unit and assume responsibility for the effective and efficient performance of the unit. Establish and update policy and procedure manual. Develop and implement suggestions for continuous improvement and make recommendations. Responsible for information retrieval from PTIS and OPGIS. Coordinate the flow of documentation to create or conclude case management.",
            "Ensure correct file classifications, file records, and retrieve records.",
            "Establish and update policy and procedure manual.",
            "Develop and implement suggestions for continuous improvement and make recommendations.",
            "Responsible for information retrieval from PTIS and OPGIS.",
            "Coordinate the flow of documentation to create or conclude case management.",
            "Perform file maintenance and set-up to ensure that OPGT files are accessible. Verify file classification and consult with branch or records analyst on any issues. Sort documents, prepare documents for filing, and file documents. Identify and locate records and arrange their delivery. Identify misfiled documents on existing files and cross-reference documents where required.",
            "Verify file classification and consult with branch or records analyst on any issues.",
            "Sort documents, prepare documents for filing, and file documents.",
            "Identify and locate records and arrange their delivery.",
            "Identify misfiled documents on existing files and cross-reference documents where required.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": []
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "High school diploma and three years of related experience."
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": ": Directly related experience or education considered on the basis of one year or experience for one year of education or one year of education for one year of experience.",
        "rules": [
          ": Directly related experience or education considered on the basis of one year or experience for one year of education or one year of education for one year of experience."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Demonstrated supervisory experience",
          "Extensive knowledge of office policies relevant to the administrative support staff.",
          "Strong time management and organizational skills",
          "Demonstrated ability to adapt to change, with a willingness to learn and flexibility to perform various roles as needed.",
          "Demonstrated experience working in a team environment.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "In your resume, please include dates (including months and years) associated with all education and work experience. Also, please indicate whether your work experience is casual, part time or full time.Final candidates will be required to undergo a security screening."
      ],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Baiju.Jacob@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597208217",
    "scraped_at": "2025-11-09T19:17:26.072279",
    "matched_keyword": "Business Analyst",
    "match_score": 86
  }
}