{
  "job_posting": {
    "search_keyword": "Business Consultant",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton%2C-Red-Deer%2C-Lethbridge-Project-Manager/597087617/"
    },
    "header": {
      "job_title": "Project Manager",
      "posting_date": "Nov 3, 2025",
      "location_line": "Edmonton, Red Deer, Lethbridge, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Project Manager",
      "job_requisition_id": "75904",
      "ministry": "Forestry and Parks",
      "location": "Edmonton, Red Deer, Lethbridge or Cochrane preferred. Other locations may be considered.",
      "full_or_part_time": "Full Time",
      "hours_of_work": "40 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 24, 2025",
      "classification": "Technologies 6",
      "salary": {
        "raw_text": "$3,153.91 to $4,141.41 bi-weekly ($82,317 - $108,090/year)",
        "biweekly_min": 3153.91,
        "biweekly_max": 4141.41,
        "annual_min": 82317.0,
        "annual_max": 108090.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Project Manager Job Requisition ID: 75904Ministry: Forestry and ParksLocation: Edmonton, Red Deer, Lethbridge or Cochrane preferred. Other locations may be considered.Full or Part-Time: Full TimeHours of Work: 40 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 24, 2025Classification: Technologies 6 Salary: $3,153.91 to $4,141.41 bi-weekly ($82,317 - $108,090/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Parks",
      "body": [
        "Alberta’s Parks and Public Lands are essential to the quality of life that Albertans enjoy. Alberta's parks inspire people to discover, value, protect and enjoy the natural world and the benefits it provides for current and future generations. Parks Division is responsible for infrastructure management and development for both Alberta Parks and Public Lands to ensure outdoor, nature-based recreation opportunities for all Albertans that are safe, sustainable, accessible and enjoyable while balancing conservation values. For more information about the Ministry of Forestry and Parks, please visit our website at: https://www.alberta.ca/forestry-and-parks."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": null,
      "intro_paragraphs": [
        "Forestry and Parks is seeking a results-driven construction Project Manager (PM) to lead the coordination and delivery of complex capital infrastructure projects within the Ministry of Forestry and Parks. This role is responsible for managing project scope, timelines, budgets and risk mitigation strategies while ensuring compliance with ministry policies and regulatory standards.",
        "The PM is responsible for the successful delivery of multi-year projects on Crown land (in parks and on public land) to ensure facilities and infrastructure is safe, reliable and appropriate for visitors. PMs are accountable for delivering a portfolio of projects which vary in complexity based on level of technical requirements, stakeholder engagement, regulatory approvals, public interest, environmental considerations, etc. Projects range in value from approximately $50K to $5M and encompass disciplines such as: civil, water, wastewater, structural, architectural, landscape architecture, mechanical, electrical, etc.",
        "As a key liaison between internal teams, consultants, contractors, and stakeholders, the Project Manager will oversee all project phases—from initiation to construction and close-out. Responsibilities include preparing project documentation, supporting procurement and contract administration, conducting site inspections and facilitating issue resolution. The successful candidate will apply sound construction project management methodologies to support sustainable infrastructure, optimize resources and deliver outcomes aligned with ministry and public priorities."
      ],
      "responsibility_groups": [],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": []
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": ": Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education. This role may require occasional travel and participation in meetings across multiple locations. A valid Class 5 driver's license is required . The ideal candidate will demonstrate : Extensive experience managing all phases of large-scale capital infrastructure or vertical construction projects, including scope development, design coordination, scheduling, budgeting, procurement, construction, and close out. Demonstrated ability to apply project management methodologies to deliver projects on time and within budget, while ensuring compliance with applicable building codes, safety regulations, and government policies. Proven experience preparing and managing project documentation, tender packages, and contract administration in accordance with public sector standards. Strong working ability to interpret and review technical design drawings, construction specifications, and engineering reports. Effective communication and interpersonal skills to coordinate with consultants, contractors, municipalities, Indigenous communities, and internal stakeholders across various disciplines. Proficient use of project management and office productivity software, including Microsoft Project, Excel, Word, and Outlook. Strong analytical and problem-solving skills with the ability to make informed decisions and resolve complex project-related issues in dynamic environments.",
        "rules": [
          ": Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": []
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This is a permanent, full-time role with 40 hours per week, Monday to Friday.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies across the Government of Alberta at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Michele.Murphy@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Michele Murphy at"
    }
  },
  "scraping_metadata": {
    "job_id": "597087617",
    "scraped_at": "2025-11-09T19:20:24.672064",
    "matched_keyword": "Business Consultant",
    "match_score": 100
  }
}