{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Calgary-Project-Manager/593488917/"
    },
    "header": {
      "job_title": "Project Manager",
      "posting_date": "Oct 29, 2025",
      "location_line": "Calgary, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Project Manager",
      "job_requisition_id": "72271",
      "ministry": "Infrastructure",
      "location": "Calgary",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 12, 2025",
      "classification": "Manager Zone 2",
      "salary": {
        "raw_text": "​$3,339.00 - $4,493.32 bi-weekly ($87,147 - $117,275/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": 87147.0,
        "annual_max": 117275.0,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Project Manager Job Requisition ID: 72271Ministry: InfrastructureLocation: CalgaryFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 12, 2025Classification: Manager Zone 2Salary: ​$3,339.00 - $4,493.32 bi-weekly ($87,147 - $117,275/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.Alberta Infrastructure is responsible for leading the development of the provincial Capital Plan, which addresses the provincial infrastructure needs of Alberta’s population that support key social programs and services and economic development. The Ministry designs, builds, manages, and maintains government-owned and operated facilities, and collaborates with other ministries to ensure that school and hospital infrastructure meet the needs of Alberta’s population. Infrastructure provides accommodation services and manages a large portfolio of owned and leased facilities while maintaining fiscal accountability and optimizing value for Albertans. For more information about Alberta Infrastructure, please visit: http://www.infrastructure.alberta.ca.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Infrastructure",
      "body": [
        "diversity-inclusion-policy.aspx.Alberta Infrastructure is responsible for leading the development of the provincial Capital Plan, which addresses the provincial infrastructure needs of Alberta’s population that support key social programs and services and economic development. The Ministry designs, builds, manages, and maintains government-owned and operated facilities, and collaborates with other ministries to ensure that school and hospital infrastructure meet the needs of Alberta’s population. Infrastructure provides accommodation services and manages a large portfolio of owned and leased facilities while maintaining fiscal accountability and optimizing value for Albertans. For more information about Alberta Infrastructure, please visit: http://www.infrastructure.alberta.ca."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": null,
      "intro_paragraphs": [],
      "responsibility_groups": [
        {
          "heading": "The Project Manager directly manages the delivery of assigned capital projects or delivery of major maintenance, operations, and tenant improvement projects and consultant investigations in government owned and leased facilities. The Project Manager manages multi-discipline projects involving architectural, structural, mechanical and electrical disciplines, etc.As the project team leader, the Project Manager defines project requirements with clients; coordinates the activities of all that support the project including in-house team members, private sector consultants, and contractors; and ensures that project scope, time, cost and quality objectives are met. The Project Manager ensures all phases of project activities comply with relevant Government legislation, policies, guidelines, standards and procedures. A key component of this position is working with stakeholders and industry to achieve results, requiring extensive professional knowledge of project management principles including knowledge of procurement, design, and construction disciplines.The primary responsibilities for the Project Manger include, but are not limited to",
          "items": [
            "Managing the planning, execution, control, and closure of assigned capital projects within approved scope, cost, and schedule.",
            "Initiating and directing the development of business cases to evaluate alternative capital development solutions as required.",
            "Managing project expenditures and budget management through all stages of project implementation to ensure maximum value within approved budget.",
            "Collaborating with project team members to establish feasible milestone dates that incorporate critical events and the operational requirements of the clients.",
            "Directing consultants to ensure quality control of deliverables, such as building system start-up/verification reports, design reports and contract documents, and to ensure completeness and compliance with ministry standards and guidelines, and code requirements including LEED (Leadership in Energy and Environmental Design).",
            "Developing Ministerial briefings and correspondence on project-related issues.",
            "Managing consultant and architect contracts and determining payment of associated invoices.",
            "Determining which risks are likely to affect the project scope, cost and/or schedule and evaluating the likelihood of such risk."
          ]
        }
      ],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Systems Thinking: Takes a long-term view towards organization’s objectives and how to achieve them.Creative Problem Solving: Engages the community and resources at hand to address issues.Drive for Results: Takes and delegates responsibility for outcomes.Agility: Identifies and manages required change and the associated risks.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Systems Thinking: Takes a long-term view towards organization’s objectives and how to achieve them.Creative Problem Solving: Engages the community and resources at hand to address issues.Drive for Results: Takes and delegates responsibility for outcomes.Agility: Identifies and manages required change and the associated risks."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [
          "Six years of directly related experience in Building construction projects ranging from $10 million to $500 million.",
          "Preference will be given to candidates who will provide a list of construction projects completed in the last six years along with their roles and responsibilities."
        ],
        "other": [
          "University graduation in a field related to the position assignment (e.g. Engineering or Architecture).",
          "A valid Class 5 Alberta Driver’s Licence."
        ]
      },
      "equivalency": {
        "text": ": Related experience or education (e.g. related diploma) may be considered as an equivalency on a one for one basis.",
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Project Management Designation.",
          "Construction Contract Administrator Certification or Project Management Certification.",
          "Extensive project management experience with the planning, design, construction, renovation, and commissioning of health facilities.",
          "Contract management experience, and considerable experience managing interdisciplinary teams and resources, and a diverse portfolio of building projects."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This position is a Permanent, full-time role with the standard weekly work hours of 36.25, Monday to Friday (8:15 am – 4:30 pm).Location: Calgary AlbertaA valid Class 5 Driver’s Licence is required for this position.Pre-Employment Checks will be completed to assess the candidate’s suitability for a role. These checks may include (but are not limited to): references, criminal record check, academic verification, etc.Candidates with lesser qualifications may be considered at a lower classification and salary.Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in.Links and information on what the Government of Alberta has to offer to prospective employees:",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx.",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "https://www.mepp.ca.",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "https://www.alberta.ca/alberta-public-service-benefits.",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "https://www.alberta.ca/professional-development-support-directive.",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "https://researchapscareers.alberta.ca.",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Donna.M.Lee@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "593488917",
    "scraped_at": "2025-11-09T19:19:49.715757",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}