{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Senior-Analyst-Rate-Review/595743417/"
    },
    "header": {
      "job_title": "Senior Analyst Rate Review",
      "posting_date": "Nov 6, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Senior Analyst Rate Review",
      "job_requisition_id": "75486",
      "ministry": "Treasury Board & Finance",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Ongoing",
      "scope": "Open Competition",
      "closing_date": "Open until filled",
      "classification": "Program Services 4 (PS 4)",
      "salary": {
        "raw_text": "​$3,056.5 to $4,006.62 bi-weekly ($79,774 - $104,572/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": 79774.0,
        "annual_max": 104572.0,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Senior Analyst Rate Review Job Requisition ID: 75486Ministry: Treasury Board & FinanceLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: OngoingScope: Open CompetitionClosing Date: Open until filledClassification: Program Services 4 (PS 4)Salary: ​$3,056.5 to $4,006.62 bi-weekly ($79,774 - $104,572/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.Treasury Board and Finance, Edmonton – Responsible for financial sector policy and regulation, budget planning, financial management and economic analysis, as well as the administration of tax and revenue programs.For further information about Treasury Board and Finance, see our website at http://www.finance.alberta.caThe Alberta Automobile Insurance Rate Board (AIRB) is an independent regulator responsible for regulating automobile insurance rating programs in Alberta.For further information about AIRB visit http://www.airb.alberta.ca",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Automobile Insurance Rate Board",
      "body": [
        "diversity-inclusion-policy.aspx.Treasury Board and Finance, Edmonton – Responsible for financial sector policy and regulation, budget planning, financial management and economic analysis, as well as the administration of tax and revenue programs.For further information about Treasury Board and Finance, see our website at http://www.finance.alberta.caThe Alberta Automobile Insurance Rate Board (AIRB) is an independent regulator responsible for regulating automobile insurance rating programs in Alberta.For further information about AIRB visit http://www.airb.alberta.ca"
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": null,
      "intro_paragraphs": [
        "Are you an Insurance professional? Do you have an in-depth knowledge of the principles of automobile insurance? We are seeking to fill the position of Senior Analyst Rate Review.Reporting to the Manager Rate Review and Analytics, the incumbent is instrumental in the Automobile Insurance Rate Board (AIRB)'s mandate to regulate the pricing of automobile insurance in Alberta. This position reviews rate filings submitted by insurers, writes and presents reports and recommendations to the Board, taking into consideration the current market environment, insurer's circumstances, filing requirements and potential premium impact to policyholders. As a subject matter expert, the position also leads projects related to regulatory policy development, research, and stakeholder consultations leading to recommended direction provided to the AIRB on technical issues. This position will be responsible for:• Managing and reviewing filings from insurers under the Automobile Insurance Premiums Regulation to revise rating programs for all classes of automobile risks. This position reviews rate filings submitted by insurers and writes reports to recommend action to the Board, taking into consideration the potential premium impact to policyholders. • Conduct research / thematic reviews on current issues or practices in rating programs (such as conviction surcharges, underwriting, rate capping etc.) to ensure policies balance the needs of both insurers and consumers. • Participating in regulatory policy development, providing advice to the AIRB on policy and technical issues and implementation and maintenance of AIRB decisions.• Developing and maintaining relationships with and work performed by consulting actuaries and other relevant stakeholders.• Working with consulting actuaries to develop new approaches to streamline filing processes and implement reforms or regulatory changes.The Senior Analyst Rate Review should have the background knowledge to apply the related Legislation, Regulations and Filing Guidelines. The ideal candidate should have strong written, verbal, and presentation skills with the ability to communicate with a variety of stakeholders. The ideal candidate should be a strong team player with the ability to work independently; possess strong analytical and decision making skills; have the ability to organize and prioritize tasks/projects to meet deadlines and provide reasonable turnaround time for insurers submissions. Please click on this link to view the job description for this position."
      ],
      "responsibility_groups": [],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/vckno24m/jr75486_senior-analyst-rate-review_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.In this role, you will contribute to our team by demonstrating the following behavioral competencies:Systems Thinking: Takes holistic long-term view of challenges and opportunities. Anticipates outcomes and potential impacts and seeks stakeholder perspectives. Works towards actions and plans aligned with APS values. Works with others to identify areas for collaborationDevelop Networks: Creates impactful relationships with the right people. Ensures needs of varying groups are represents. Goes beyond to meet stakeholder needs. Ensures all needs are heard and understoodAgility: Identifies alternative approaches and supports others to do the same. Proactively explains impact of changes. Anticipates and mitigates the emotions of others. Anticipates obstacles and stays focused on goals.Drive for Results: Knowing what financial outcomes are important and maximizing resources to achieve results that are aligned with the goals of the Government of Alberta, while maintaining accountability.Build Collaborative Environments: Involves a wide group of stakeholders when working on outcomes: Involves stakeholders and shares resources. Positively resolves conflict through coaching and facilitated discussion. Uses enthusiasm to motivate and guide others.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.In this role, you will contribute to our team by demonstrating the following behavioral competencies:Systems Thinking: Takes holistic long-term view of challenges and opportunities. Anticipates outcomes and potential impacts and seeks stakeholder perspectives. Works towards actions and plans aligned with APS values. Works with others to identify areas for collaborationDevelop Networks: Creates impactful relationships with the right people. Ensures needs of varying groups are represents. Goes beyond to meet stakeholder needs. Ensures all needs are heard and understoodAgility: Identifies alternative approaches and supports others to do the same. Proactively explains impact of changes. Anticipates and mitigates the emotions of others. Anticipates obstacles and stays focused on goals.Drive for Results: Knowing what financial outcomes are important and maximizing resources to achieve results that are aligned with the goals of the Government of Alberta, while maintaining accountability.Build Collaborative Environments: Involves a wide group of stakeholders when working on outcomes: Involves stakeholders and shares resources. Positively resolves conflict through coaching and facilitated discussion. Uses enthusiasm to motivate and guide others."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "A Chartered Insurance Professional (CIP) Designation or actuarial examinations sponsored by the Casualty Actuarial Society or equivalent would be an asset to provide appropriate context and background knowledge.",
          "Previous experience in underwriting for auto insurance would be an asset to provide appropriate context and background knowledge.",
          "A cover letter outlining what makes you the ideal fit is required, and will be used to help us assess your written communication skills.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This position is a permanent, full-time position working 36.25 hours per week, Monday to Friday",
      "location_reminder": null,
      "assessment_info": [
        "This position will be located at #2440, 10303 Jasper Avenue, Edmonton, AB, T5J 3N6.Candidates with lesser qualifications may be considered at a lower classification and salary. This competition may be used to fill future roles at the same or lower classifications.Candidates may be asked to participate in a written assessment. Final Candidates for this position will be asked to undergo a security screening.Links and information on what the GoA have to offer to prospective employees.• Working for the Alberta Public Service - https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx.• Public Service Pension Plan (PSPP) - https://www.pspp.ca.• Alberta Public Service Benefit Information - https://www.alberta.ca/alberta-public-service-benefits.• Professional learning and development - https://www.alberta.ca/professional-development-support-directive.• Research Alberta Public Service Careers tool – https://researchapscareers.alberta.ca.• Positive workplace culture and work-life balance.• Opportunity to participate in flexible work arrangements such as working from home up to two days per week and modified work schedule agreement.• Leadership and mentorship programs."
      ],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Shannon.Rowe@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "595743417",
    "scraped_at": "2025-11-09T19:16:47.656864",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}