{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Land-Analyst/597006917/"
    },
    "header": {
      "job_title": "Land Analyst",
      "posting_date": "Oct 30, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Land Analyst",
      "job_requisition_id": "76727",
      "ministry": "Energy and Minerals",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 13, 2025",
      "classification": "Legal Administration 2",
      "salary": {
        "raw_text": "$2,240.86 to $2,835.40 bi-weekly ($58,486- $74,003/year)",
        "biweekly_min": 2240.86,
        "biweekly_max": 2835.4,
        "annual_min": 58486.0,
        "annual_max": 74003.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Land Analyst Job Requisition ID: 76727Ministry: Energy and MineralsLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 13, 2025Classification: Legal Administration 2Salary: $2,240.86 to $2,835.40 bi-weekly ($58,486- $74,003/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Energy",
      "body": [
        "diversity-inclusion-policy.aspx. The Ministry of Energy and Minerals is responsible for sustaining the interests of Albertans through the stewardship and responsible development of energy and mineral resource systems. For more information on the work of our Ministry, please visit: https://www.alberta.ca/energy-and-minerals.",
        "The Petroleum and Natural Gas (PNG) Tenure Operations Branch plays a key role in the development of the petroleum and natural gas, geothermal and pore space resources in Alberta. The branch leases petroleum and natural gas rights (PNG), geothermal and pore space rights owned by the Province of Alberta to oil and gas companies so that they can explore for and develop these resources. The branch’s business is complex and highly confidential; decisions made have an immediate and direct impact on industry and the energy sector in Alberta."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Your responsibilities are not limited to:",
      "intro_paragraphs": [
        "Do you enjoy working in a fast paced, collaborative team environment? Do you pride yourself on your exceptional organization and communication skills? Does solving unique and complex issues that require in-depth analysis interest you? If so, a Land Analyst position with PNG Tenure may be the role for you!",
        "The Well Administration and Unit Agreement team within PNG Tenure Operations is seeking a detail-oriented, collaborative, and highly organized Land Analyst. Data review and associations between wells and agreements, Crown authorizations and unit agreement contracts using legislation, and policies are a large portion of the role. These activities involve intuitive reasoning,and must be accurate to properly support decisions for lease continuation, Crown royalty and freehold mineral tax.",
        "Reporting to Team Lead, Wells & Units, Land Analyst will be responsible for making decisions that have a direct impact on industry and the development of PNG, geothermal and pore space resources within the province. Their primary responsibility is to review, analyze and respond to industry requests and process a variety of applications using technical skills and knowledge.",
        "As a Land Analyst, you will manage complex legal agreements, interpret technical data, and ensure compliance with legislation under the Mines and Minerals Act. You’ll work closely with industry stakeholders, legal teams, and internal departments to issue approvals, process applications, and maintain accurate land and mineral records. Your decisions will have immediate and lasting impacts on resource development and industry operations across Alberta."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Create, review, and amend PNG agreements and legal documents.",
            "Process applications for continuation, validation, offset notices, and lease expiries.",
            "Interpret well data and collaborate with geologists to issue approvals.",
            "Manage mineral rights data across multiple land systems (e.g., AMI, ETS, LAMAS).",
            "Register court orders and statutory declarations.",
            "Identify and investigate trespass or unauthorized activity.",
            "Communicate with industry and internal stakeholders regarding approvals and decisions.",
            "Support audits, historical searches, and legal restrictions on agreements.",
            "Contribute to operational improvements, reporting, and team development.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/r5ql4bgs/jr76727-land-analyst-job-description.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Agility: Ability to anticipate, assess, and readily adapt to changing priorities.",
        "Drive for Results: You will demonstrate a strong focus on achieving daily tasks and anticipate outcomes and how they align with the goals of the branch.",
        "Build Collaborative Environment: Contributes and discuss ideas with the team and works collaboratively and maintain open and respectful communication",
        "Systems Thinking: Demonstrate the ability to think broadly while developing and creating processes.",
        "Creative Problem Solving: Ability to assess options and implications in new ways to achieve outcomes and solutions."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "Minimum two-year diploma in either Land Administration/Petroleum Land Administration, Legal Administration, or Business Administration and minimum one year of progressively responsible related experience.",
          "Related experience or education may be considered as an equivalency on a one-for-one basis."
        ],
        "experience": [
          "Related experience may include; interpreting and applying legislation; client service/business administration in the Energy sector; and/or land and geological experience.",
          "Hands-on experience using systems such as AMI, LAMAS, ETS, Petrinex, SPIN2, and GeoScout to manage mineral rights and land data."
        ],
        "other": [
          "The following will be considered assets:",
          "Familiarity with the Mines and Minerals Act, PNG Tenure Regulation, and related legislation.",
          "Ability to interpret technical maps, well data, and geological formations to support decision-making and approvals, as well as accuracy in mathematical calculations.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Familiarity with the Mines and Minerals Act, PNG Tenure Regulation, and related legislation.",
          "Hands-on experience using systems such as AMI, LAMAS, ETS, Petrinex, SPIN2, and GeoScout to manage mineral rights and land data.",
          "Ability to interpret technical maps, well data, and geological formations to support decision-making and approvals, as well as accuracy in mathematical calculations."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "https://www.pspp.ca",
          "url": "https://www.pspp.ca/"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "https://researchapscareers.alberta.ca.",
          "url": "https://researchapscareers.alberta.ca/"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Christie-Anne.Silverthorn@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597006917",
    "scraped_at": "2025-11-09T19:16:34.897039",
    "matched_keyword": "Business Analyst",
    "match_score": 80
  }
}