{
  "job_posting": {
    "search_keyword": "Business Consultant",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Regulatory-Approvals-Coord_/596674617/"
    },
    "header": {
      "job_title": "Regulatory Approvals Coord.",
      "posting_date": "Oct 17, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Regulatory Approvals Coordinator",
      "job_requisition_id": "76235",
      "ministry": "Arts, Culture and Status of Women",
      "location": "Edmonton",
      "full_or_part_time": "Full-Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 17, 2025",
      "classification": "Program Services 2",
      "salary": {
        "raw_text": "$2,487.97 to $ 3,263.63 bi-weekly ($64,936- $85,180/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": 64936.0,
        "annual_max": 85180.0,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Arts",
      "body": [
        "diversity-inclusion-policy.aspx. The Ministry of Arts, Culture and Status of Women promotes and celebrates Alberta’s unique cultural identity and heritage by supporting the development and sustainability of the province’s creative and cultural industries, artists and arts community, non-profit and voluntary sector, services in French and supports for Alberta Francophone community and historical resources, sites, museums and archives. For more information on the Ministry of Arts, Culture and Status of Women, please visit: https://www.alberta.ca/arts-culture-and-status-of-women. Under the Historical Resources Act, Arts, Culture and Status of Women reviews development projects to determine if they are likely to adversely affect historic resources, including archaeological and palaeontological sites, historic buildings, and Indigenous traditional use sites. If historic resources may be affected, the department can issue requirements that developers avoid historic resources or document and/or collect these resources prior to initiating development activities. It can also require developers to consult with Indigenous communities whose traditional use sites may be affected by developments."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Key responsibilities include:",
      "intro_paragraphs": [
        "Reporting to the Senior Regulatory Approvals Coordinator of the Archaeological Survey, the Regulatory Approvals Coordinator reviews applications for approval under the Historical Resources Act and assists in managing information related to the Division’s regulatory function.This requires evaluating applications and supplementary information, determining review requirements, preparing detailed review information for circulation to department subject-matter experts, processing submissions of digital material, assisting with development and implementation of improvements to review processes, and engaging in communication with colleagues, archaeological consultants and industry representatives."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "The Regulatory Approvals Coordinator will assess for accuracy and completeness project development information submitted for the purpose of obtaining Historical Resources Act approval, prepare comprehensive information packages related to these submissions for review by various staff subject-matter experts if required, and coordinate the review and evaluation processes to ensure that responses are made in a timely manner.",
            "The Regulatory Approvals Coordinator will issue some approvals directly in accordance with Divisional guidelines.",
            "The Regulatory Approvals Coordinator will participate in the operation of the Alberta Archaeological Permit System by assisting with the evaluation of permit-related submissions for accuracy and compliance with requirements established by the Archaeological and Palaeontological Research Permit Regulation Alberta Regulation 254/2002 and with the other requirements of the Historic Resources Management Branch.",
            "The Regulatory Approvals Coordinator will contribute to the expansion of information inventories that document and provide essential sources of information on Alberta archaeological resources and the history of their investigation by assisting in the review and accessioning of submissions for the archaeological sites inventory, permit library and CRM library and by capturing in an ArcGIS database digital project information obtained through surveys, assessments and excavations conducted in accordance with the Historical Resources Act.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/yq0an0hf/jr75176-approvals-coordinator.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. The main competencies associated with this position are as follows:",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Creative Problem Solving: This position must engage with staff subject-area specialists and external stakeholders to enhance regulatory processes and contribute to solutions to potential conflicts between proposed development activities and non-renewable historic resources.Build Collaborative Environments: This position must facilitate clear and open communication with internal staff and external stakeholders and contribute to staff development and capacity building processes.Systems Thinking: This position must be aware of current GoA legislation and policy related to industry compliance with the Historical Resources Act, as well as the interests and concerns of industry, professional historic resource consultants and other stakeholders.Drive for Results: The Regulatory Approvals Coordinator must be driven to stay on top of submission workloads by working with Regulatory Approvals Coordinators and staff subject-area specialists to facilitate timely reviews and consistent and fair outcomes."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": []
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "Work hours are 8:15 AM to 4:30 PM, Monday to Friday (36.25 hours/week).Final candidates may be required to undergo a security screening.Any costs associated with obtaining the required documents/checks as noted or interview travel expenses will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply online. Please visit",
        "for more information. Please visit Recruitment Principles, for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information (",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements.",
      "contact": {
        "name": null,
        "email": "Shannon.Rowe@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require accommodations during the recruitment process, please contact Shannon Rowe at"
    }
  },
  "scraping_metadata": {
    "job_id": "596674617",
    "scraped_at": "2025-11-09T19:20:27.847004",
    "matched_keyword": "Business Consultant",
    "match_score": 84
  }
}