{
  "job_posting": {
    "search_keyword": "Business Consultant",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton%2C-Calgary-Project-Manager/587880017/"
    },
    "header": {
      "job_title": "Project Manager",
      "posting_date": "Nov 7, 2025",
      "location_line": "Edmonton, Calgary, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Project Manager",
      "job_requisition_id": "65905",
      "ministry": "Infrastructure",
      "location": "Calgary and Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Temporary & Permanent",
      "scope": "Open Competition",
      "closing_date": "Open until Suitable Candidate is Found",
      "classification": "Manager Zone 2 (M41Z2)",
      "salary": {
        "raw_text": "$3,339.00 - $4,493.32 bi-weekly ($87,148 - $117, 276/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": null,
        "annual_max": null,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Infrastructure",
      "body": [
        "Alberta Infrastructure is responsible for leading the development of the provincial Capital Plan, which addresses the provincial infrastructure needs of Alberta’s population that support key social programs and services and economic development. The Ministry designs, builds, manages, and maintains government-owned and operated facilities, and collaborates with other ministries to ensure that school and hospital infrastructure meet the needs of Alberta’s population. Infrastructure provides accommodation services and manages a large portfolio of owned and leased facilities while maintaining fiscal accountability and optimizing value for Albertans. For more information about Alberta Infrastructure, please visit: http://www.infrastructure.alberta.ca."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "The primary responsibilities for the Project Manger include, but are not limited to:",
      "intro_paragraphs": [
        "Reporting to the Senior Project Manager, the Project Manager directly manages the delivery of assigned K-12 school capital projects. This includes managing the multi-discipline projects involving architectural, structural, mechanical, and electrical disciplines, etc. As the project team leader, the Project Manager identifies project requirements with clients; coordinates the activities of all that support the project including in-house team members, private sector consultants, and contractors; and ensures that project scope, time, cost, and quality objectives are met. The Project Manager ensures all phases of project activities comply with relevant Government legislation, policies, guidelines, standards, and procedures. A key component of this position is working with stakeholders and industry to achieve results, requiring extensive professional knowledge of project management principles including knowledge of procurement, design, and construction disciplines."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Managing the planning, execution, control, and closure of assigned capital projects within approved scope, cost, and schedule.",
            "Ensuring that school capital projects are delivered in accordance with the requirements of the latest version of the School Capital Manual and approved project scope.",
            "Managing project expenditures and budget management through all stages of project implementation to ensure maximum value within approved budget.",
            "Working with internal and/or external stakeholders to control design process and ensure progress along efficient timelines. Ensures design aligns with Ministry design principles.",
            "Directing consultants to ensure quality control of deliverables, such as building system start-up/verification reports, design reports and contract documents, and to ensure completeness and compliance with ministry standards and guidelines, and code requirements including LEED (Leadership in Energy and Environmental Design).",
            "Developing Ministerial briefings and correspondence on project-related issues.",
            "Managing consultant and architect contracts and determining payment of associated invoices.",
            "Please click on this link for a copy of the Job Description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/piylp13u/jr-65905_mgr-zone-2_project-manager_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf. Creative Problem Solving: Works in open teams to share ideas and process issues Agility: Proactively incorporates change into processes Drive for Results: Works to remove barriers to outcomes, sticking to principles Build Collaborative Environments: Involves a wide group of stakeholders when working on outcomes",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf. Creative Problem Solving: Works in open teams to share ideas and process issues Agility: Proactively incorporates change into processes Drive for Results: Works to remove barriers to outcomes, sticking to principles Build Collaborative Environments: Involves a wide group of stakeholders when working on outcomes"
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [
          "Four years of directly related experience"
        ],
        "other": [
          "University graduation in a field related to the position assignment (e.g. Architecture or Engineering)"
        ]
      },
      "equivalency": {
        "text": "Related experience or education (e.g. related diploma) may be considered as an equivalency on a one for one basis.",
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Construction Contract Administrator Certification or Project Management Certification",
          "Extensive project management experience with the delivery (planning, design, construction, and commissioning) of building capital projects.",
          "Contract management experience, and considerable experience managing interdisciplinary teams and resources, and a diverse portfolio of building projects"
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "Location: Calgary and Edmonton, AlbertaTerm of Employment: Multiple positions, Temporary and Permanent Required Travel: 25-50%; A valid Class 5 Driver’s Licence is required for this position. Please note written assignments may be required.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "Final candidates will be required to undergo a security screening. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in. Pre-Employment Checks will be completed to assess the candidate’s suitability for a role. These checks may include (but are not limited to): references, criminal record check, academic verification, etc."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.mepp.ca",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information (",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "donna.m.lee@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Donna.M.Lee at"
    }
  },
  "scraping_metadata": {
    "job_id": "587880017",
    "scraped_at": "2025-11-09T19:20:31.022871",
    "matched_keyword": "Business Consultant",
    "match_score": 100
  }
}