{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Environmental-GIS-Analyst/597082817/"
    },
    "header": {
      "job_title": "Environmental GIS Analyst",
      "posting_date": "Nov 3, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Environmental GIS Analyst",
      "job_requisition_id": "76254",
      "ministry": "Environment and Protected Areas",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 17, 2025",
      "classification": "Program Services 3",
      "salary": {
        "raw_text": "$2,849.89 to $3,738.14 bi-weekly ($74,382.12 - $97,565.45 /year)",
        "biweekly_min": 2849.89,
        "biweekly_max": 3738.14,
        "annual_min": null,
        "annual_max": null,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Environmental GIS Analyst Job Requisition ID: 76254Ministry: Environment and Protected AreasLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 17, 2025Classification: Program Services 3 Salary: $2,849.89 to $3,738.14 bi-weekly ($74,382.12 - $97,565.45 /year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit:https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Environment",
      "body": [
        "diversity-inclusion-policy.aspx. Alberta Environment and Protected Areas is dedicated to safeguarding Alberta's natural resources and ecosystems while balancing environmental and economic needs. We focus on wildlife conservation, managing protected areas, creating environmental policies, conducting research, and engaging the public through educational initiatives. Our commitment is to sustainability, ensuring Alberta’s landscapes and resources are preserved and responsibly managed for future generations.For more information about the Ministry of Environment and Protected Areas, please visit our website at: https://www.alberta.ca/environment-and-protected-areas.aspx."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Please click on this link to view the job description for this position.",
      "intro_paragraphs": [],
      "responsibility_groups": [
        {
          "heading": "Are you passionate about geospatial data and environmental management? Do you want to join a team that maintains and updates the Foundational Geospatial Data for Alberta? If so, you might be interested in the Environmental GIS Analyst position at the Provincial Geospatial Centre (PGC).As an Environmental GIS Analyst, your work will involve datasets related to ecosystem components such as wetlands, hydrography, landforms, fisheries, aquatic ecology, vegetation and soils. Your focus will be on water-related datasets, which are essential for land-based activities in Alberta. Your responsibilities will include creating, maintaining, and documenting these datasets and making them available for government and public clients. Additionally, you will follow geospatial best practices for products, technologies, procurement, and distribution.You will also",
          "items": [
            "Ensure that the PGC’s foundational biophysical spatial datasets are created and maintained in accordance with applicable legislation, regulations, policies, and standards.",
            "Support the unit lead in responding to technical inquiries/requests related to biophysical datasets to ensure client needs are met.",
            "Participate in the development and/or improvement of standards, processes, and products within the program to ensure efficiency and modernization of foundational datasets.",
            "Apply your knowledge and skills in data capture, scientific analysis and the management of environmental and natural resource information using Geographic Information System (GIS) software such as ESRI ArcGIS.",
            "Use your experience in understanding and interpretation of specifications, remote sensing datasets, geospatial data formats, geo-referencing, aerial photography, geospatial metadata, digitizing, and mapping."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/ocxarip1/jr76254_environmental-gis-analyst_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Please be advised that there will be a competency-based interview for this competition. The behavioral competencies that have been deemed as critical for this role include:Agility: ability to anticipate, assess and readily adapt to changing priorities when overseeing day-to-day operations.Creative Problem Solving: ability to assess, evaluate and make recommendations to enhance operations and programming.Develop Self and Others: desire and drive to mentor and assist staff and volunteers to understand their roles in the bigger picture of Alberta Environment and Parks, as well as provide training so that they have the tools for effective program delivery.Build Collaborative Environments: support working groups to meet and develop outcomes to support strategic policy needs.Develop Networks: build networks, connect and foster trust in relationships with different stakeholders.Systems Thinking: know that work done in one part of the Alberta Public Service (APS) broadly impacts a variety of other groups/projects inside and outside the APS and affects other connections in government.Other Relevant Attributes: capable of public speaking and being able to navigate high-volume, fast-paced workloads while managing tight and complex timelines.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Please be advised that there will be a competency-based interview for this competition. The behavioral competencies that have been deemed as critical for this role include:Agility: ability to anticipate, assess and readily adapt to changing priorities when overseeing day-to-day operations.Creative Problem Solving: ability to assess, evaluate and make recommendations to enhance operations and programming.Develop Self and Others: desire and drive to mentor and assist staff and volunteers to understand their roles in the bigger picture of Alberta Environment and Parks, as well as provide training so that they have the tools for effective program delivery.Build Collaborative Environments: support working groups to meet and develop outcomes to support strategic policy needs.Develop Networks: build networks, connect and foster trust in relationships with different stakeholders.Systems Thinking: know that work done in one part of the Alberta Public Service (APS) broadly impacts a variety of other groups/projects inside and outside the APS and affects other connections in government.Other Relevant Attributes: capable of public speaking and being able to navigate high-volume, fast-paced workloads while managing tight and complex timelines."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [],
        "other": [
          "University graduation in a natural science field with a focus on Geographic information systems (GIS).",
          "Minimum Two (2) years of related experience in geospatial technologies, GIS as applied to natural resource management."
        ]
      },
      "equivalency": {
        "text": "Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education.",
        "rules": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Demonstrated advanced knowledge of Geographic Information Systems such as ESRI ArcGIS technology. This includes ability to acquire, manage and analyze geospatial data; create and publish map services; communicate geospatial information to clients, peers and management.",
          "Demonstrated extensive experience in the use of desktop GIS software, primarily ESRI ArcGIS Desktop, ArcGIS Pro, and ESRI ArcGIS Online or Enterprise Portal environments.",
          "Experience in working with and the interpretation of aerial and satellite imagery in ArcGIS software.",
          "Knowledge of and experience in advanced geoprocessing, scripting (i.e., Python, JavaScript and others) and automation of GIS workflows.",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          ".",
          "Experience in working with and the interpretation of aerial and satellite imagery in ArcGIS software.Knowledge of and experience in advanced geoprocessing, scripting (i.e., Python, JavaScript and others) and automation of GIS workflows."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [
        "This position works Monday to Friday, 8:15 AM-4:30 PM, 36.25 hours a week.In your application, please include a cover page detailing your interest in the position, and role related experience. In your resume, include dates (including months and years) associated with all education and work experience. Also, please indicate whether your work experience is casual, part-time, or full-time. For example, January 15, 2006 - June 25, 2009: Assistant (PT three 8 hrs. shifts/week).Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in.Links and information on what the GoA have to offer to prospective employees."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "www.mepp.ca",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Jane.McEwen@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597082817",
    "scraped_at": "2025-11-09T19:17:00.420360",
    "matched_keyword": "Business Analyst",
    "match_score": 90
  }
}