{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Program-Coordinator/597011617/"
    },
    "header": {
      "job_title": "Program Coordinator",
      "posting_date": "Oct 30, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Program Coordinator",
      "job_requisition_id": "76376",
      "ministry": "Jobs, Economy, Trade and Immigration",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 12, 2025",
      "classification": "Program Services 2",
      "salary": {
        "raw_text": "$2,487.97 to $3,263.63 bi-weekly ($64,936 - $85,180/year)",
        "biweekly_min": 2487.97,
        "biweekly_max": 3263.63,
        "annual_min": 64936.0,
        "annual_max": 85180.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Program Coordinator Job Requisition ID: 76376Ministry: Jobs, Economy, Trade and ImmigrationLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 12, 2025 Classification: Program Services 2Salary: $2,487.97 to $3,263.63 bi-weekly ($64,936 - $85,180/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Jobs",
      "body": [
        "The Ministry of Jobs, Economy, Trade and Immigration is responsible for leading efforts to grow Alberta’s economy by supporting Alberta’s entrepreneurs and employers, promoting trade and investment, helping recruit and retain skilled workers, and promoting safe, fair and healthy workplaces, and supporting multicultural communities. For more information on the Ministry of Jobs, Economy, Trade and Immigration, please visit: https://www.alberta.ca/jobs-economy-trade-and-immigration."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "The Ministry of Jobs, Economy, Trade and Immigration has an exciting opportunity for you to join our team as Program Coordinator!",
      "intro_paragraphs": [
        "The Economic Development and Business Supports Division drives the department's economic development agenda through policies, strategies, and programs that help create jobs and diversify Alberta's economy. This work includes delivering high-quality programs, engaging stakeholders, and providing timely analysis and policy advice to support strategic decision making.",
        "Reporting to the Manager, Film and Television Tax Credit Program, the Program Coordinator position exists to provide essential program delivery and support to the Film and Television Tax Credit (FTTC) program. The role ensures that applications and reporting are processed efficiently, accurately, and in compliance with established legislation and policies."
      ],
      "responsibility_groups": [
        {
          "heading": "Key Responsibilities",
          "items": [
            "Program Delivery Receive and perform initial reviews on FTTC applications to ensure eligibility and completeness. Manage the program's email inbox, and address inquires in a timely manner. Respond directly to client inquiries regarding: eligible expenses and activities; project and approval timelines; program administration; access to program information. Conduct initial application reviews within the application portal.",
            "Support Program Management and Continuous Program Improvement Liaise with internal staff and external stakeholders to support program management and continuous improvement. Ensure best practices in program management are being followed. Complete research that informs the development of program administration and outward facing program documents to govern the program. Develop aids and supports that foster uptake and engagement within the program (e.g., templates, FAQs, checklists, manuals, guidelines etc.).",
            "Stakeholder Engagement Liaise with applicants on program inquiries throughout the application process. Liaise with other ministries, programs and stakeholders as needed. Support development of materials, such as briefing notes, that will be provided to decision-makers for review, including the Senior Program Advisor, Manager, Director, Executive Director, Assistant Deputy Minister, Deputy Minister, and Minister.",
            "Receive and perform initial reviews on FTTC applications to ensure eligibility and completeness.",
            "Manage the program's email inbox, and address inquires in a timely manner.",
            "Respond directly to client inquiries regarding: eligible expenses and activities; project and approval timelines; program administration; access to program information.",
            "Conduct initial application reviews within the application portal.",
            "Liaise with internal staff and external stakeholders to support program management and continuous improvement.",
            "Ensure best practices in program management are being followed.",
            "Complete research that informs the development of program administration and outward facing program documents to govern the program.",
            "Develop aids and supports that foster uptake and engagement within the program (e.g., templates, FAQs, checklists, manuals, guidelines etc.).",
            "Liaise with applicants on program inquiries throughout the application process.",
            "Liaise with other ministries, programs and stakeholders as needed.",
            "Support development of materials, such as briefing notes, that will be provided to decision-makers for review, including the Senior Program Advisor, Manager, Director, Executive Director, Assistant Deputy Minister, Deputy Minister, and Minister.",
            "Please click on this link to view the job description."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/vtzla4j3/jr76376_program-coordinator_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Creative Problem Solving: Explore creative options in order to address potential stakeholder requests and challenges.",
        "Drive for Results: Deliver reliable and accurate information in a timely and consistent manner.",
        "Agility: Adjust to changing priorities and evolving situations.",
        "Develop Networks: Rely on an effective network of contacts to successfully execute the work."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education."
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": ": Directly related education or experience considered based on: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education. For application consideration, please attach a cover letter explaining your qualification and suitability for this role. The following knowledge or experiences are considered as assets: Some experience in a related field such as business is preferred. Experience in tax credit program development or delivery in the context of public administration. Knowledge of related accounting principals. Knowledge of grants management tracking systems such as Microsoft Client Relations Management (CRM). Proficient with Microsoft Office, including Word, Outlook, Excel and PowerPoint. https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards .",
        "rules": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Some experience in a related field such as business is preferred.",
          "Experience in tax credit program development or delivery in the context of public administration.",
          "Knowledge of related accounting principals.",
          "Knowledge of grants management tracking systems such as Microsoft Client Relations Management (CRM).",
          "Proficient with Microsoft Office, including Word, Outlook, Excel and PowerPoint."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This is a permanent, full-time position with 36.25 hours per week, Monday to Friday.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "The final candidates for this position will be asked to undergo an academic check as well as reference checks and may need to provide a suitable security screening. Candidates may be asked to complete a written exercise and/or assessment."
      ],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining required documents/checks as noted or interview travel expenses will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies across the Government of Alberta at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Gloria.Ducharme@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597011617",
    "scraped_at": "2025-11-09T19:18:29.618116",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}