{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Election-Policy-Analyst/597230417/"
    },
    "header": {
      "job_title": "Election Policy Analyst",
      "posting_date": "Nov 7, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Election Policy Analyst",
      "job_requisition_id": "77184",
      "ministry": "Elections Alberta",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": null,
      "scope": "Open Competition",
      "closing_date": "November 17, 2025 at 11:59 pm",
      "classification": "Program Services 3E",
      "salary": {
        "raw_text": "$2,849.89 to $3,738.14 bi-weekly",
        "biweekly_min": 2849.89,
        "biweekly_max": 3738.14,
        "annual_min": null,
        "annual_max": null,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": null,
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "About Us",
      "body": [
        "Elections Alberta is an independent, non-partisan office of the Legislature. Elections Alberta is responsible for administering provincial elections, by-elections and referenda. Our mission is to serve Albertans as an independent election management body committed to the administration of modern, transparent, and accessible democratic processes that ensure the integrity and enhance the value of Alberta’s electoral system."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Responsibilities include:",
      "intro_paragraphs": [
        "Reporting to the Team Lead, Election Policy and Training, the Election Policy Analyst is responsible for the development of processes and materials used to administer electoral events, including elections and referenda, citizen initiative and recall petitions and votes, and electoral events held in conjunction with local authority elections. The Election Policy Analyst is considered a subject matter expert in electoral administration and collaborates on the development of field staff training programs for election officers. This position is a key point of contact for field staff to support appropriate application and understanding of legislation, policy, technology, and procedures in electoral administration."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Develops policy, processes, procedures, forms and other materials in compliance with legislation for elections, referenda, recall votes, and citizen initiative and recall petitions.",
            "Ensures the quality and effectiveness of electoral event field staff training programs for election officers by collaborating on its development and serving as subject matter expert (SME).",
            "Identifies and analyzes opportunities for procedural improvements and modernizations.",
            "Supports the larger election team in program service delivery and other related duties."
          ]
        }
      ],
      "job_description_link_text": null,
      "job_description_url": null
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": null,
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": []
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "A bachelor’s degree in public administration, political science, or a related field, plus at least two years of related experience"
        ],
        "experience": [
          "Related experience may include:",
          "Related experience may include: Election administration Policy analysis and development Interpreting and implementing legislation, regulations, and policies in complex situations Project and/or event coordination, managing projects or project components"
        ],
        "other": [
          "Election administration",
          "Policy analysis and development",
          "Interpreting and implementing legislation, regulations, and policies in complex situations",
          "Project and/or event coordination, managing projects or project components",
          "Ability to clearly communicate in writing using plain language and well-developed business writing skills.",
          "Strong verbal communication skills, including effective presentation skills.",
          "Ability to synthesize complex legislation and procedures to develop effective materials and resources.",
          "Ability to analyze and develop process and procedural documentation.",
          "Strong computer skills, including Adobe Illustrator and Microsoft Office.",
          "Ability to learn and utilize software applications and assist others in their use.",
          "Self-motivated and capable of handling a wide range of project responsibilities.",
          "Adapts and respond to change positively.",
          "Creativity, initiative, and sound judgment, particularly as it relates to problem-solving skills.",
          "Ability to manage competing priorities and produce results within deadlines.",
          "Fulfil the requirement and act as a non-partisan representative of Elections Alberta.",
          "Prepare and deliver presentations and training.",
          "Travel, occasionally, to locations throughout the province.",
          "Work outside normal business hours, occasionally, to meet deadlines."
        ]
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": []
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [
        "This position is exempt from the Alberta Union of Provincial Employees (AUPE). Final Candidates will be required to undergo a Police Information Check."
      ],
      "security_screening": [],
      "reuse_competition_note": [
        "We thank all applicants for their interest. Applications will be reviewed to determine which candidates’ education and experience best meets the needs of the position. Only individuals selected for interviews will be contacted. This competition may be used to fill future vacancies."
      ],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "alberta.ca",
          "url": "https://www.alberta.ca/international-qualifications-assessment.aspx"
        },
        {
          "label": "Alliance of Credential Evaluation Services of Canada",
          "url": "https://canalliance.org/en/default.html"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": null,
      "thanks_and_screening_note": null,
      "contact": {
        "name": null,
        "email": null
      },
      "accommodation_note": null
    }
  },
  "scraping_metadata": {
    "job_id": "597230417",
    "scraped_at": "2025-11-09T19:16:41.290419",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}