{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Calgary-or-Edmonton-Senior-Policy-Advisor/597164717/"
    },
    "header": {
      "job_title": "Senior Policy Advisor",
      "posting_date": "Nov 5, 2025",
      "location_line": "Calgary or Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Senior Policy Advisor",
      "job_requisition_id": "76990",
      "ministry": "Affordability and Utilities",
      "location": "Calgary or Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Ongoing",
      "scope": "Open Competition",
      "closing_date": "November 12, 2025",
      "classification": "Program Services 4",
      "salary": {
        "raw_text": "$3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)",
        "biweekly_min": 3056.5,
        "biweekly_max": 4006.62,
        "annual_min": 79774.0,
        "annual_max": 104572.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Permanent/Temporary: OngoingScope: Open CompetitionClosing Date: November 12, 2025Classification: Program Services 4 Salary: $3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": null,
      "body": [
        "Affordability and Utilities is responsible for leading and coordinating government’s ongoing efforts to make everyday life more affordable, with particular focus on the province’s utilities sector and electricity system. Please visit: Affordability and Utilities | Alberta.ca."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Key responsibilities of the Senior Policy advisor include:",
      "intro_paragraphs": [
        "Are you ready to take on a pivotal role in advancing strategic initiatives that enhance Alberta’s affordability and utility services? Join a ministry focused on developing policies that strengthen efficiency, reliability and sustainability across the province.",
        "As a Senior Policy Advisor, you will provide strategic leadership in the development, analysis, and implementation of key policy and program initiatives. You will work collaboratively across government and with stakeholders to identify emerging issues, evaluate policy options, and provide evidence-based recommendations that inform decision making at senior levels.",
        "This position offers the opportunity to work on complex, high-impact initiatives that shape the direction of affordability and utility services in Alberta. Your strong analytical abilities, strategic thinking and commitment to collaboration will be essential in supporting the ministry’s goals and delivering meaningful outcomes for Albertans."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Strategic Policy Development: Analyze data and provide precise policy advice, exploring reform options and staying updated on global approaches.",
            "Stakeholder Engagement and Project Leadership: Lead major projects, coordinate consultations, assess policy options and present insights to management and stakeholders.",
            "Performance Tracking and Program Enhancement: Synthesize information, drive program improvements and lead strategic initiatives while effectively communicating with stakeholders.",
            "Cohesive and Informed Affordability Branch: Advocate for priorities, engage stakeholders, influence outcomes and ensure efficient information exchange within the branch.",
            "Please click on this link to view the job description."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/mgdn3nhm/jr76990_senior-policy-advisor_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Agility: Anticipate, assess, and readily adapt to changing priorities, manage resilience in times of uncertainty, and effectively work in a changing environment.",
        "Drive for Results: Requires a result-focused individual that takes personal responsibility in ensuring key deliverables are met on time.",
        "Develop Networks: Considers how changes might impact colleagues, clients and stakeholders, and actively seeks their input and/or involvement regarding those changes.",
        "Systems Thinking: Anticipates outcomes and potential impacts across inter-related areas in the department and factors.",
        "Creative Problem Solving: Accesses resources, information and technology from other areas, and uses it to analyze issues, resolve problems, and improve performance."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education."
        ],
        "experience": [],
        "other": [
          "Legislation and policy interpretation.",
          "Program evaluation and performance measurement.",
          "Stakeholder engagement.",
          "Economic analysis and forecasting.",
          "Research and data analysis."
        ]
      },
      "equivalency": {
        "text": "Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education. Required Experience: Legislation and policy interpretation. Program evaluation and performance measurement. Stakeholder engagement. Economic analysis and forecasting. Research and data analysis.",
        "rules": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Experience leveraging AI tools to support research and data analysis.",
          "Proficiency in project planning and coordination for timely execution and stakeholder involvement.",
          "Familiarity with province-federal relationships, enabling informed decision-making aligned with higher-level goals.",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining required documents/checks as noted or interview travel expenses will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies across the Government of Alberta at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Christie-Anne.Silverthorn@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Christie-Anne.Silverthorn at"
    }
  },
  "scraping_metadata": {
    "job_id": "597164717",
    "scraped_at": "2025-11-09T19:19:40.216399",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}