{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Manager%2C-Compliance/597116017/"
    },
    "header": {
      "job_title": "Manager, Compliance",
      "posting_date": "Nov 4, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Manager, Compliance",
      "job_requisition_id": "76819",
      "ministry": "Municipal Affairs",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 13,2025",
      "classification": "Manager Zone 2",
      "salary": {
        "raw_text": "​$3,339.00 to $4,493.32 bi-weekly ($87,148 - $117,276/year)",
        "biweekly_min": 3339.0,
        "biweekly_max": 4493.32,
        "annual_min": 87148.0,
        "annual_max": 117276.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Manager, Compliance Job Requisition ID: 76819Ministry: Municipal AffairsLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 13,2025Classification: Manager Zone 2Salary: ​$3,339.00 to $4,493.32 bi-weekly ($87,148 - $117,276/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.The Ministry of Municipal Affairs supports municipalities in providing well-managed, fiscally responsible, and accountable local government to Albertans. This includes administering municipal grant programs; delivering advisory and capacity-building supports; providing municipal services and managing public lands in the province’s three Special Areas; and overseeing the safety codes system in the province. The ministry also fosters stronger, safer communities across the province, and enables local governments to facilitate Alberta’s economic prosperity.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Municipal Affairs",
      "body": [
        "diversity-inclusion-policy.aspx.The Ministry of Municipal Affairs supports municipalities in providing well-managed, fiscally responsible, and accountable local government to Albertans. This includes administering municipal grant programs; delivering advisory and capacity-building supports; providing municipal services and managing public lands in the province’s three Special Areas; and overseeing the safety codes system in the province. The ministry also fosters stronger, safer communities across the province, and enables local governments to facilitate Alberta’s economic prosperity. To learn more about Municipal Affairs, follow the link to: https://www.alberta.ca/municipal-affairs.aspx"
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "The Residential Protection Program (RPP) oversees new home warranty and builder licensing requirements in Alberta.",
      "intro_paragraphs": [
        "The Technical and Corporate Services Division administers a framework of safety codes and standards, supports Alberta's fire services, and oversees the mandatory new home warranty framework.",
        "The Manager, Compliance is a key position within the RPP. The position is responsible for leading and managing a team of Compliance Officers providing regulatory compliance and enforcement functions under the New Home Buyer Protection Act and related regulations."
      ],
      "responsibility_groups": [
        {
          "heading": "Your key responsibilities will include",
          "items": [
            "• Overseeing Compliance Operations in the Residential Protection Program – identification and resolution of compliance issues and ensuring a common and consistent process across all incidents, supporting the most complex issues through to resolution.• Continuous Improvement – Working with other managers in the RPP and across the Division to continually identify areas of improvement and contributing to development and implementation of updated policy, procedures, and training.• Team Leadership and Development – Demonstrating effective leadership and cultivating a positive work environment. Providing coaching to staff on best practices in regulatory compliance.• Stakeholder and Client Relationship Management – communicating compliance decisions; addressing concerns regarding compliance processes, decisions, and outcomes; and building connections with stakeholders, including other ministries and agencies, to share information and improve the RPP compliance function.• Supporting the Director to facilitate achievement of branch goals, raising awareness of emerging issues and program risks, and coordinating the identification and recommendation of solutions and mitigation strategies.",
            "Please click on this LINK to view the job description for this position"
          ]
        }
      ],
      "job_description_link_text": "LINK",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/mbqlumvp/jr-76819-_manager-compliance-jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. Systems Thinking: Takes a long-term view towards organization’s objectives and how to achieve them. Takes holistic long-term view of challenges and opportunities. Anticipates outcomes and potential impacts, seeks stakeholder perspectives. Works towards actions and plans aligned with APS values. Works with others to identify areas for collaboration.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Systems Thinking: Takes a long-term view towards organization’s objectives and how to achieve them. Takes holistic long-term view of challenges and opportunities. Anticipates outcomes and potential impacts, seeks stakeholder perspectives. Works towards actions and plans aligned with APS values. Works with others to identify areas for collaboration.",
        "Creative Problem Solving: Engages the community and resources at hand to address issues. Engages perspective to seek root causes. Finds ways to improve complex systems. Employs resources from other areas to solve problems. Engages others and encourages debate and idea generation to solve problems while addressing risks.",
        "Agility: Identifies and manages required change and the associated risks. Identifies alternative approaches and supports others to do the same. Proactively explains impact of changes. Anticipates and mitigates emotions of others. Anticipates obstacles and stays focused on goals. Makes decisions and takes action in uncertain situations and creates a backup plan",
        "Drive for Results: Takes and delegates responsibility for outcomes. Uses variety of resources to monitor own performance standards. Acknowledges even indirect responsibility. Commits to what is good for Albertans even if not immediately accepted. Reaches goals consistent with APS direction.",
        "Build Collaborative Environments: Ensures all needs are heard and understood. Involves a wide group of stakeholders when working on outcomes. Involves stakeholders and shares resources. Positively resolves conflict through coaching and facilitated discussion. Uses enthusiasm to motivate and guide others. Acknowledges and works with diverse perspectives for achieving outcomes.",
        "Develop Self & Others: Plans according to career goals and regular development. Aligns personal goals with career goals. Leverages strengths: attempts stretch goals. Provides feedback and openly discusses team performance. Values team diversity and supports personal development."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "University degree in Public Administration, Business Administration, Law, Social Science or related, PLUS 4 years related experience or equivalent as described"
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": ": Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience, or 1 year of experience for 1 year of education For Example : Related 1 year certificate PLUS a minimum 7 years of experience Related 2-year diploma PLUS a minimum 6 years of experience Related minimum 8 years of experience The successful candidate MUST have: •    Demonstrated leadership experience, preferably within a regulatory compliance or enforcement capacity. •    Experience and thorough knowledge of the principles and application of administrative fairness and natural justice in administrative decision-making.",
        "rules": [
          ": Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience, or 1 year of experience for 1 year of education"
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          ":",
          "•    Knowledge of the New Home Buyer Protection Act and its regulations.",
          "•    Knowledge of adjacent legislation such as the Safety Codes Act and Insurance Ac t.",
          "•    Knowledge of the residential home building industry, insurance industry, and/or consumer protection.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "Term of Employment: Permanent Full Time",
      "location_reminder": "Location: Edmonton, Alberta – Commerce Place Building",
      "assessment_info": [],
      "security_screening": [
        "Successful candidates will be required to undergo a security screening."
      ],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in. Links and information on what the GoA have to offer to prospective employees."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.mepp.ca",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "dawn.bradbury@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Dawn Bradbury at"
    }
  },
  "scraping_metadata": {
    "job_id": "597116017",
    "scraped_at": "2025-11-09T19:19:21.147616",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}