{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Manager%2C-Issues-and-Operations/597149717/"
    },
    "header": {
      "job_title": "Manager, Issues and Operations",
      "posting_date": "Nov 5, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Manager, Issues and Operations",
      "job_requisition_id": "77160",
      "ministry": "Municipal Affairs",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 12, 2025",
      "classification": "Manager Zone 2",
      "salary": {
        "raw_text": "​$3,339.00 to $4,493.32 bi-weekly ($87,147 - $117,275/year)",
        "biweekly_min": 3339.0,
        "biweekly_max": 4493.32,
        "annual_min": 87147.0,
        "annual_max": 117275.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Municipal Affairs",
      "body": [
        "The Ministry of Municipal Affairs supports municipalities in providing well-managed, fiscally responsible, and accountable local government to Albertans. To learn more about Municipal Affairs, visit: https://www.alberta.ca/municipal-affairs.aspx."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Municipal Affairs is looking for an innovative thinker and dynamic leader to the Deputy Minister’s Office (DMO).",
      "intro_paragraphs": [
        "The Manager, Issues and Operations supports the day-to-day operations and workflow requirements within the DMO to support government decision making and meet the needs of the Minister and Deputy Minister. The successful candidate will have a strong understanding of executive office operations, department specific issues and tracking. They will work closely with departmental representatives to anticipate and identify strategically relevant issues and ensure effective management and timely response to them. The manager will use leadership skills and strong political acumen to guide collaboration within the departments and across the GoA to meet ministry priorities and achieve Minister’s mandate. They will also ensure the timely flow of information between the divisions and the DMO and ensure advice on sensitive and emerging issues is comprehensive and accurate."
      ],
      "responsibility_groups": [
        {
          "heading": "As the Manager, Issues and Operations your main responsibilities will include",
          "items": [
            "Oversee a comprehensive system to respond to Action Requests, briefing notes and ongoing issues within the ministry.",
            "Compile and analyze information to provide strategic advice, direction and recommendations.",
            "Oversee and coordinate ministry information/reports, including ministerial information requests, meeting/event recommendations, briefings, correspondence and inquiry responses.",
            "Compile department-wide reporting to support Deputy Minister and Minister in communicating issues and priorities.",
            "Lead special initiatives for the department.",
            "Take the lead on DM Access to Information requests and Protection of Information and Privacy requests.",
            "Support strategic decision-making processes for executive management.",
            "Provide support to colleagues within the office, including vacation cover off."
          ]
        },
        {
          "heading": "As the ideal candidate you are expected to",
          "items": [
            "Handle multiple priorities while remaining agile and having strong attention to detail.",
            "Exercise your critical thinking and problem-solving skills to analyze risks and come up with solutions in a dynamic environment.",
            "Develop and maintain strategic and collaborative working relationships with colleagues and key stakeholders.",
            "Facilitate communication flow across executive offices.",
            "Provide leadership in managing complex projects across cross functional teams.",
            "Navigate a fast-paced and complex environment with agility.",
            "Interpret stakeholder business needs and translate them into recommendations.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/at4mrjyj/job-description-manager-issues-and-operations-jr-77160.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Agility – In our fast-paced environment, you can anticipate, assess, readily adapt to changing priorities and work effectively with shifting priorities.Systems Thinking – You anticipate outcomes and potential impacts across inter-related areas and factors this into planning and problem solving.Creative Problem Solving – You can assess options and implications in new ways to achieve outcomes and solutions.Drive for Results – You know what outcomes are important and maximize resources to achieve results aligned with the organization's goals, while maintaining accountability to each other and external stakeholders. Build Collaborative Environments – Creates opportunities for project teams and stakeholders to share information; respects others' point-of-view, encourages or facilitates conflict resolution, recognizes performance of all groups involved."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year education"
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": "1 year of education for 1 year of experience; or 1 year of experience for 1 year education",
        "rules": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year education"
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Previous experience working in an executive office.",
          "Project management and/or strategic planning skills and ability to handle multiple priorities with tight timelines.",
          "Strong technical skills in Microsoft Office suite, including SharePoint Online, Excel, ARTS.",
          "Experience with researching, composing, tracking and editing briefing notes and other correspondence.",
          "Experience managing large volumes of complex information and providing recommendations.",
          "Knowledge of government legislation and policies.",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "Final candidates will be required to undergo a security screening. All costs associated with the recruitment process including documentation fees and travel expenses are the candidate’s responsibility. If documentation is requested from an applicant, out-of-province applicants can obtain the documents requested from the province they reside in."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.mepp.ca",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "PSC.FTA@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597149717",
    "scraped_at": "2025-11-09T19:18:16.891941",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}