{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Senior-Business-Analyst/596918117/"
    },
    "header": {
      "job_title": "Senior Business Analyst",
      "posting_date": "Oct 28, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Senior Business Aanlyst",
      "job_requisition_id": "76872",
      "ministry": "Service Alberta and Red Tape Reduction",
      "location": "Edmonton",
      "full_or_part_time": "Full-time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open",
      "closing_date": "November 11, 2025",
      "classification": "Program Services 4",
      "salary": {
        "raw_text": "​$3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)",
        "biweekly_min": 3056.5,
        "biweekly_max": 4006.62,
        "annual_min": 79774.0,
        "annual_max": 104572.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Senior Business Aanlyst Job Requisition ID: 76872Ministry: Service Alberta and Red Tape ReductionLocation: EdmontonFull or Part-Time: Full-timeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: OpenClosing Date: November 11, 2025Classification: Program Services 4Salary: ​$3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.Service Alberta and Red Tape Reduction is a solutions provider. We strive to deliver innovative services to government operations and optimize programs and services for Albertans. Every Service Albertan strives to enable the success of our Ministry partners and Albertans through providing exceptional client focused services that meet and exceed our clients' expectations. We are looking for collaborative, agile, solutions focused individuals with strong communication skills and a strong service orientation. If that describes you, please read on! To learn more about us, please visit: https://www.alberta.ca/service-alberta.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": null,
      "body": [
        "diversity-inclusion-policy.aspx.Service Alberta and Red Tape Reduction is a solutions provider. We strive to deliver innovative services to government operations and optimize programs and services for Albertans. Every Service Albertan strives to enable the success of our Ministry partners and Albertans through providing exceptional client focused services that meet and exceed our clients' expectations. We are looking for collaborative, agile, solutions focused individuals with strong communication skills and a strong service orientation. If that describes you, please read on! To learn more about us, please visit: https://www.alberta.ca/service-alberta."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Your strong skills in the following will help you succeed in this role:",
      "intro_paragraphs": [],
      "responsibility_groups": [
        {
          "heading": "Alberta is the only jurisdiction in North America where public registry services are completely offered through a network of individually owned private agencies. There are more than 210 registry agent locations where Albertans can access registry services. These registry agent locations vary significantly in size, transactional volumes, and number of employees. Registry services include Motor Vehicles, Vital Statistics, Corporate Registration, Land Titles, Personal Property Registrations and Alberta Health Care Insurance Plan and Alberta Organ and Tissue Donor Registry registrations and services. They are committed in providing consistent, high-quality service to Albertans while ensuring personal information is safeguarded through a private registry delivery system is unique and complex.In this position as a Senior Business Analyst, you will be responsible for the definition and validation of business requirements, project planning and coordination, change management, researching and supporting process, policy, and client service delivery improvements. You will complete this through the proactive development of business processes and resolution of policy issues, data definition and standardization, including alignment with GoA privacy and security standards, and stakeholder communication.Reporting to the Manager, Programs and Project Support, you will have two areas of focus",
          "items": [
            "Business process re-engineering and new complex processes development.",
            "Project management or coordination.",
            "Consultation, interpersonal, and facilitation skills to assist in consulting, negotiating, and resolving conflict with stakeholders often having varying perspectives, expectations, requirements, and priorities.",
            "Policy building experience in relation to government's legislative and policy development processes.",
            "Financial planning, management, and reporting.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/ocnlgq5z/jr76872_senior-business-analyst_ps4_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Systems Thinking: You consistently take a holistic and long-term view of challenges and opportunities at multiple levels across related areas.",
        "Drive for Results: You set and accomplish goals and priorities in order to deliver outcomes consistent with Government direction, departmental objectives and public expectations.",
        "Develop Networks: You consider how changes might impact colleagues, clients and stakeholders, and actively seek their input and/or involvement regarding those changes.",
        "Agility: You identify alternative approaches or courses of action in unclear and complex situations. You support others to identify, assess, and use alternative approaches.",
        "Build Collaborative Environments: You promote collaboration and positive relationships (even in challenging circumstances) within and across groups and build commitment to reach desired results."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [
          "Please outline how your experience relates to the qualifications in detail in your cover letter.  Cover letters will be assessed for conciseness, accuracy, and grammar as part of the screening process. Applications without a cover letter, will not be considered.",
          "Please outline how your experience relates to the qualifications in detail in your cover letter. Cover letters will be assessed for conciseness, accuracy, and grammar as part of the screening process. Applications without a cover letter, will not be considered."
        ],
        "other": []
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Project management experience.",
          "Strategic portfolio management experience.",
          "Financial planning, management, and reporting experience.",
          "Registries administration legislation, regulations, business processes, procedures, and training experience.",
          "Government and Ministry programs, policies, and business functions experience in order to fully comprehend business requirements and underlying legislation and policy links.",
          "Outcome modelling and strategic planning methodologies experience.",
          "Candidates with lesser qualifications may be considered at a lower classification and salary.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "Hours of work: Monday – Friday, 8:15 a.m. - 4:30 p.m. (36.25 hours/week).Positions currently available: One (1) permanent position.Location: John E. Brownlee Building, 10365 – 97 Street N.W. Edmonton, Alberta T5J 3W7.Final candidates will be required to undergo a security screening.Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "www.mepp.ca",
          "url": "https://www.mepp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "liliane.karara@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "596918117",
    "scraped_at": "2025-11-09T19:16:54.010227",
    "matched_keyword": "Business Analyst",
    "match_score": 94
  }
}