{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Risk-Management-Advisor/597241817/"
    },
    "header": {
      "job_title": "Risk Management Advisor",
      "posting_date": "Nov 7, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Risk Management Advisor",
      "job_requisition_id": "74322",
      "ministry": "Environment and Protected Areas",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 24, 2025",
      "classification": "Program Services 4",
      "salary": {
        "raw_text": "​$3,056.5 to $4,006.62 bi-weekly ($79,774 - $104,572/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": 79774.0,
        "annual_max": 104572.0,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Risk Management Advisor Job Requisition ID: 74322Ministry: Environment and Protected AreasLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: PermanentScope: Open CompetitionClosing Date: November 24, 2025Classification: Program Services 4 Salary: ​$3,056.5 to $4,006.62 bi-weekly ($79,774 - $104,572/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.For more information about the Ministry of Environment and Protected Areas, please visit our website at: https://www.alberta.ca/environment-and-protected-areas.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": null,
      "body": [
        "diversity-inclusion-policy.aspx.For more information about the Ministry of Environment and Protected Areas, please visit our website at: https://www.alberta.ca/environment-and-protected-areas."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Please click on this link to view the job description for this position.",
      "intro_paragraphs": [
        "Environment and Protected Areas’ (EPA) conservation mandate is to develop shared stewardship of the province's environment and natural resources for Albertans. The Risk Management Advisor, within the Corporate Planning and Governance Branch, is responsible for leading the design, implementation and continuous improvement of the Enterprise Risk Management (ERM) Framework for the ministry of EPA including a Risk Registry. The Risk Management Advisor (Advisor) works to ensure the department’s ERM Framework is aligned with GoA requirements, including ISO 31000 standards, and more specific natural resource risk management approaches.Through the EPA ERM Framework, the Advisor leads and coordinates an annual formalized risk management process. The process aligns with strategic and business planning and reporting cycles, including the identification, assessment, and management of key strategic risks that prevent the Ministry from achieving GoA and EPA outcomes, priorities, legislated requirements, and operational programs or activities. The Advisor guides risk teams -comprised of executive leadership and staff - through each component of the annual process, including risk assessments, control assessments, and designing and implementing a risk treatment plan to reduce EPA's risk exposure."
      ],
      "responsibility_groups": [
        {
          "heading": "The Advisor is responsible for maintaining an enterprise risk registry and process documentation to support transparent reporting of EPA’s enterprise risk management. This includes working with risk teams to ensure executive leads (risk owners) are informed and engaged in the process. It also includes reporting to the Executive Team at least twice yearly in alignment with the ERM Framework.The Advisor is responsible for informing and educating risk teams, department leadership and staff on best practices and internal procedures for risk management and fostering a culture of risk management across the organization. This includes promoting risk-based strategies and decision processes at all levels of the organization. This also includes communicating and raising awareness about the theory and practice of enterprise risk management, and about the specific risks facing the department, including known and emerging risks, and EPA’s successes and challenges in reducing risk exposure through implementation of risk management plans.The Advisor works closely with Planning and Performance colleagues in delivering department e-scanning and foresight processes and utilizes this intelligence to support enterprise risk management processes.Other responsibilities may include",
          "items": [
            "Helps to advance strategic awareness across EPA by identifying opportunities to integrate the processes and insights from risk management into strategic planning, business planning, and operational planning and reporting.",
            "Participates in the development, implementation, and continuous improvement of operational planning and reporting, and other relevant corporate reporting functions.",
            "Represents and potentially leads cross ministry enterprise risk and policy teams for shared risks and common risk management.",
            "When requested, provide the Office of the Auditor General with information about EPA’s ERM process and documentation."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/2jionukf/jr74322_ps4ma_risk_mgmt_adv_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.How Competencies will apply to this role:",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Systems Thinking: Delivers work with awareness of the broader integrated and inter-related context EPA is situated within, and applies a proactive, future-focused lens to EPA’s risk management within this context to support awareness of opportunities and threats.",
        "Build Collaborative Environments: Leads and contributes to working environments that is collaborative and productive, fostering creative problem solving, effective conflict resolution, and innovative solutions.",
        "Develop Networks: Develops and maintains positive relationships with leadership and colleagues within EPA, other Ministries and partners through trust and integrity.",
        "Drive for Results: Delivers timely projects, despite complexities, that meet expectations, maximize resource effectiveness, and are strategically aligned with organizational outcomes and priorities.",
        "Agility: Anticipates, assesses, and readily adapts to changing environment and priorities, and manages with resilience in times of uncertainty."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "A university degree in public policy, business administration, or a closely related natural resource management field.",
          "A Minimum Four (4) years of directly related experience in Enterprise Risk Management and progressively responsible experience in policy development and planning, and project management. Equivalent combinations of education and experience as described below may also be considered ."
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": "Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience, or 1 year of experience for 1 year of education.",
        "rules": [
          "1 year of education for 1 year of experience, or",
          "1 year of experience for 1 year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Demonstrated expertise in integrated and enterprise risk management, including familiarity with frameworks such as ISO 31000, risk assessment techniques, and tools like Bowtie XP. Awareness of emerging trends and best practices in the field is an asset.",
          "Understanding of how enterprise risk management contributes to and aligns with strategic policy, planning, and decision-making processes in large, complex organizations, including government settings.",
          "Strong project management abilities, including planning, organizing, and delivering large-scale projects with multiple workstreams and diverse stakeholders, while achieving results under challenging conditions.",
          "Advanced facilitation skills to support collaborative discussions on strategic and technical topics, along with the ability to mentor others in developing facilitation capabilities.",
          "Strong interpersonal skills to build and maintain relationships, encourage collaboration, support creative problem-solving, and foster consensus among teams with varied perspectives.",
          "Well-developed analytical skills to assess complex issues, identify risks and opportunities, and recommend effective solutions and actions.",
          "Proficient written and verbal communication skills, with the ability to convey relevant information and insights clearly to a range of audiences, including executives, operational managers, and subject matter experts.",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "This position is a full-time permanent opportunity located in Edmonton. Alternate work locations within the province will not be considered.This position works Monday to Friday, 8:15 AM-4:30 PM, 36.25 hours a week.In your application, please include a cover page detailing your interest, and role related experience.For Employment Experience:",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in.What the GoA has to offer to prospective employees:"
      ],
      "benefits_and_resources_links": [
        {
          "label": "https://www.alberta.ca/advantages-",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "https://www.pspp.ca",
          "url": "https://www.pspp.ca/"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Jane.Mcewen@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597241817",
    "scraped_at": "2025-11-09T19:17:51.524832",
    "matched_keyword": "Business Analyst",
    "match_score": 86
  }
}