{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Senior-Policy-Advisor/597246917/"
    },
    "header": {
      "job_title": "Senior Policy Advisor",
      "posting_date": "Nov 8, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Senior Policy Advisor",
      "job_requisition_id": "77245",
      "ministry": "Jobs, Economy, Trade and Immigration",
      "location": "Edmonton",
      "full_or_part_time": "Fulltime",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Temporary",
      "scope": "Open Competition",
      "closing_date": "November 20, 2025",
      "classification": "Program Services 4",
      "salary": {
        "raw_text": "$3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)",
        "biweekly_min": 3056.5,
        "biweekly_max": 4006.62,
        "annual_min": 79774.0,
        "annual_max": 104572.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job Title: Senior Policy AdvisorJob Requisition ID: 77245Ministry: Jobs, Economy, Trade and ImmigrationLocation: EdmontonFull or Part-Time: FulltimeHours of Work: 36.25 hours per weekPermanent/Temporary: Temporary Scope: Open CompetitionClosing Date: November 20, 2025Classification: Program Services 4Salary: $3,056.50 to $4,006.62 bi-weekly ($79,774 - $104,572/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.The Ministry of Jobs, Economy, Trade and Immigration leads the efforts to grow Alberta's economy by delivering strategic programs and services to support Alberta's entrepreneurs and job creators, attract investment, grow trade, strengthen Alberta's tourism industry and ensure Alberta has an innovative and competitive business environment. To learn more about the Ministry, please click here: https://www.alberta.ca/jobs-economy-trade-and-immigration.Economic Strategy and Investment Division",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Jobs",
      "body": [
        "diversity-inclusion-policy.aspx.The Ministry of Jobs, Economy, Trade and Immigration leads the efforts to grow Alberta's economy by delivering strategic programs and services to support Alberta's entrepreneurs and job creators, attract investment, grow trade, strengthen Alberta's tourism industry and ensure Alberta has an innovative and competitive business environment. To learn more about the Ministry, please click here: https://www.alberta.ca/jobs-economy-trade-and-immigration.Economic Strategy and Investment Division The Economic Strategy and Investment Division is focused on ensuring strategies and related policies are developed with a broad economic lens and line of sight to economic growth and job creation. The division leverages stakeholder intelligence, robust economic principles and advanced data analytics to formulate effective strategies that support job creating investments in Alberta. Economic Policy and Investment Competitiveness Branch The Economic Policy and Investment Competitiveness Branch supports industry growth by developing economic policy, identifying industrial opportunities and working with stakeholders to develop and implement initiatives that further broad-based industry competitiveness and diversification. Industry Competitiveness and Policy Unit The Industry Competitiveness and Policy Unit contributes to the development of a competitive economic environment to support industry growth and diversification. This includes developing policies, strategies and initiatives focused on supporting and growing Alberta's primary, enabling and nascent industries in order to create jobs, attract investment, grow markets, and diversify the economy."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Please click on this link to view the job description for this position.",
      "intro_paragraphs": [],
      "responsibility_groups": [],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/4zaoxst5/jr77245_senior-policy-advisor_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Drive for Results - The Senior Policy Advisor is expected to achieve goals by planning the approach, executing the plan, and collaborating with the relevant colleagues and stakeholders to achieve results.Creative Problem Solving - When faced with challenging projects, the Senior Policy Advisor is expected to explore alternative approaches and develop innovative methods to analyze problems. This will require fast learning and collaboration with others to fully understand and approach multifaceted issues.Agility - Position often works in the grey and situations and obstacles encountered are often nebulous without a clear path to resolution. Direction can often change quickly, so need to adeptly adapt and repurpose.Build Collaborative Environment - Position communicates Branch interests and seeks inputs from other departments/divisions/branches and relevant stakeholders to ensure understanding of the required analysis. Continues to communicate with them until the completion of the project and/or as part of ongoing working relationship development.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.Drive for Results - The Senior Policy Advisor is expected to achieve goals by planning the approach, executing the plan, and collaborating with the relevant colleagues and stakeholders to achieve results.Creative Problem Solving - When faced with challenging projects, the Senior Policy Advisor is expected to explore alternative approaches and develop innovative methods to analyze problems. This will require fast learning and collaboration with others to fully understand and approach multifaceted issues.Agility - Position often works in the grey and situations and obstacles encountered are often nebulous without a clear path to resolution. Direction can often change quickly, so need to adeptly adapt and repurpose.Build Collaborative Environment - Position communicates Branch interests and seeks inputs from other departments/divisions/branches and relevant stakeholders to ensure understanding of the required analysis. Continues to communicate with them until the completion of the project and/or as part of ongoing working relationship development."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": "Directly related education or experience is considered on the basis of one year of education for one year of experience; or one year of experience for one year of education. Knowledge and/or experience of the following are considered assets for this position: Extensive experience working with and supporting strategic planning and policy development, including issue identification, policy analysis and policy design. Extensive experience preparing and providing options analysis, reports, briefings, and presentations. Well-developed research, analytical, and problem-solving skills to interpret key economic and industry information (quantitative and qualitative), with a knowledge of reliable data sources for economic research. Strong understanding of Alberta’s economy and key issues faced by Alberta's industries and their competitiveness. Knowledge of provincial, municipal and federal legislation, policies, and public/non-profit programs/supports related to economic, industry and business development. Strong written and verbal communications skills. Experience writing reports and/or executive briefing notes on complex issues. Project management and time management skills. Ability to function well in a team-based environment that demands a high level of interpersonal skills. Ability to complete tasks independently. Critical thinking and analysis. Ability to identify and process large quantities of information, often coming from multiple sources, usually in a rapidly changing environment, and understand its implications. Refer to https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards .",
        "rules": [
          "Directly related education or experience is considered on the basis of one year of education for one year of experience; or one year of experience for one year of education."
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Extensive experience working with and supporting strategic planning and policy development, including issue identification, policy analysis and policy design.",
          "Extensive experience preparing and providing options analysis, reports, briefings, and presentations.",
          "Well-developed research, analytical, and problem-solving skills to interpret key economic and industry information (quantitative and qualitative), with a knowledge of reliable data sources for economic research.",
          "Strong understanding of Alberta’s economy and key issues faced by Alberta's industries and their competitiveness.",
          "Knowledge of provincial, municipal and federal legislation, policies, and public/non-profit programs/supports related to economic, industry and business development.",
          "Strong written and verbal communications skills. Experience writing reports and/or executive briefing notes on complex issues.",
          "Project management and time management skills.",
          "Ability to function well in a team-based environment that demands a high level of interpersonal skills.",
          "Ability to complete tasks independently.",
          "Critical thinking and analysis.",
          "Ability to identify and process large quantities of information, often coming from multiple sources, usually in a rapidly changing environment, and understand its implications."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [
        "There is one temporary, full-time position working 36.25 hours per week, Monday to Friday.This position is based in Edmonton.Candidates are required to submit a resume and cover letter that succinctly demonstrate their qualifications against the job requirements, including education, experience, and relevant competencies. It's important for applicants to ensure their resume and cover letter clearly articulate how their past work experiences align with the role's qualifications and needs. Resumes must include precise employment dates (month and year) details.The final candidates for this position will be asked to undergo an academic check, references, provide a suitable security screening and may be asked to complete a written exercise and/or assessment.Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in. Links and information on what the GoA have to offer to prospective employees."
      ],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Sam.Thomasmathew@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "597246917",
    "scraped_at": "2025-11-09T19:17:35.663592",
    "matched_keyword": "Business Analyst",
    "match_score": 100
  }
}