{
  "job_posting": {
    "search_keyword": "Business Consultant",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Manager%2C-Home-and-Community-Care-Compliance-%28North%29/596931517/"
    },
    "header": {
      "job_title": "Manager, Home and Community Care Compliance (North)",
      "posting_date": "Oct 28, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Manager, Home and Community Care Compliance (North)",
      "job_requisition_id": "76013",
      "ministry": "Assisted Living and Social Services",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 11, 2025",
      "classification": "Manager Zone 2",
      "salary": {
        "raw_text": "​​$3,339.00 to $4,493.32 bi-weekly ($87,147 - $117,275/year)",
        "biweekly_min": 3339.0,
        "biweekly_max": 4493.32,
        "annual_min": 87147.0,
        "annual_max": 117275.0,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Manager, Home and Community Care Compliance (North) Job Requisition ID: 76013Ministry: Assisted Living and Social ServicesLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: Permanent Scope: Open CompetitionClosing Date: November 11, 2025Classification: Manager Zone 2 Salary: ​​$3,339.00 to $4,493.32 bi-weekly ($87,147 - $117,275/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.The Ministry of Assisted Living and Social Services leads housing, assisted living and continuing care, seniors, income, employment and homelessness supports, disability services, and other social-based programs. For more information about SCSS, visit our website: https://www.alberta.ca/assisted-living-and-social-services.The Continuing Care Branch is responsible for the development and implementation of provincial policy and regulations for home and community care and continuing care homes. This includes working closely with Assisted Living Alberta/Alberta Health Services (AHS) in planning for continuing care service needs across the province in both the short and longer term.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "The Ministry of Assisted Living",
      "body": [
        "diversity-inclusion-policy.aspx.The Ministry of Assisted Living and Social Services leads housing, assisted living and continuing care, seniors, income, employment and homelessness supports, disability services, and other social-based programs. For more information about SCSS, visit our website: https://www.alberta.ca/assisted-living-and-social-services.The Continuing Care Branch is responsible for the development and implementation of provincial policy and regulations for home and community care and continuing care homes. This includes working closely with Assisted Living Alberta/Alberta Health Services (AHS) in planning for continuing care service needs across the province in both the short and longer term."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": null,
      "intro_paragraphs": [
        "The Compliance Manager ensures service providers meet provincial legislation and best practice standards by leading a team of Health Compliance Officers, addressing non-compliance, mitigating risks, and promoting continuous improvement.In this role, you will provide leadership to a team of Health Compliance Officers responsible for monitoring and inspecting home and community care services across Alberta. You will set clear goals, expectations, and performance standards to guide and support the team’s work.To succeed in this role, you will act as the subject matter expert on home and community care standards, legislation, and regulations. You’ll ensure these are applied accurately and consistently across all inspections and compliance activities.As Manager, Home and Community Care Compliance, you will support the development and implementation of a risk-based compliance framework to ensure adherence to legislative and regulatory standards. This includes working collaboratively with the Manager- south team creating inspection protocols, audit tools, and reporting mechanisms that are both effective and efficient.You will also build and maintain strong relationships with key stakeholders, including service providers, clients, and government partners. Represent the Home and Community Care Inspection Program in cross-ministry, cross-jurisdictional, and public initiatives, contributing to policy discussions and collaborative efforts to improve care standards provincewide.You will be responsible for developing operational policies and best practices to support consistent, effective, and compliant delivery of home and community care services across the province.In this role you identify risks to the safety and well-being of clients receiving home and community care services and support the development of strategies to mitigate them. Ensure timely response to identified risks, with corrective actions implemented and monitored for effectiveness.Please click on this link to view the job description for this position."
      ],
      "responsibility_groups": [],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/y3sekldk/jr76013_manager-home-and-community-care-compliance-north-_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process.This link will assist you with understanding competencies:https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.As the Manger Home and Community Care Compliance- North, in addition to your education and experience, you will demonstrate well-honed competencies in the following areas:",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Systems Thinking: to identify emerging issues, challenges, and opportunities, provide options for resolution and develop recommendations to prevent or mitigate legal or political risk associated with consultation initiatives.",
        "Build Collaborative Environments: Teamwork-oriented to collaborate with ministry staff to plan, implement and assess specific programs to ensure the delivery of an integrated consultation program across the province.",
        "Drive for Results: Knowing what outcomes are important and maximizing resources to achieve results that are aligned with the goals of the organization, while maintaining accountability to each other and external stakeholders.",
        "Develop Networks: Proactively develop and maintain effective partnerships with multiple stakeholders to ensure a clear understanding of diverse interests when supporting the engagement of Indigenous communities and the achievement of collaborative outcomes.",
        "Agility: Anticipate and adapt by focusing on long-term goals, changing the way we approach situations, using new ideas and solutions to achieve results."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "Related university degree and 4 years related experience.",
          "Related Diploma and 6 years related experience.",
          "Related certificate and 7 years related experience."
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": "Directly related education or experience considered based on: Related university degree and 4 years related experience. Related Diploma and 6 years related experience. Related certificate and 7 years related experience.",
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Experience in healthcare or home and community care services.",
          "Registration with a health regulatory college in Alberta mandatory.",
          "Experience in data analysis and quality assurance.",
          "Experience in managing complex projects, particularly in a regulatory or compliance context.",
          "Demonstrated success in building and maintaining strong relationships with stakeholders.",
          "Experience in developing and delivering training programs or workshops related to compliance, regulatory standards, or quality assurance.",
          "Strong written and verbal communication skills, with the ability to engage with a wide range of stakeholders, including service providers, clients, and government entities.",
          "Experience leading and managing teams, including mentoring and coaching an asset.",
          "Refer to",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "Hours of work are 36.25 weekly, Monday to Friday.This competition will be used to fill a permanent position in Edmonton. The position is full-time.Please include a cover letter that clearly outlines your suitability for the role and highlights how your experience aligns with the position's requirements.Final candidates will be required to undergo a security screening. A Criminal Record Check will only need to be provided upon request. Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in.Candidates must be eligible to work in Canada. Links and information on what the GoA have to offer to prospective employees.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "https://www.mepp.ca",
          "url": "https://www.mepp.ca/"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "https://researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca/"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "Milissa.Gray@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact"
    }
  },
  "scraping_metadata": {
    "job_id": "596931517",
    "scraped_at": "2025-11-09T19:20:50.135031",
    "matched_keyword": "Business Consultant",
    "match_score": 100
  }
}