{
  "job_posting": {
    "search_keyword": "Business Consultant",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton%2C-Calgary-Project-Coordinator/587880317/"
    },
    "header": {
      "job_title": "Project Coordinator",
      "posting_date": "Nov 7, 2025",
      "location_line": "Edmonton, Calgary, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Project Coordinator",
      "job_requisition_id": "65909",
      "ministry": "Infrastructure",
      "location": "Calgary and Edmonton",
      "full_or_part_time": "Full-Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Temporary and Permanent",
      "scope": "Open Competition",
      "closing_date": "Open Until Suitable Candidate is Found",
      "classification": "Technologies 6",
      "salary": {
        "raw_text": "$2,694.27 to $3,537.86 bi-weekly $70,320 - $92,338/year.",
        "biweekly_min": 2694.27,
        "biweekly_max": 3537.86,
        "annual_min": null,
        "annual_max": null,
        "currency": "CAD",
        "primary_frequency": "bi-weekly"
      }
    },
    "diversity_and_inclusion": {
      "statement": "The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Infrastructure",
      "body": [
        "Alberta Infrastructure is responsible for leading the development of the provincial Capital Plan, which addresses the provincial infrastructure needs of Alberta’s population that support key social programs and services and economic development.",
        "The Ministry designs, builds, manages, and maintains government-owned and operated facilities, and collaborates with other ministries to ensure that school and hospital infrastructure meet the needs of Alberta’s population. Infrastructure provides accommodation services and manages a large portfolio of owned and leased facilities while maintaining fiscal accountability and optimizing value for Albertans.",
        "For more information about Alberta Infrastructure, please visit: http://www.infrastructure.alberta.ca."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "The successful candidate will have:",
      "intro_paragraphs": [],
      "responsibility_groups": [
        {
          "heading": "Reporting to the Project Manager, the Project Coordinator will work closely with client representatives from Alberta Education as well as the school divisions throughout all aspects of the development and implementation of learning facility capital projects and will be critical to the planning, design, construction, building commissioning, and warranty period for each approval capital project. The Project Coordinator position is key in determining which risks are likely to affect project scope, cost and/or schedule and evaluating the likelihood of such risk, including the development of mitigation strategies to ensure that all are managed in alignment with project requirements. Project Coordinators are a key member of the infrastructure’s project teams and directly support the delivery of capital projects which are considered to be a government platform priority. The primary responsibilities for the Project Coordinator include, but are not limited to",
          "items": [
            "Coordinating reviews and submittals to in-house resources, bridging consultants, independent advisors, cities and municipalities, and external stakeholders.",
            "Establishing and maintaining a complex document management system for the project team, both manually and electronically within SharePoint.",
            "Providing reports and briefings to the Senior Project Manager to update project status, provide cash flow updates and cost information.",
            "Performing frequent inspections of work area and site documentation to ensure all policies and procedures are being followed and all work is carried out as per quality time and safety regulations/specifications.",
            "Ensuring as-builts and Operational and Maintenance manuals received from consultants are recorded and entered into project management tracking system.",
            "Supporting all aspects of furniture/equipment moves including the coordination of contractors and school board owners, if required by the Project Director or Project Manager.",
            "Considerable interpersonal skills for clear communication with school jurisdictions, client ministries, consultants, and contractors within a team concept.",
            "Leadership and negotiation skills.",
            "Please click on this link for a copy of the Job Description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/dcalru0w/jr-65909_technologies-6_project-coordinator_jd.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Creative Problem Solving – Focuses on continuous improvement and increasing breadth of insight",
        "Systems Thinking – Takes a long-term view towards organization’s objectives and how to achieve them",
        "Agility – Works in a changing environment and takes initiative to change",
        "Develop Networks – Leverages relationships to build input and perspective",
        "Build Collaborative Environments – Facilitates open communication and leverages team skill"
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "Two-year diploma in Engineering or related discipline PLUS 6 years of related experience"
        ],
        "experience": [],
        "other": []
      },
      "equivalency": {
        "text": "Directly related education or experience considered on the basis of: 1 year of education for 1 year of experience; or 1 year of experience for 1 year of education",
        "rules": [
          "1 year of education for 1 year of experience; or",
          "1 year of experience for 1 year of education"
        ]
      },
      "assets": {
        "heading": "Assets",
        "items": [
          "Certified Engineering Technologist (C.E.T) designation",
          "Knowledge of Public-Private Partnerships (P3) procurement in Alberta",
          "Knowledge of",
          "School Capital Manual and Education Act",
          "Knowledge of Disposition of Property Regulation",
          "Knowledge of the Closure of Schools Regulation and Charter Schools Regulation",
          "Knowledge of Contract Review Committee Mandate and Guidelines for the Acceptance of Bids",
          "Knowledge of bidding and construction legislation and practices",
          "Familiarity with the",
          "Municipal Government Act",
          "Familiarity with program requirements for learning facilities",
          "Knowledge of School Capital Manual and Education Act",
          "Familiarity with the Municipal Government Act"
        ]
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": "Location: Calgary and EdmontonTerm of Employment: Multiple positions, Temporary and Permanent Pre-Employment Checks will be completed to assess the candidate’s suitability for a role. These checks may include (but are not limited to): references, criminal record check, academic verification, etc.",
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [
        "Any costs associated with obtaining the required documents/checks as noted or interview travel expenses, will be the responsibility of the candidate. Out-of-province applicants can obtain the required documents/checks from the province they currently reside in."
      ],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "www.pspp.ca",
          "url": "https://www.pspp.ca"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "researchapscareers.alberta.ca",
          "url": "https://researchapscareers.alberta.ca"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information (",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "donna.m.lee@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Donna M. Lee at"
    }
  },
  "scraping_metadata": {
    "job_id": "587880317",
    "scraped_at": "2025-11-09T19:20:34.190464",
    "matched_keyword": "Business Consultant",
    "match_score": 100
  }
}