{
  "job_posting": {
    "search_keyword": "Business Analyst",
    "source": {
      "jurisdiction": "Alberta",
      "job_board": "Alberta Public Service Careers",
      "company": "Government of Alberta",
      "url": "https://jobpostings.alberta.ca/job/Edmonton-Program-Reporting-Analyst/597190817/"
    },
    "header": {
      "job_title": "Program Reporting Analyst",
      "posting_date": "Nov 6, 2025",
      "location_line": "Edmonton, AB",
      "company_line": "Government of Alberta"
    },
    "job_information": {
      "job_title": "Program Reporting Analyst",
      "job_requisition_id": "76862",
      "ministry": "Transportation and Economic Corridors",
      "location": "Edmonton",
      "full_or_part_time": "Full Time",
      "hours_of_work": "36.25 hours per week",
      "permanent_or_temporary": "Permanent",
      "scope": "Open Competition",
      "closing_date": "November 13, 2025",
      "classification": "Program Services 2",
      "salary": {
        "raw_text": "$2,487.97 - $3,263.63 bi-weekly ($64,936 - $85,181/year)",
        "biweekly_min": null,
        "biweekly_max": null,
        "annual_min": 64936.0,
        "annual_max": 85181.0,
        "currency": "CAD",
        "primary_frequency": null
      }
    },
    "diversity_and_inclusion": {
      "statement": "Job InformationJob Title: Program Reporting Analyst Job Requisition ID: 76862Ministry: Transportation and Economic CorridorsLocation: EdmontonFull or Part-Time: Full TimeHours of Work: 36.25 hours per weekPermanent/Temporary: Permanent Scope: Open Competition Closing Date: November 13, 2025Classification: Program Services 2Salary: $2,487.97 - $3,263.63 bi-weekly ($64,936 - $85,181/year)The Government of Alberta is committed to a diverse and inclusive public service that reflects the population we serve to best meet the needs of Albertans. Consider joining a team where diversity, inclusion and innovation are valued and supported. For more information on diversity and inclusion, please visit: https://www.alberta.ca/diversity-inclusion-policy.aspx.",
      "policy_url": "https://www.alberta.ca/diversity-inclusion-policy.aspx"
    },
    "ministry_overview": {
      "heading": "Alberta Transportation",
      "body": [
        "diversity-inclusion-policy.aspx. Alberta Transportation and Economic Corridors (TEC) serves as a North American leader in transportation systems, contributing to Alberta’s prosperity through safe, innovative, and sustainable infrastructure. TEC offers a rewarding environment with growth opportunities, work-life balance, and the chance to make an impact on Alberta’s transportation network. For more information, visit https://www.alberta.ca/transportation-and-economic-corridors."
      ]
    },
    "role_responsibilities": {
      "heading": "Role Responsibilities",
      "tagline": "Your key responsibilities include:",
      "intro_paragraphs": [
        "Are you passionate about using data, financial insight, and strategic thinking to shape infrastructure programs that directly impact Albertans? As a Program Reporting Analyst within the Capital Planning and Program Management Branch, you’ll play a pivotal role in supporting Alberta’s transportation network and disaster recovery efforts. This is your opportunity to contribute to high-impact initiatives that enhance mobility, economic resilience, and public safety across the province.",
        "As a Program Reporting Analyst, you will lead the financial tracking, analysis, and reporting of capital expenditures across TEC, with a specialized focus on the Disaster Recovery Program (DRP). You’ll work independently and collaboratively to ensure program integrity, compliance, and strategic alignment with provincial goals. Your expertise will support executive decision-making, stakeholder engagement, and the development of performance measures that reflect the value and effectiveness of TEC’s construction and maintenance programs."
      ],
      "responsibility_groups": [
        {
          "heading": "Responsibilities",
          "items": [
            "Analyzing data, forecasts, and program performance to inform strategic decisions and funding allocations.",
            "Coordinating the delivery of the Disaster Recovery Program, ensuring compliance, accuracy, and timely reporting across multiple systems.",
            "Preparing financial reports, forecasts, and reconciliation documents for internal and external stakeholders, including quarterly DRP submissions.",
            "Developing cost estimates, statistical models, and performance indicators to support program planning and evaluation.",
            "Liaising with regional teams, ministry partners, and external stakeholders to ensure effective program delivery and information sharing.",
            "Supporting the development of capital plans, ministerial briefings, and annual reports through data analysis and programming expertise.",
            "Managing program-related databases and tools (e.g., Program Management Application, 1GX, Contract Management System) to ensure data integrity and accessibility.",
            "Contributing to cross-functional initiatives and acting as a resource or lead within the programming team when required.",
            "This position may require occasional travel throughout Alberta.",
            "Please click on this link to view the job description for this position."
          ]
        }
      ],
      "job_description_link_text": "link",
      "job_description_url": "https://mydocs.wfd.alberta.ca/media/notpuxrt/jr76862-program-reporting-analyst-job-description.pdf"
    },
    "aps_competencies": {
      "heading": "APS Competencies",
      "description": "Competencies are behaviors that are essential to reach our goals in serving Albertans. We encourage you to have an in depth understanding of the competencies that are required for this opportunity and to be prepared to demonstrate them during the recruitment process. This link will assist you with understanding competencies: https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf.",
      "competencies_url": "https://www.alberta.ca/system/files/custom_downloaded_images/psc-alberta-public-service-competency-model.pdf",
      "items": [
        "Build Collaborative Environments: Fosters strong relationships with regional teams, financial services, and ministry partners to ensure seamless program delivery and accurate reporting.",
        "Drive for Results: Proactively identifies opportunities for improvement, anticipates budget pressures, and delivers high-quality outputs that enhance TEC’s operational effectiveness.",
        "Agility: Adapts to shifting priorities and evolving program needs with creativity and resilience, ensuring continued alignment with departmental goals.",
        "Creative Problem Solving: Applies analytical thinking and stakeholder insight to resolve complex programming challenges and support informed decision-making."
      ]
    },
    "qualifications": {
      "heading": "Qualifications",
      "required": {
        "education": [
          "A related university degree (e.g., Civil Engineering, Business Administration, Economics, etc.).",
          "A related two-year diploma and a minimum of two (2) years of related experience; a related one-year certificate and a minimum of three (3) years of related experience; or a minimum of four (4) years of related experience in lieu of formal education."
        ],
        "experience": [
          "Demonstrated experience in transportation infrastructure programming, financial analysis, and project management."
        ],
        "other": [
          "Preferred:",
          "Valid Alberta Class 5 driver’s licence or equivalent, and ability to travel within Alberta.",
          "Strong understanding of government financial frameworks, policies, and reporting standards.",
          "Proficiency in Excel, Word, PowerPoint, SharePoint, Outlook, and data tools such as Power BI or Toad.",
          "Knowledge of auditing and accounting principles.",
          "Familiarity with relational databases and data reconciliation across multiple systems.",
          "Equivalencies are:",
          "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards",
          "."
        ]
      },
      "equivalency": {
        "text": null,
        "rules": []
      },
      "assets": {
        "heading": "Assets",
        "items": []
      },
      "minimum_recruitment_standards_url": "https://www.alberta.ca/alberta-public-service-minimum-recruitment-standards"
    },
    "notes": {
      "heading": "Notes",
      "employment_term": null,
      "location_reminder": null,
      "assessment_info": [],
      "security_screening": [],
      "reuse_competition_note": [],
      "costs_note": [],
      "benefits_and_resources_links": [
        {
          "label": "advantages-working-for-alberta-public-service.aspx",
          "url": "https://www.alberta.ca/advantages-working-for-alberta-public-service.aspx"
        },
        {
          "label": "https://www.pspp.ca",
          "url": "https://www.pspp.ca/"
        },
        {
          "label": "alberta-public-service-benefits",
          "url": "https://www.alberta.ca/alberta-public-service-benefits"
        },
        {
          "label": "professional-development-support-directive",
          "url": "https://www.alberta.ca/professional-development-support-directive"
        },
        {
          "label": "https://researchapscareers.alberta.ca.",
          "url": "https://researchapscareers.alberta.ca/"
        }
      ]
    },
    "how_to_apply": {
      "heading": "How To Apply",
      "instructions": [
        "Applicants are advised to provide information that clearly and concisely demonstrates how their qualifications meet the advertised requirements, including education, experience, and relevant examples of required competencies.",
        "Candidates are required to apply for a job online. Please visit",
        "for more information. Please visit",
        "Recruitment Principles",
        ", for more information.",
        "It is recommended applicants who have completed post-secondary studies from outside of Canada obtain an evaluation of their credentials from the International Qualifications Assessment Service (IQAS)(",
        ") or from a recognized Canadian Credential Evaluator; please visit the Alliance of Credential Evaluation Services of Canada for more information",
        "(",
        ").",
        "It is recommended that applicants include the assessment certificate from IQAS or any other educational assessment service as part of their application."
      ],
      "job_application_resources_url": "https://www.alberta.ca/job-application-resources#before",
      "recruitment_principles_url": "https://www.alberta.ca/recruitment-principles",
      "iqas_recommendation": {
        "recommended": true,
        "iqas_url": "https://www.alberta.ca/international-qualifications-assessment.aspx",
        "alliance_url": "https://canalliance.org/en/default.html"
      }
    },
    "closing_statement": {
      "reuse_competition_note": "This competition may be used to fill future vacancies, across the Government of Alberta, at the same or lower classification level.",
      "thanks_and_screening_note": "We thank all applicants for their interest. All applications will be reviewed to determine which candidates' qualifications most closely match the advertised requirements. Only individuals selected for interviews will be contacted.",
      "contact": {
        "name": null,
        "email": "tomasz.gruszka@gov.ab.ca"
      },
      "accommodation_note": "If you require any further information on this job posting or require an accommodation during the recruitment process, please contact Tomasz Gruszka"
    }
  },
  "scraping_metadata": {
    "job_id": "597190817",
    "scraped_at": "2025-11-09T19:16:57.200866",
    "matched_keyword": "Business Analyst",
    "match_score": 80
  }
}