{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=736431&lang=en"
    },
    "metadata": {
      "job_title": "Junior Environmental Protection Officer - Eligibility List",
      "employment_type": "Permanent Full-time",
      "location": "SK-Stoon-Saskatoon",
      "ministry": "026 Environment",
      "salary_range": "$40.375-$50.593",
      "salary_min": 40.375,
      "salary_max": 50.593,
      "salary_frequency": "Hourly",
      "grade": "SGEU.11.",
      "hours_of_work": "B - SGEU Field 37.33 - work a total of 37.33 hours/week, averaged over 4 weeks",
      "number_of_openings": 5,
      "closing_date": null
    },
    "ministry_description": "About Us",
    "the_opportunity": {
      "intro": "The Environmental Protection Branch of the Ministry is seeking up tofive permanentandmultiple termJunior Environmental Protection Officers with a strong background inengineering or scienceto support the delivery of results-based environmental protection programs across Saskatchewan.",
      "responsibilities": ""
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": ""
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": "Typically, the knowledge and abilities required for this position can be achieved through a degree in engineering or science combined with related environmental work experience or equivalent combination of education and experience."
    },
    "benefits": {
      "what_we_offer": "- Dynamic, diverse and challenging work for talented individuals;",
      "benefits_list": [
        "Dynamic, diverse and challenging work for talented individuals;"
      ]
    },
    "additional": {
      "diversity_statement": "We are committed to workplace diversity.",
      "additional_notes": null
    },
    "full_description": "About Us\nThe\nMinistry of Environment\n's role is to manage the health of Saskatchewan's environment in a responsible manner that supports sustainable growth through objective, transparent and informed decision making and stewardship. We provide objective, evidence-based advice to decision-makers and deliver programs in a fair, impartial manner aligned with government directed policy. We are dedicated to service excellence, we demonstrate innovation, collaboration and transparency, practice effective and accountable use of resources and promote engagement and leadership at all levels.\nThe Opportunity\nThe Environmental Protection Branch of the Ministry is seeking up to\nfive permanent\nand\nmultiple term\nJunior Environmental Protection Officers with a strong background in\nengineering or science\nto support the delivery of results-based environmental protection programs across Saskatchewan.\nAs a Junior Environmental Protection Officer in the Environmental Protection Branch, you will be responsible for:\nReviewing environmental impact statements for proposed municipal, industrial and mining operations and provide technical review comments regarding these developments;\nReviewing applications and preparing approvals for the construction, operation and decommissioning of all components of municipal, industrial and mining operations related to raw product handling, processing, waste management, air quality, industrial waste and wastewater treatment, potable water treatment, sewage treatment, storage and handling of hazardous substances, and waste dangerous goods;\nReviewing and commenting on all required document submissions from municipal, industrial and mining operations including those for the management of environmentally impacted sites;\nPerforming environmental inspections to ensure compliance with provincial legislation, the Environmental Code, regulations, permits and approvals;\nInvestigating spills of hazardous substances, and waste dangerous goods and approve clean up and remediation at assigned facilities;\nAssisting in the development of the Province’s environmental policies and regulations regarding municipal, industrial and mining operations and their inherent environmental concerns; and\nResponding to public inquiries or complaints.\nThe ideal candidate will have:\nDemonstrated knowledge of provincial environmental legislation;\nKnowledge and awareness of environmental and public health and safety issues associated with municipal, industrial and mining operations including air, hazardous substances and waste dangerous goods;\nKnowledge of environmental monitoring and reporting at municipal, industrial or mining operations;\nKnowledge of geology, hydrogeology, biology, geochemistry, water chemistry, related inorganic chemistry as it relates to municipal and industrial applications and impacted site reclamation;\nKnowledge of compliance assurance policies and procedures in a Results Based Regulatory framework;\nThe ability to clearly and accurately discuss complex environmental issues, policies and procedures to diverse groups (including peers) at a level appropriate to the audience, and concisely draft and compose written documents; and\nThe ability to educate, facilitate, and persuade others to achieve consensus or resolve conflict in highly polarized situations.\nTypically, the knowledge and abilities required for this position can be achieved through a degree in engineering or science combined with related environmental work experience or equivalent combination of education and experience.\nWhat We Offer:\nDynamic, diverse and challenging work for talented individuals;\nA competitive salary;\nComprehensive benefits package including pension;\nVacation, earned days off (EDO) and other types of leave;\nInclusive work environment;\nCareer advancement and development opportunities; and\nFlexible work arrangements within branch policies.\nThe headquarters for these positions will be in Saskatoon, Regina, or Prince Albert. These positions require independent travel to remote areas of the province and flexible work hours. As travel within Saskatchewan is necessary, the successful candidates must hold a valid Class 5 driver’s license.\nThe successful candidate will demonstrate the Saskatchewan Public Service core values of respect and integrity; serving citizens, practicing excellence and innovation; and acting as One Team, including participating in, and contributing to an inclusive workplace culture.\nThis posting will be used to create an eligibility list that will be valid for up to six months, and used to staff current and future vacancies as they arise."
  },
  "scraping_metadata": {
    "job_id": "736431",
    "scraped_at": "2025-11-09T14:47:50.529874",
    "search_keyword": "Information Officer",
    "matched_keyword": "Finance Officer",
    "match_score": 90
  }
}