{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=736281&lang=en"
    },
    "metadata": {
      "job_title": "System Configuration Analyst",
      "employment_type": "Permanent Full-time",
      "location": "SK-Rgna-Regina",
      "ministry": "013 Saskbuilds and Procurement",
      "salary_range": "$38.569-$46.952",
      "salary_min": 38.569,
      "salary_max": 46.952,
      "salary_frequency": "Hourly",
      "grade": "SGEU.09.",
      "hours_of_work": "A - SGEU Office 36 - one day off every two weeks",
      "number_of_openings": 2,
      "closing_date": null
    },
    "ministry_description": "The Procurement Management Division (PMD) of the Ministry of SaskBuilds and Procurement is looking for one to two highly motivated Configuration Analysts to join its Business System Support and Configuration team.",
    "the_opportunity": {
      "intro": "",
      "responsibilities": ""
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": ""
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": "Typically, the knowledge required for this position would be obtained through a degree in computer science or supply chain or procurement-related fields. Experience in Oracle financial/supply chain applications and/or related business processes would be considered an asset."
    },
    "benefits": {
      "what_we_offer": "",
      "benefits_list": []
    },
    "additional": {
      "diversity_statement": "We are committed to workplace diversity.",
      "additional_notes": null
    },
    "full_description": "The Procurement Management Division (PMD) of the Ministry of SaskBuilds and Procurement is looking for one to two highly motivated Configuration Analysts to join its Business System Support and Configuration team.\nIn this role, you will be responsible for a combination of business and technical system analysis, design and configuration, process development, and help desk support and training for clients. You will also act as a business expert in the execution of Supply Chain Management (SCM) of the new Government of Saskatchewan’s Oracle system in functions such as reporting, requisitioning, purchasing, receiving, period-end, and encumbrance reconciliation.\nAs a Configuration Analyst, you will analyze and evaluate requirements (client needs, new enhancements), recommend solutions, design system changes, modify reporting business areas, work closely with Information Technology Division (ITD) developers in system development, and test changes to ensure continued accurate SCM and financial processes.\nYou will need exceptional analytical and problem-solving skills to evaluate and resolve complex systems issues. You will use your strong written and verbal communication skills to develop project plans, technical requirements, and procedure guides to communicate with both technical and non-technical clients. In addition, you must have excellent facilitation and presentation skills to conduct training and information-gathering sessions for large groups of people.\nTypically, the knowledge required for this position would be obtained through a degree in computer science or supply chain or procurement-related fields. Experience in Oracle financial/supply chain applications and/or related business processes would be considered an asset.\nYou will have knowledge of:\nConcepts relevant to a GUI application development environment;\nRelational database concepts, theories and principles;\nThe fundamentals of Oracle financial systems integration;\nThe fundamentals and processes of report development using Oracle Discoverer and/or other similar reporting software; and\nRequirements analysis and solution design techniques.\nYou will have demonstrated the ability to:\nResearch, identify specifications, create, format and maintain reports from a reporting database using Oracle Discoverer reporting software;\nCreate a variety of detailed, accurate and clear (technical) material such as user procedures and report requirements documentation; training materials; project plans; status reports; requests for proposals; feasibility studies; and recommendations, at a level appropriate to the target groups;\nDeliver/facilitate training sessions, presentations and workshops for a variety of client groups relating to the use of reporting software;\nVerbally and in writing, communicate technical information to a wide variety of technical and non-technical individuals in a clear, accurate and understandable manner;\nIndependently prioritize and organize one's own workload to meet tight deadlines and successfully complete projects in a changing environment;\nWork independently and cooperatively with others in a team environment to establish, build and maintain positive working relationships and to ensure deadlines, goals and objectives are met;\nIdentify, explore and evaluate options on data, processes and methodologies and information technology to make feasible recommendations; and\nUpdate, edit, retrieve, maintain, merge, format and transmit information/data using a variety of hardware, software and electronic systems with speed and accuracy within tight deadlines.\nYou will be:\nThorough, conscientious and attentive to detail to ensure quality work; and\nService oriented with strong interpersonal skills.\nSaskBuilds and Procurement: where infrastructure, procurement, real property, facility management, logistics and information technology meet to enable the Government of Saskatchewan’s Growth Plan and programs and services for citizens and communities.\nThe Ministry of SaskBuilds and Procurement offers dynamic and challenging work for talented individuals in an environment that supports innovation, creativity, and diversity. Also, the Saskatchewan public service offers several employment advantages such as:\nA competitive salary and benefits package;\nA competitive salary and benefits package;\nVacation and earned days off (EDOs);\nOpportunities for professional growth and development; and\nA diverse and inclusive workplace that values individual contributions.\nIf you want to learn more about the Ministry of SaskBuilds and Procurement and what we offer, check out our website,\nMinistry of SaskBuilds and Procurement\n."
  },
  "scraping_metadata": {
    "job_id": "736281",
    "scraped_at": "2025-11-09T14:44:42.475852",
    "search_keyword": "Business Analyst",
    "matched_keyword": "Business Analyst",
    "match_score": 90
  }
}