{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=734346&lang=en"
    },
    "metadata": {
      "job_title": "Judicial Officer, Provincial Court",
      "employment_type": "Permanent Full-time",
      "location": "SK-Rgna-Regina",
      "ministry": "003 Justice",
      "salary_range": "$33.367-$41.812",
      "salary_min": 33.367,
      "salary_max": 41.812,
      "salary_frequency": "Hourly",
      "grade": "SGEU.09.",
      "hours_of_work": "A - SGEU Office 36 - one day off every two weeks",
      "number_of_openings": 1,
      "closing_date": null
    },
    "ministry_description": "The Ministry of Justice and Attorney General is responsible for providing a fair justice system that upholds the law and protects the rights of all individuals in Saskatchewan; promotes safe and secure communities; and provides legal and justice policy advice to government.",
    "the_opportunity": {
      "intro": "",
      "responsibilities": ""
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": ""
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": "Typically, the successful candidates in this competition will have developed their knowledge and skills through a related diploma/degree such as a Human Justice Degree, Police studies, paralegal course and have experience in a court/legal environment or an equivalent combination of education and related experience."
    },
    "benefits": {
      "what_we_offer": "",
      "benefits_list": []
    },
    "additional": {
      "diversity_statement": "We are committed to workplace diversity.",
      "additional_notes": null
    },
    "full_description": "The Ministry of Justice and Attorney General is responsible for providing a fair justice system that upholds the law and protects the rights of all individuals in Saskatchewan; promotes safe and secure communities; and provides legal and justice policy advice to government.\nA unique opportunity to contribute to the administration of justice in a challenging legal environment.\nThe Courts and Community Justice Division is seeking an assertive, respectful, culturally aware individual to support our mission and values by providing conscientious dependable support as Judicial Officer to the Provincial Court of Saskatchewan in Regina. While Court is in session, as the Chief Court Official, you will call court to order and maintain court protocols to uphold the dignity of the court.\nAs Judicial Officer, you will be responsible for:\nUpholding the dignity of the court by providing support and assistance to the Provincial Court Judges and sitting Justice of the Peace;\nProvide assistance to clients and information in response to general inquiries;\nWriting down the relevant appearance details and the disposition of each matter before the court which forms the official court record;\nOperating the digital recording sound system and maintain accurate lognotes;\nOperating closed circuit television equipment and webex;\nAdministering oaths;\nReceiving, safeguarding and maintaining an accurate list of exhibits tendered in evidence;\nCreating accurate lists of witnesses;\nUsing the Criminal Justice Information Management System and other software programs, you will produce and explain court documents in accordance with the order of the court and applicable legislation and coach clerical support in this regard;\nAssisting with the public, lawyers and the judiciary;\nClimbing ladders to retrieve files and carry heavy boxes up to 20 kg's that contain files and documents; and\nWorking overtime when court sittings run late and for travelling to circuit court.\nThe environment in which you will work is potentially hostile, therefore, you must be able to recognize volatile situations and react appropriately.\nOur candidate of choice will have the following:\nKnowledge of the justice system as it pertains to the various levels of court as well as legal terminology, Acts, regulations, policies, protocols and procedures as they apply to court processes;\nStrong communication and interpersonal skills;\nFlexibility and positivity while enjoying a fast-paced, challenging environment with diverse job expectations;\nThorough, analytical and accurate with the ability to pay close attention to detail as accuracy is paramount in this position;\nCulturally aware in order to respectfully assist clients and colleagues of various cultures;\nA valid driver's license as you will be required to travel when covering circuit court (and may require flying in small aircraft to some locations and staying overnight);\nDemonstrating good character in order to maintain the integrity of the justice system and the people it serves and ensure confidentiality within and outside of the place of work in accordance with your Oath of Office.\nTypically, the successful candidates in this competition will have developed their knowledge and skills through a related diploma/degree such as a Human Justice Degree, Police studies, paralegal course and have experience in a court/legal environment or an equivalent combination of education and related experience.\nThe successful candidate must be eligible to hold appointment as a Justice of the Peace and perform duties as described in the applicable legislation, go to\nhttp://www.justice.gov.sk.ca/Justices-of-the-Peace-Act-1988\n.\nThe successful candidate must demonstrate good character in order to maintain the integrity of the justice system and the people it serves and ensure confidentiality within and outside the workplace in accordance with your Oath of Office.\nTo learn more about the Courts of Saskatchewan go to\nhttp://www.sasklawcourts.ca/\n.\nWhat we offer:\nDynamic, challenging work for talented individuals.\nA competitive salary.\nComprehensive benefits package including pension.\nVacation, earned days off (EDO) and other types of leave.\nInclusive work environments\nAdvancement opportunities.\nFlexible work arrangements.\nNote: This is a reposted competition. Those who have previously applied, do not need to reapply."
  },
  "scraping_metadata": {
    "job_id": "734346",
    "scraped_at": "2025-11-09T14:47:44.300976",
    "search_keyword": "Information Officer",
    "matched_keyword": "Finance Officer",
    "match_score": 90
  }
}