{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=735222&lang=en"
    },
    "metadata": {
      "job_title": "Traffic Officer",
      "employment_type": "Permanent Full-time",
      "location": "SK-North East-Melfort",
      "ministry": "073 Corrections Policing and Public Safety",
      "salary_range": "$42.208 - $52.892",
      "salary_min": 42.208,
      "salary_max": 52.892,
      "salary_frequency": "Hourly",
      "grade": "SGEU.10.",
      "hours_of_work": "B - SGEU Field 37.33 - work a total of 37.33 hours/week, averaged over 4 weeks",
      "number_of_openings": 10,
      "closing_date": null
    },
    "ministry_description": "The Ministry of Corrections, Policing and Public Safety has a challenging opportunity for a highly motivated individual who is interested in a career as a Traffic Officer with the Saskatchewan Highway Patrol. Your primary goal will be to protect the highway infrastructure and ensure the safety of all highway users by monitoring driver/vehicle compliance. The ministry is seeking to fill permanent positions across the province.",
    "the_opportunity": {
      "intro": "",
      "responsibilities": "- Responding to 911 calls when RCMP or Municipal Police agencies are not immediately available, or when you could provide the fastest first response;\n- Taking direct enforcement action during crimes in progress; and\n- Providing assistance and support to other Police Agencies as requested."
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": "- Responding to 911 calls when RCMP or Municipal Police agencies are not immediately available, or when you could provide the fastest first response;\n- Taking direct enforcement action during crimes in progress; and\n- Providing assistance and support to other Police Agencies as requested."
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": "The knowledge and skills required for this position would typically be gained through commercial vehicle safety/mechanical training or a Diploma in a Law Enforcement discipline."
    },
    "benefits": {
      "what_we_offer": "",
      "benefits_list": []
    },
    "additional": {
      "diversity_statement": "We are committed to workplace diversity.",
      "additional_notes": null
    },
    "full_description": "The Ministry of Corrections, Policing and Public Safety has a challenging opportunity for a highly motivated individual who is interested in a career as a Traffic Officer with the Saskatchewan Highway Patrol. Your primary goal will be to protect the highway infrastructure and ensure the safety of all highway users by monitoring driver/vehicle compliance. The ministry is seeking to fill permanent positions across the province.\nReporting to the District Enforcement Supervisor, you will enforce transportation legislation, policies and agreements for commercial and private vehicles traveling the provincial highway system.\nIn addition, you will be a member of the Provincial Protection and Response Team (PRT) and will aid in the reduction of crime in Saskatchewan by:\nResponding to 911 calls when RCMP or Municipal Police agencies are not immediately available, or when you could provide the fastest first response;\nTaking direct enforcement action during crimes in progress; and\nProviding assistance and support to other Police Agencies as requested.\nIn this position, you will:\nInspect commercial vehicles and check commercial vehicle operators for compliance with Provincial and/or Federal Transportation Acts and Regulations;\nConduct roadside inspections, issue charges, appear in court, conduct investigations, attend motor vehicle accidents and prepare reports as required;\nInterpret and apply applicable federal and provincial regulations and municipal bylaws relating to the safe operation of all motor vehicles;\nConduct interviews and investigations in order to obtain detailed information;\nRequire knowledge of legal/court processes/procedures and provide court testimony;\nDeliver a public and industry related awareness and education program respecting all aspects of the transportation industry, to municipal officials, police forces, transport companies, interest groups and the general public;\nInteract professionally with team members, other enforcement and government agencies, as well as the commercial transportation industry;\nHave the physical ability to inspect vehicles and cargo in accordance with Commercial Vehicle Safety Alliance standards; and\nBe willing and capable of carrying and handling firearms and other use of force intervention options.\nTo qualify for this position, you will:\nHave completed a physical/medical assessment which includes bringing a current (within 6 months) Police Officers Physical Assessment Training (POPAT) in a time of 4:45 or less; Due by Nov 18, 2025. It is up to the applicant to make these testing arrangements.\nPossess/produce a valid Canadian driver’s license – (a Certified Drivers Abstract will be requested at a later date);\nPossess/ produce a valid First Aid Certificate, including AED that must be valid to November 2026 or beyond; and\nBe required to pass a psychological personality assessment (MMPI) to determine suitability for law enforcement.\nAs applicants progress through the hiring process they will be requested to complete a Medical Screening assessment.\nThe knowledge and skills required for this position would typically be gained through commercial vehicle safety/mechanical training or a Diploma in a Law Enforcement discipline.\nCandidates who are successful through the application process, will be required to successfully complete 20 weeks of mandatory training at the Saskatchewan Police College, plus 10 additional weeks of Commercial Vehicle Enforcement training.\nYou will be required to work variable hours, including evenings and weekends, and will be required to travel with overnight stays away from your home detachment. (Approximately 50% travel)\nNote: This is a reposted competition. Those who have previously applied, do not need to reapply.\nNOTICE: APPLICANT, PLEASE REVIEW Traffic Officer recruitment schedule:\nJob Posting\nINV001462\nwill close at midnight of November 12, 2025.\nNovember 14 - Applicant Resume Screening.\nNovember 14 - Applicant Interview Invites.\nNovember 19 - 21 - Interview /MMPI testing dates - Saskatchewan Highway Patrol Headquarters - Regina, Saskatchewan.\nDecember 29 to January 02 - Orientation week at Saskatchewan Highway Patrol Headquarters - Regina, Saskatchewan.  (Note January 1st -STAT holiday)\nJanuary 5 to May 29, 2026 -  Start & finish dates at Saskatchewan Police College Regina, Saskatchewan."
  },
  "scraping_metadata": {
    "job_id": "735222",
    "scraped_at": "2025-11-09T14:48:12.061445",
    "search_keyword": "Information Officer",
    "matched_keyword": "Finance Officer",
    "match_score": 90
  }
}