{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=736553&lang=en"
    },
    "metadata": {
      "job_title": "Personnel Clerk",
      "employment_type": "Permanent Full-time",
      "location": "SK-Rgna-Regina",
      "ministry": "073 Corrections Policing and Public Safety",
      "salary_range": "$26.002 - $32.589",
      "salary_min": 26.002,
      "salary_max": 32.589,
      "salary_frequency": "Hourly",
      "grade": "SGEU.06.",
      "hours_of_work": "A - SGEU Office 36 - one day off every two weeks",
      "number_of_openings": 1,
      "closing_date": null
    },
    "ministry_description": "Are you interested in a career that offers variety, challenge, and an opportunity to provide exceptional client service in a positive work environment? The Regina Correctional Centre has a Personnel Clerk opportunity available. This position will be responsible for performing a variety of transactional services including:",
    "the_opportunity": {
      "intro": "",
      "responsibilities": ""
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": ""
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": ""
    },
    "benefits": {
      "what_we_offer": "",
      "benefits_list": []
    },
    "additional": {
      "diversity_statement": "We are committed to workplace diversity.",
      "additional_notes": null
    },
    "full_description": "Are you interested in a career that offers variety, challenge, and an opportunity to provide exceptional client service in a positive work environment? The Regina Correctional Centre has a Personnel Clerk opportunity available. This position will be responsible for performing a variety of transactional services including:\nAdministering leaves of absence, terminations and all employee benefits;\nPreparing requisitions for competition and all required documents for submission to the HR Service Centre;\nBeing the primary contact for employees and managers of the Regina Correctional Centre. The candidate will have an understanding of all personnel and payroll processes and the ability to explain the information to staff;\nBeing responsible for the interpretation and application of the Collective Bargaining Agreement, as well as Letters of Understanding pertaining to various work units of the Centre;\nBi-weekly auditing of the Centre's timecards by comparing the timecard to the schedule and the overtime sheets submitted to the personnel department for both full-time and part-time employees.  This will be done within the timeframes and within the guidelines; and\nBeing the Centre's liaison with Human Resources and other agencies, you will provide information and explanations to staff regarding policies pertaining to issues such as leaves of absence, retirement and variable hour arrangements.\nThe successful candidate will be skilled in performing math calculations, understanding principles in order to calculate hours of work, overtime and entitlements, and computer software applications such as word processing, spreadsheets and databases.\nYou will also demonstrate the ability to accurately reference, interpret and appropriately apply acts, regulations, policies and guidelines to daily operations and to provide clear, concise, and timely information in response to often complex inquiries at a level appropriate to the audience."
  },
  "scraping_metadata": {
    "job_id": "736553",
    "scraped_at": "2025-11-09T14:50:09.022208",
    "search_keyword": "Manager",
    "matched_keyword": "Data Entry Clerk",
    "match_score": 90
  }
}