{
  "job_posting": {
    "source": {
      "jurisdiction": "Saskatchewan",
      "job_board": "Government of Saskatchewan",
      "url": "https://govskpsc.taleo.net/careersection/10180/jobdetail.ftl?job=735942&lang=en"
    },
    "metadata": {
      "job_title": "Deputy Chief Medical Health Officer",
      "employment_type": "Permanent Full-time",
      "location": "SK-Rgna-Regina",
      "ministry": "032 Health",
      "salary_range": "$22,808-$29,649",
      "salary_min": 22808.0,
      "salary_max": 29649.0,
      "salary_frequency": "Monthly",
      "grade": "commensurate with qualifications",
      "hours_of_work": "M - Monthly Out of Scope",
      "number_of_openings": 2,
      "closing_date": null
    },
    "ministry_description": "Are you a visionary leader with a passion for advancing public health and improving population health outcomes? If you’re an experienced Public Health and Preventive Medicine professional with strong communication and collaboration skills, the Saskatchewan Ministry of Health invites you to join our team asDeputy Chief Medical Health Officer.",
    "the_opportunity": {
      "intro": "As one of two Deputy Chief Medical Health Officers, reporting to the Chief Medical Health Officer (CMHO), you will play a key leadership role in advancing public health priorities, protecting population health, and driving health equity across Saskatchewan.",
      "responsibilities": "- Provide expert medical and public health leadershipto develop and implement policies, standards, and programs including health assessment and measurement, health promotion, disease and injury prevention and health protection;\n- Monitor and report on population healthand respond to emerging health challenges, ensuring alignment with evidence-based practices;\n- Collaboratewith key partners, including the Saskatchewan Health Authority (SHA), other ministries, Indigenous governments and organizations, and national and international stakeholders;\n- Support legislative responsibilitiesand the Chief MHO to administer the legislated functions and responsibilities of the position as outlined inThe Public Health Act, 1994and regulations;\n- Act as a spokespersonon public health matters, representing Saskatchewan in federal/provincial/territorial committees and providing trusted advice to decision-makers; and\n- Contribute to research and education, supporting capacity building in the field of public health and supervising students and residents, with potential academic appointment opportunities at the University of Saskatchewan’s College of Medicine."
    },
    "responsibilities_breakdown": {
      "strategic_leadership_planning": "",
      "technical_oversight": "",
      "information_knowledge_management": "",
      "stakeholder_engagement_collaboration": "",
      "team_resource_management": "- Provide expert medical and public health leadershipto develop and implement policies, standards, and programs including health assessment and measurement, health promotion, disease and injury prevention and health protection;\n- Monitor and report on population healthand respond to emerging health challenges, ensuring alignment with evidence-based practices;\n- Collaboratewith key partners, including the Saskatchewan Health Authority (SHA), other ministries, Indigenous governments and organizations, and national and international stakeholders;\n- Support legislative responsibilitiesand the Chief MHO to administer the legislated functions and responsibilities of the position as outlined inThe Public Health Act, 1994and regulations;\n- Act as a spokespersonon public health matters, representing Saskatchewan in federal/provincial/territorial committees and providing trusted advice to decision-makers; and\n- Contribute to research and education, supporting capacity building in the field of public health and supervising students and residents, with potential academic appointment opportunities at the University of Saskatchewan’s College of Medicine."
    },
    "qualifications": {
      "the_ideal_candidate": "",
      "intro": null,
      "required_qualifications": [],
      "education_requirements": ""
    },
    "benefits": {
      "what_we_offer": "- Lead transformative public health initiatives and shape policies that directly impact the health and well-being of Saskatchewan residents;\n- Work in a dynamic and multidisciplinary environment with diverse stakeholders across sectors; and\n- Contribute to building healthier communities and driving positive change.",
      "benefits_list": [
        "Lead transformative public health initiatives and shape policies that directly impact the health and well-being of Saskatchewan residents;",
        "Work in a dynamic and multidisciplinary environment with diverse stakeholders across sectors; and",
        "Contribute to building healthier communities and driving positive change."
      ]
    },
    "additional": {
      "diversity_statement": "Preference will be given to qualified equity group members who self-declare in this online application, as identified in \"diversity groups\" below",
      "additional_notes": null
    },
    "full_description": "Are you a visionary leader with a passion for advancing public health and improving population health outcomes? If you’re an experienced Public Health and Preventive Medicine professional with strong communication and collaboration skills, the Saskatchewan Ministry of Health invites you to join our team as\nDeputy Chief Medical Health Officer.\nAbout Us\nThe Saskatchewan Ministry of Health is committed to improving the health and well-being of all Saskatchewan residents. Guided by the principles of\nBetter Health, Better Care, Better Value, and Better Teams\n, the Ministry sets provincial strategies, establishes policy and legislative frameworks, and ensures the delivery of high-quality, patient-centred health services.\nThe Opportunity\nAs one of two Deputy Chief Medical Health Officers, reporting to the Chief Medical Health Officer (CMHO), you will play a key leadership role in advancing public health priorities, protecting population health, and driving health equity across Saskatchewan.\nIn this critical role, you will:\nProvide expert medical and public health leadership\nto develop and implement policies, standards, and programs including health assessment and measurement, health promotion, disease and injury prevention and health protection;\nMonitor and report on population health\nand respond to emerging health challenges, ensuring alignment with evidence-based practices;\nCollaborate\nwith key partners, including the Saskatchewan Health Authority (SHA), other ministries, Indigenous governments and organizations, and national and international stakeholders;\nSupport legislative responsibilities\nand the Chief MHO to administer the legislated functions and responsibilities of the position as outlined in\nThe Public Health Act, 1994\nand regulations;\nAct as a spokesperson\non public health matters, representing Saskatchewan in federal/provincial/territorial committees and providing trusted advice to decision-makers; and\nContribute to research and education\n, supporting capacity building in the field of public health and supervising students and residents, with potential academic appointment opportunities at the University of Saskatchewan’s College of Medicine.\nQualifications and Requirements\nTo succeed in this role, you will bring:\nA medical degree recognized in Canada;\nFellowship with the Royal College of Physicians and Surgeons of Canada in Public Health and Preventive Medicine;\nEligibility for licensure to practice as a specialist in Public Health and Preventive Medicine in Saskatchewan with the College of Physicians and Surgeons of Saskatchewan;\nDemonstrated experience providing strategic leadership in public health, including developing and implementing health programs, policies, or strategies;\nExpertise in epidemiology, health surveillance, and population health assessment;\nExperience in stakeholder engagement and collaboration across diverse sectors, including government, health authorities, Indigenous communities, and non-governmental organizations;\nComprehensive knowledge of public health and preventive medicine principles, including health promotion, disease prevention, and communicable disease control;\nStrong ethical standards, integrity, and credibility within the public health community;\nExceptional communication, interpersonal, and collaborative skills to build networks and engage effectively with stakeholders;\nAnalytical and strategic thinking abilities to address complex public health challenges; and\nFamiliarity with Saskatchewan’s health system or experience in government/public health settings is an asset.\nWhat We Offer\nBy joining the Saskatchewan Ministry of Health, you will have the opportunity to:\nLead transformative public health initiatives and shape policies that directly impact the health and well-being of Saskatchewan residents;\nWork in a dynamic and multidisciplinary environment with diverse stakeholders across sectors; and\nContribute to building healthier communities and driving positive change.\nWe offer an attractive compensation package, including:\nCompetitive salary;\nComprehensive benefits package; and\nPension plan.\nDiversity and Inclusion\nThe Saskatchewan Ministry of Health values diversity and is committed to fostering an inclusive, respectful, and harassment-free workplace. The Ministry values diversity and encourages applicants from underrepresented groups, including Indigenous peoples, persons with disabilities, and visible minorities."
  },
  "scraping_metadata": {
    "job_id": "735942",
    "scraped_at": "2025-11-09T14:48:18.354672",
    "search_keyword": "Information Officer",
    "matched_keyword": "Finance Officer",
    "match_score": 90
  }
}