{
  "job_id": "233484",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=233484",
  "title": "Senior Economic Officer – International Opportunities (London, Munich, Paris, Tokyo)",
  "organization": "Ministry of Economic Development, Job Creation and Trade",
  "division": "Trade and International Engagement / International Representation Branch",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "4 Temporary - up to 36 months",
  "job_code": "8A008N - ProgPlanSrEconOffr08",
  "salary": "$103,051.00 - $158,763.00 Per year",
  "salary_min": 103051.0,
  "salary_max": 158763.0,
  "salary_period": "year",
  "apply_by": "2025-11-14T23:59:00",
  "posted_on": "2025-10-24T00:00:00",
  "position_details": "4 English Temporary, duration up to 36 months, 777 Bay St, Toronto, Toronto Region",
  "compensation_group": "Association of Management, Administrative and Professional Crown Employees of Ontario",
  "work_hours": "Schedule 6",
  "category": "Finance and Economics",
  "note": "Note:",
  "about_the_job": "As a Senior Economic Officer, you'll work with provincial, federal, and international partners to position Ontario as a top destination for investment and trade. You'll lead strategic initiatives, support trade missions, host delegations, and raise Ontario's profile through media and outreach. Your insights will help shape policy and drive economic growth across borders.\n\nAbout the Team\n\nYou'll be part of the International Representation Branch within the Trade and International Engagement Division — a dynamic team that connects Ontario to the world.\n\nWith offices in Canadian embassies and consulates across Europe, Asia, and the Americas, our Trade and Investment Offices are led by experts who understand the unique needs of their markets — and the competitive advantages Ontario offers. We're also a key resource for local economic development teams looking to attract foreign investment or expand into global markets.\n\nWant to learn more?\nJoin our information session on November 6th from 10am to 10:45am to hear directly from the hiring manager about the role, the team, and what it's like working at the Ministry. Please&nbsp;Register Here \n\n**Attendance at the session is optional and will have no impact on hiring decisions.",
  "what_you_bring": "Mandatory requirements:\n• you are a Canadian Citizen\n• you have the ability to obtain and maintain Top Secret Security Clearance from the Government of Canada\n• you have the ability to obtain and maintain Canadian Diplomatic Passport and Diplomatic Accreditation / Visa in host country (cannot hold citizenship of host country)\n• you are able to undergo Medical / Fitness for Duty Assessment\n\n\nExplore the Opportunities:\nClick the links below to view and apply for each of the four positions. Each posting includes full details about the role, location, and how to apply.\n\nSenior Economic Officer – Paris\nLocation: Canadian Embassy, Paris, France\nLanguage Requirement: English and French \n\nRepresent Ontario in France and lead initiatives that drive investment, trade, and innovation. You'll work with government and business leaders, support trade missions, and raise Ontario's profile through strategic outreach.\n\n&nbsp; Apply to Paris Posting\n\nSenior Economic Officer – Munich\nLocation: Consulate of Canada, Munich, Germany\nLanguage Requirement: English and German\n\nRepresent Ontario in Germany and build partnerships that support trade, investment, and innovation. You'll provide market intelligence, support missions, and engage with key stakeholders.\n\n&nbsp; Apply to Munich Posting\n\nSenior Economic Officer – Tokyo\nLocation: Canadian Embassy, Tokyo, Japan\nLanguage Requirement: English and Japanese\n\nRepresent Ontario in Japan and drive opportunities in trade and investment. You'll lead strategic initiatives, support high-level missions, and strengthen Ontario's presence in Asia.\n\n&nbsp; Apply to Tokyo Posting\n\nSenior Economic Officer – London\nLocation: Canadian High Commission, London, England\n\nRepresent Ontario in the UK and promote our province as a hub for global business. You'll lead programming, support delegations, and provide high-level advice to advance Ontario's interests.\n\n&nbsp; Apply to London Posting",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:22.841819",
  "matched_keyword": "Economist",
  "match_score": 88.0
}