{
  "job_id": "236596",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=236596",
  "title": "Facilities Management Consultant",
  "organization": "Ontario Provincial Police",
  "division": "Business Management Bureau - Facilities Section",
  "city": "London, North Bay, Orillia, Thunder Bay",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Permanent",
  "job_code": "C0315 - OPP Business Planner",
  "salary": "$96,722.00 - $127,295.00 Per year",
  "salary_min": 96722.0,
  "salary_max": 127295.0,
  "salary_period": "year",
  "apply_by": "2025-11-27T23:59:00",
  "posted_on": "2025-11-06T00:00:00",
  "position_details": "1 English Permanent, 777 Memorial Ave, Orillia, Central Region or 1 Hurtubise Dr, Orillia, Central Region or 911A Gormanville Rd, North Bay, North Region or 615 James St S, Thunder Bay, North Region or 6355 Westminster Dr, London, West Region, Criminal Record and Judicial Matters Check (Fingerprint Based)",
  "compensation_group": "Ontario Provincial Police Association Civilians",
  "work_hours": "Schedule 3",
  "category": "Maintenance and Trades",
  "note": "Note:",
  "about_the_job": "In this role, you will:\n\n• Plan and manage construction, accommodation, and leasing projects for OPP clients across Ontario.\n• Provide technical advice and costing to ensure compliance with standards and contracts.\n• Ensure adherence to accommodation requirements, coordinate facilities planning and construction projects.\n• Provide technical advice to clients.\n• Access, manipulate and evaluate data and information, prepare documentation and track and monitor projects using computer software.\n• Act as the primary liaison between OPP clients and representatives of Infrastructure Ontario (IO) and its service providers.\n• Participates in the resolution of contentious issues, serious occurrences and service related complaints from clients.\n\nNote: The successful candidate will be expected to travel frequently throughout the province.",
  "what_you_bring": "Mandatory requirements:\n• Ability to pass an OPP background/ security investigation.\n• Must have a valid Ontario driver's licence.\n\n\nFacilities Management Experience:\n• Knowledge of facilities management policies, procedures, guidelines and standards.\n• Knowledge of accommodation and lease management processes, and business plans.\n• Knowledge of Workplace Environment Guidelines (WEG), financial controllership, budget estimates and input into capital and strategic plans.\n• Knowledge of architectural design, relevant construction codes (Building Code, Fire Code, etc.), legislation, including health and safety regulations.\n• Knowledge of space planning, ergonomics, barrier-free (AODA) requirements and security construction (CPRED) and inspection practices.\n• Ability to read architectural and engineering drawings to advise professionals and support project completion.\n\n\nProject Management:\n• Ability to apply expertise in facilities and construction related project management to manage the delivery of facilities related projects.\n• Knowledge of project management standards to lead and coordinate large-scale accommodation and leasing projects.\n\n\nAnalytical Skills:\n• Ability to apply problem solving and analytical skills to identify contentious issues and develop resolution strategies.\n• Knowledge of facilities design, building sciences, and database systems to interpret technical data, monitor projects, and produce reports.\n• Proficient in software and systems including AutoCAD, spreadsheets, word processing, project management, and records tracking and retention tools.\n\n\nCommunication and Relationship Management:\n• Proven ability to negotiate and resolve project and leasing issues with OPP clients, IO staff, and service providers.\n• Ability to brief senior management on the status and resolution of contentious issues, serious occurrences and complaints from clients.\n• Skill to communicate technical advice and information to management, staff and clients\n• Ability to provide detailed technical instructions to service providers.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:34.276618",
  "matched_keyword": "Manager",
  "match_score": 88.0
}