{
  "job_id": "234708",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=234708",
  "title": "Manager - Psychological Services",
  "organization": "Ministry of Children, Community and Social Services",
  "division": "Youth Justice Division / Service Delivery Branch",
  "city": "Brampton",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Permanent",
  "job_code": "M1112F - Social Services45",
  "salary": "$105,307.00 - $148,429.00 Per year",
  "salary_min": 105307.0,
  "salary_max": 148429.0,
  "salary_period": "year",
  "apply_by": "2025-11-17T23:59:00",
  "posted_on": "2025-10-20T00:00:00",
  "position_details": "1 English Permanent, 8500 Mclaughlin Rd S, Brampton, Central Region, Broad Record Check",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Management and General",
  "note": "Note:",
  "about_the_job": "Create the Work Environment\nIn the Ontario Public Service, we hold our leaders to the highest standards, expecting them to embody authenticity, accountability, and courage in every action and decision. It will be your responsibility to create a work environment and team culture that ignites innovation, nurtures collaboration and champions inclusivity by creating a diverse, anti-racist and accessible workplace that is free from discrimination and harassment. By aligning your choices with these values, you will create a vibrant work environment where every individual can thrive.\n\nDeliver on Business Goals and Priorities\nYour leadership will be crucial in guiding the team towards the achievement of their business goals. It will be your responsibility to inspire and motivate your team to deliver their best performance and align the team's daily actions with the strategic vision of the ministry. As the Psychological Services Manager you will:\n• Design, implement, and evaluate comprehensive psychological service programs within youth secure custody facilities, ensuring alignment with professional standards, facility needs, and ministry objectives.\n• Oversee clinical intake and service delivery processes, ensuring coordination between psychological services and other departments to provide effective and streamlined care.\n• Manage and provide professional supervision to an interdisciplinary treatment team, including performance evaluation, professional development, and adherence to clinical standards.\n• Deliver individual and group psychological counselling and therapy, and provide consultation in areas such as crisis intervention, assessment, and behaviour management.\n• Lead strategic planning initiatives, manage financial and human resources, and ensure compliance with legislation, ministry policies, and collective agreements.\n• Establish and maintain collaborative relationships with internal and external stakeholders, contribute to policy development, and advocate for the ministry's position in various forums.",
  "what_you_bring": "Mandatory requirements:\n• Registered Psychologist in good standing in Ontario.\n\n\nLeadership and Management:\n• Experience leading trauma-informed psychological services.\n• Ability to coach, mentor, and foster an inclusive team culture.\n• Strategic thinking to evaluate and improve programming.\n• Knowledge of financial and human resource management.\n• Strong decision-making and analytical skills.\n\n\nSpecialized Knowledge:\n• Expertise in psychological science and trauma-informed practices.\n• Ability to assess individual cases and determine appropriate interventions.\n• Experience with psychological research methods for diagnosis, treatment, and rehabilitation.\n• Background in correctional or youth-focused psychological services.\n\n\nCommunication and Interpersonal Skills:\n• Ability to build trust and communicate effectively with youth, staff, and stakeholders.\n• Skilled in providing consultation and presenting technical information clearly.\n• Collaborative approach to improving interdepartmental programs and services.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:38.085879",
  "matched_keyword": "Manager",
  "match_score": 100.0
}