{
  "job_id": "235811",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235811",
  "title": "Resource Management Technician",
  "organization": "Ministry of Natural Resources",
  "division": "Regional Operations Division",
  "city": "Thunder Bay",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Temporary assignment/contract for up to 12 months, with the possibility of extension",
  "job_code": "41104 - Resource Technician 3",
  "salary": "$27.49 - $30.60 Per hour*\n*Indicates the salary listed as per the OPSEU Collective Agreement.",
  "salary_min": 27.49,
  "salary_max": 30.6,
  "salary_period": "hour",
  "apply_by": "2025-11-17T23:59:00",
  "posted_on": "2025-10-31T00:00:00",
  "position_details": "1 English Temporary, duration up to 12 months, 435 James St S, Thunder Bay, North Region",
  "compensation_group": "Ontario Public Service Employees Union",
  "work_hours": "Schedule 4.7",
  "category": "Lands and Resources",
  "note": "Note:",
  "about_the_job": "In this role, you will:\n\n• carry out site inspections, field surveys compliance inspections and other operational activities\n• provide technical guidance to staff and the public\n• assist with administration and record keeping for projects and programs\n• gather and compile technical information to make recommendations\n• promote awareness of resource management and protection\n• support partnerships and initiatives with various stakeholders",
  "what_you_bring": "Mandatory::\nYou must have a valid class 'G' driver's licence or equivalent, as recognized by the Province of Ontario. The offer of employment is conditional upon the successful candidate providing proof that they have a valid driver's licence upon being hired.\n\n\nTechnical expertise::\n• You have a thorough working knowledge and understanding of ecological sustainability principles, and resource management practices.\n• You have proven ability to interpret and apply relevant legislation, policies and procedures applicable to natural resources management programs (e.g. forestry, aggregates, fish and wildlife, and lands and waters programs).\n• You have demonstrated experience in conducting operational field programs and site inspections.\n• You have knowledge of the standards and operating practices of field equipment for the purpose of information gathering and conducting field operations.\n• You are proficient with computers using various software applications, including word processing, record-keeping, database management, presentation, internet, email and geographic information systems (GIS).\n\n\nInterpersonal and communications skills::\n• You have demonstrated interpersonal skills to build effective working relationships with a wide variety of clients with diverse requests and varying concerns related to natural resources management (e.g. forestry, fish and wildlife, lands, waters and aggregates programs).\n• You have well developed communication skills to respond to industry and public inquiries.\n• You have demonstrated communications skills to make presentations, and share information with professional staff and clients.\n• You understand the importance of partnership development and can represent the ministry and present information and ideas tactfully and effectively.\n\n\nAnalytical and problem solving skills::\n• You have proven analytical and problem-solving skills to determine user compliance and impact on resources.\n• You can recommend proper course of action in cases of non-compliance and determine appropriate resolution to various issues in resource operations and in field conditions.\n\n\nPlanning and group leadership skills::\n• You have planning and coordinating skills to organize, schedule and coordinate human and equipment resources (e.g. boats/motors, pumps, vehicle transportation) for resources management and field projects.\n• You have demonstrated group leadership skills to assign work and provide guidance, and monitor progress of students and other staff.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:04.567059",
  "matched_keyword": "Manager",
  "match_score": 88.0
}