{
  "job_id": "235420",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235420",
  "title": "Manager, Client Relationship & Case Management",
  "organization": "Ministry of Children, Community and Social Services",
  "division": "Family Responsibility Office",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Temporary (12 months with possibility of extension)",
  "job_code": "M0904B - Administrative Services15",
  "salary": "$86,330.00 - $127,214.00 Per year",
  "salary_min": 86330.0,
  "salary_max": 127214.0,
  "salary_period": "year",
  "apply_by": "2025-11-12T23:59:00",
  "posted_on": "2025-10-28T00:00:00",
  "position_details": "1 English Temporary, duration up to 12 months, 125 Sir William Hearst Ave, Toronto, Toronto Region, Criminal Record Check",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Management and General",
  "note": "Note:",
  "about_the_job": "We hold our leaders to high standards because we believe in their potential to drive meaningful change. In the Ontario Public Service, leadership means showing up with authenticity, acting with integrity, and having the courage to do what's right—even when it's hard.\n\nAs a leader, you'll be expected to create a team culture that encourages innovation, supports collaboration, and champions inclusion. You'll help build a diverse, anti-racist, and accessible workplace where everyone feels safe, respected, and able to thrive.\n\nLeadership is about impact—and in these roles, you'll have the opportunity to make a meaningful one. You will:\n\nManage a collaborative team dedicated to achieving excellence in a contact center and complex service delivery environment.\nPlan, evaluate, and oversee client service operations and case lifecycle to ensure exceptional service delivery and effective financial account management.\nBuild and maintain effective relationships with clients and stakeholders through collaboration with partners and teams.\nDevelop strategic approaches to manage operations in a high-volume, time-sensitive environment.\nParticipate in modernizing operational policies, procedures, and standards to enhance efficiency and effectiveness.\nFoster a positive, inclusive, and high-performing team environment, and promote a culture of diversity, inclusion, and service excellence.Meet Your New Team\n\nThis position reports to Benedetta Freitas, an experienced operational and people leader. Benedetta's leadership focuses on building and inspiring inclusive, high-performing, and collaborative teams that are passionate about client service and delivering support to children and families. Benedetta is committed to fostering a work environment where every voice, perspective and contribution matters and is recognized. She is also committed to mentoring new and experienced leaders throughout all areas of the OPS.\n\nIn this role, you will join a branch leadership team alongside Benedetta and three Manager colleagues to support and lead a branch of 70 Client Liaison Agents, Case Management Officers, and Team Leads. \n\nThe Family Responsibility Office effectively and compassionately guides payors, recipients and partners through the family support process to ensure families receive the support to which they are entitled.\n\nInformation Session \n\nInterested in this position? Join us to learn more about the team, vision, and key priorities. The session will be held on Wednesday, November 5, 2025 at 12:00pm. Use the following link to access the MS Teams invitation on the day of: \n\nJoin the meeting now\nMeeting ID: 269 498 756 637 7 \nPasscode: hr7PY3kb",
  "what_you_bring": "Leadership Experience:\nStrategic Leadership: Demonstrated ability to lead diverse teams toward achieving results, with a strong focus on client service excellence.\nProgram Delivery: Skilled in planning and managing complex projects to ensure timely delivery of programs, advice, resources, and evaluations.\nOrganizational Development: Experienced in building organizational capacity through effective talent management and human resource strategies.\nPolicy &amp; Labour Relations Expertise: Trusted advisor in interpreting and applying legislation, policies, and Collective Agreements with consistency and technical precision.\n\n\nStrategic Thinking and Program Management:\nPolicy &amp; Legislative Insight: Skilled in interpreting and applying program policies, procedures, and relevant legislation to support effective service delivery.\nProgram Design &amp; Evaluation: Experienced in developing, implementing, and evaluating program delivery options, with a focus on continuous improvement and change management best practices.\nStrategic Alignment: Proven ability to ensure program initiatives align with broader corporate priorities and related efforts across the Ontario Public Service.\nAnalytical Problem-Solving: Strong strategic thinking and analytical skills to assess complex client issues and recommend solutions that support system-wide consistency.\n\n\nTechnical Knowledge:\nClient Service Operations: Experienced in managing large-scale call centre and client service environments, with deep understanding of related workflows and operational needs.\nPolicy &amp; Program Development: Skilled in planning, analysis, and program evaluation to implement policies, assess impacts, and identify service delivery challenges.\nGovernment Knowledge: Strong grasp of government and ministry priorities, including financial, administrative, and procurement policies, with awareness of current best practices for resource management.\n\n\nCommunication and Relationship Management:\nPolitical Acuity &amp; Collaboration: Skilled in navigating complex environments to build consensus, resolve issues, and foster strong relationships across ministries and with external partners.\nStakeholder Engagement: Proven ability to build and maintain productive relationships with diverse stakeholders, service providers, and cross-government teams.\nConsultation &amp; Influence: Effective in leading consultations and negotiations that align stakeholders with organizational goals and strategic initiatives.\nClear &amp; Strategic Communication: Exceptional written and verbal communication skills to convey strategy, direction, and recommendations with clarity and impact.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:16.703068",
  "matched_keyword": "Manager",
  "match_score": 100.0
}