{
  "job_id": "235437",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235437",
  "title": "Manager, Capital Planning and Delivery - Community Safety",
  "organization": "Ministry of the Solicitor General",
  "division": "Infrastructure Division",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Permanent",
  "job_code": "M1108B - Prog Planning & Evaluation17",
  "salary": "$105,307.00 - $148,429.00 Per year",
  "salary_min": 105307.0,
  "salary_max": 148429.0,
  "salary_period": "year",
  "apply_by": "2025-11-12T23:59:00",
  "posted_on": "2025-10-28T00:00:00",
  "position_details": "1 English Permanent, 25 Grosvenor St, Toronto, Toronto Region, Criminal Record Check",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Management and General",
  "note": "Note:",
  "about_the_job": "We hold our leaders to high standards because we believe in their potential to drive meaningful change. In the Ontario Public Service, leadership means showing up with authenticity, acting with integrity, and having the courage to do what's right—even when it's hard.\n\nAs a leader, you'll be expected to create a team culture that encourages innovation, supports collaboration, and champions inclusion. You'll help build a diverse, anti-racist, and accessible workplace where everyone feels safe, respected, and able to thrive.\n\nLeadership is about impact—and in these roles, you'll have the opportunity to make a meaningful one. You will:\n\nLead a team to oversee end-to-end capital infrastructure project delivery, from early-stage functional programming, planning and design, procurement, and construction oversight. \nManage relationships with Infrastructure Ontario, partner ministries, and community safety stakeholders to ensure successful project execution. \nProactively assess and mitigate risks related to project scope, schedule, budget, and stakeholder alignment to ensure successful delivery.\nSupport the development of infrastructure plans to ensure alignment with government priorities. \nOversee the development of Treasury Board/Management Board of Cabinet submissions and business cases for major capital investments. \nMaintain adherence to Ontario Public Service directives related to capital projects, procurement policies, and risk management frameworks. \nChampion continuous improvement by implementing lessons learned and best practices to strengthen future capital planning and delivery.Meet Your New Team\n\nMeet the Director: Aamir Hajeeyani\nThis position reports to Aamir Hajeeyani, an experienced leader in delivering complex infrastructure projects across multiple sectors. Aamir has overseen major capital initiatives for correctional facilities, large-scale transit projects, and cultural institutions such as Provincial museums and galleries.\n\nHis leadership approach emphasizes collaboration, innovation, and accountability. Aamir is committed to building inclusive, high-performing teams and fostering a culture where diverse perspectives are valued. He also prioritizes mentorship and professional growth, supporting team members at all stages of their careers.\n\nIn this role, you will join a leadership team dedicated to shaping Ontario's infrastructure landscape and delivering projects that make a meaningful impact across the province.\n\nThe&nbsp;Capital Planning and Project Delivery Branch leads the planning and delivery of major infrastructure projects across Ontario's community safety and correctional services portfolio. It works closely with correctional institutions and key community safety partners—including the Ontario Provincial Police, the Office of the Fire Marshal, and the Office of the Chief Coroner—to manage the full project lifecycle from concept and design through procurement and construction.\n\nThe Branch is also responsible for developing Treasury Board/Management Board of Cabinet submissions, quarterly reporting, and preparing the Ministry's multi-year Infrastructure Plan.",
  "what_you_bring": "Leadership Experience:\nStrategic Leadership: Proven ability to lead multidisciplinary teams and deliver results in complex, high-profile environments.\nOrganizational Development: Experienced in building organizational capacity through effective talent management and human resource strategies.\nInclusive Culture: Commitment to fostering a respectful, collaborative, and inclusive workplace that values diverse perspectives and professional growth.\n\n\nStrategic Thinking and Project Management:\nProject Management: Expertise in managing large-scale infrastructure projects through all phases of the project lifecycle.\nPolicy and Planning Acumen: Ability to align infrastructure initiatives with government priorities and navigate complex delivery processes.\nAnalytical Problem-Solving: Strong strategic thinking and analytical skills to assess risks, resolve issues, and drive continuous improvement.\n\n\nTechnical Expertise:\nInfrastructure Delivery: Deep knowledge of capital planning, procurement, and construction processes for public sector infrastructure.\nCommunity Safety Insight: Understanding of Ontario's community safety sector and infrastructure needs is a strong asset.\n\n\nCommunication and Relationship Management:\nClear &amp; Strategic Communication: Exceptional written and verbal communication skills to convey strategy, direction, and recommendations.\nConsultation &amp; Influence: Effective in leading consultations and negotiations that align stakeholders with organizational goals.\nStakeholder Engagement: Skilled in building consensus and managing relationships across ministries, agencies, and external partners.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:13.687830",
  "matched_keyword": "Manager",
  "match_score": 100.0
}