{
  "job_id": "236602",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=236602",
  "title": "Manager, Finance and Administrative Services",
  "organization": "Ontario Provincial Police",
  "division": "Investigations and Organized Crime Command - Operations Support Centre",
  "city": "Orillia",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Permanent",
  "job_code": "M1008A - Prog Planning & Evaluation07",
  "salary": "$92,920.00 - $135,056.00 Per year",
  "salary_min": 92920.0,
  "salary_max": 135056.0,
  "salary_period": "year",
  "apply_by": "2025-11-21T23:59:00",
  "posted_on": "2025-11-06T00:00:00",
  "position_details": "1 English Permanent, 777 Memorial Ave, Orillia, Central Region, Criminal Record and Judicial Matters Check (Fingerprint Based)",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Management and General",
  "note": "Note:",
  "about_the_job": "Create the work environment:\n\nIn the Ontario Provincial Police, we hold our leaders to the highest standards, expecting them to embody authenticity, accountability, and courage in every action and decision. It will be your responsibility to create a work environment and team culture that ignites innovation, nurtures collaboration and champions inclusivity by creating a diverse, anti-racist and accessible workplace that is free from discrimination and harassment. By aligning your choices with these values, you will create a vibrant work environment where every individual can thrive.\n\nDeliver on Business Goals:\n\nYour leadership will be crucial in guiding the team towards the achievement of its business goals. It will be your responsibility to inspire and motivate your team to deliver their best performance and align the team's daily actions with the strategic vision of the Bureau.\n\nIn this role, you will:&nbsp;\n\n• Lead and coordinate financial administration, planning, compliance, and human resources management.\n• Support the mandates of the IOC Operations Support Centre.\n• Develop financial and HR policies, advising senior management on financial strategy and risk.\n• Oversee procurement, inventory and asset management.\n• Ensure efficient, cost-effective service delivery aligned with legislative and organizational goals.",
  "what_you_bring": "Mandatory requirements:\nAbility to pass an OPP background/ security investigation.\n\n\nLeadership Skills:\n• Ability to provide strategic leadership to multidisciplinary teams across the team, ensuring alignment with organizational goals and operational excellence.\n• Ability to foster a values-based, inclusive, and high-performing team culture by setting clear expectations, evaluating performance, addressing employee relations, and making key staffing decisions.\n• Ability to lead complex planning and evaluation processes, including business, financial, and strategic planning, while ensuring compliance with legal, regulatory, and policy frameworks.\n• Ability to represent the organization on internal and external committees, promoting collaboration and innovation in service delivery and resource management.\n\n\nFinancial Management:\n• Ability to oversee the development and implementation of financial planning, controllership frameworks, and multi-year business plans to support operational mandates.\n• Ability to manage operational and project budgets, identify resource needs, and contribute to long-term financial planning and risk mitigation strategies.\n• Ability to provide expert financial advice to senior leadership, ensuring sound decision-making and fiscal accountability.\n\n\nProcurement and Asset Management:\n• Ability to direct end-to-end procurement, inventory, and asset management operations, ensuring timely, efficient, and cost-effective service delivery.\n• Ability to lead planning and implementation of inventory control projects, optimizing supply chain processes and identifying opportunities for savings and operational improvements.\n• Ability to collaborate to manage purchasing, monitor supply levels, and ensure compliance with procurement policies and standards.\n\n\nRelationship Management and&nbsp;Communication Skills:\n• Ability to build and maintain strong relationships with internal and external stakeholders to coordinate shared interests and enhance service delivery.\n• Demonstrated ability to serve as the primary liaison for the section.\n• Ability to communicate program deliverables and strategic priorities effectively to team members and senior leadership, fostering transparency and engagement.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:37.337244",
  "matched_keyword": "Manager",
  "match_score": 100.0
}