{
  "job_id": "235001",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235001",
  "title": "Lead Engineer, Programs Projects (Asset Management)",
  "organization": "Ontario Clean Water Agency",
  "division": "Business and Asset Management Standards Group",
  "city": "Mississauga",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Temporary (6 months with a possibility of extension)",
  "job_code": "PE0411 - Barg-Eng 04 Environment",
  "salary": "$100,927.00 - $151,384.00 Per year",
  "salary_min": 100927.0,
  "salary_max": 151384.0,
  "salary_period": "year",
  "apply_by": "2025-11-14T23:59:00",
  "posted_on": "2025-10-30T00:00:00",
  "position_details": "1 English Temporary, duration up to 6 months, 2085, Hurontario St, Mississauga, Central Region",
  "compensation_group": "Professional Engineers, Government of Ontario",
  "work_hours": "Schedule 6",
  "category": "Engineering",
  "note": "Note:",
  "about_the_job": "• Provide specialized engineering leadership and applied theoretical and practical subject matter expertise for the asset management of municipal and industrial water and wastewater systems.\n• Lead and/or conduct comprehensive asset inventory and validation, performance monitoring, asset management plans, capital planning, lifecycle analysis and strategic planning, rate studies and financial plans for water and wastewater plants. \n• Develop engineering opportunities and foster client relationships in support of the Agency's business goals. \n• Mentor engineers and asset management specialists at all levels and create opportunities for growth and development. \n• Prepare technical reports/memos/proposals with recommendations and solutions related to these areas. \n• Provide expert opinion to stakeholders regarding asset management (engineering calculations and modifications), environmental regulations and engineering and operational guidelines. \n• Review engineering documents to ensure compliance with legislation and standards and provide asset management recommendations in design and operations.\n• Plan and evaluate asset management strategies and introduce business efficiencies through best practices concepts to reduce costs and maximize return on investment. \n• Coordinate with engineers, technical staff and/or partners to ensure project needs are met in a timely and effective manner. \n• Lead and oversee the planning and delivery of OCWA's water and wastewater treatment asset management projects.\n• Support the development of asset management related projects to establish project objectives, ensure that project timelines and commitments are being met in accordance with engineering technical standards.\n• Prepare regular and ad hoc project status reports for the Director; identify and resolve project issues, and ensure the successful and timely completion of all projects/initiatives.\n• Provide asset management input and review in support of local hubs.\n• Provide onsite and remote technical advice, expertise, support and guidance across Ontario and work to optimize asset management in water and wastewater treatment plants alongside local hub teams.",
  "what_you_bring": "Mandatory requirements:\n• Licensed Professional Engineer by Professional Engineers of Ontario (PEO) in good standing.\n• A valid ‘G' driver's licence or equivalent as recognized by the province of Ontario. \n• Required to travel including to remote locations through various modes of transportation. \n• Chemical/Civil/Environmental Engineering degree from a well-recognized engineering university will be considered as an asset.\n• Carry and maintain assigned OPS assets. \n• Work outside in varied weather and climate conditions when required in the field. \n• To use in the prescribed circumstances/manner all prescribed safety materials, equipment, devices, and clothing.\n\n\nKnowledge::\n• Technical knowledge of the theories, principles and practices of Chemical, Civil or Environmental engineering discipline, wastewater and /or water related fields, engineering design and analyses of complex wastewater and water systems to lead the asset management of industrial/municipal water and wastewater facilities. \n• Knowledge of engineering design and operation of complex water and wastewater systems and the policies and regulations pertaining to asset management. \n• Private sector, academic and international advances and innovations in asset management in municipal and industrial water and wastewater treatment. \n• Federal and provincial legislation and regulations, guidelines and sound best management asset management practices related to the municipal and environmental areas for compliance of water and wastewater.\n• Computers and related asset management software to conduct analysis, monitor work progress and prepare reports. Software applications such as Maximo, word processing, PowerPoint, spreadsheets, and database packages to address data, conduct analysis and prepare reports, briefing materials and presentations.\n• Knowledge of government approval processes, protocols/practices and evaluation techniques to manage the planning, implementation and evaluation of assigned projects. \n• Knowledge of Project Management methodologies to successfully deliver projects within the group business model. \n• Maintain and improve knowledge and application of new asset management technologies to improve water and wastewater treatment plant operations. \n• Knowledge of computer applications and related engineering or data manipulation/analysis software to conduct analysis, monitor work progress and prepare reports. Support the Agency's Work Management System, including the asset registry, preventative maintenance program, running models to determine long term financial and asset implications based on various short term capital maintenance limitations, and overall application improvements.\n\n\nSkills and Ability include::\n• Excellent communication and negotiation skills.\n• Demonstrated analytical, consultation and problem solving skills.\n• Excellent qualitative and quantitative research, planning and evaluating skills.\n• Proficiency in strategically identifying asset management needs for the Agency.\n• Excellent presentation skills with demonstrated ability to make recommendations for asset management initiatives to multiple audiences including technical staff and elected officials. \n• Ability to prepare proposals, technical documents, user manuals and guidelines.\n• Exceptional organizational skills with demonstrated ability to prioritize well and meet strict deadlines.\n\n\nHow to Apply:\n1. You must apply by e-mail and the job competition quoted in the subject line.\n2. You must show how you meet what we are looking for clearly, completely and concisely; provide your PEO digital signature; we rely on the information you provide to us.\n3. OPS employees are required to quote their WIN EMPLOYEE ID number when applying.\n\n\nOntario Clean Water Agency is an inclusive employer.:\nWe will accommodate your needs under the Ontario Human Rights Code\n\nThe Ontario Clean Water Agency is an agency of the Province of Ontario, reporting to the Ministry of the Environment, Conservation and Parks. In 2023, OCWA staff treated water and wastewater, and provided other technical services for 318 clients in the province including 169 municipalities, 16 First Nations, 108 commercial and industrial clients and 25 government and institutional clients. Municipal clients range in size from populations as large as 1.5 million in the Region of Peel to as small as 2,400 in Moose Factory. This broad scope of experience ensures OCWA has the expertise to solve any issues that may arise, in any size or type of treatment process in the province. Our Agency has grown its municipal client base every year over the past 30 years is proof of this value. We continue to focus on our people and strategies to attract and retain competent staff.\n\nNote: Thank you for your interest, we will contact you only if we choose you for further screening or an interview.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:07.634362",
  "matched_keyword": "Manager",
  "match_score": 88.0
}