{
  "job_id": "235898",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235898",
  "title": "Amended - Policy Advisor",
  "organization": "Ministry of Transportation",
  "division": "Transit Division",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "5 Permanent, 6 Temporary up to 12 months",
  "job_code": "4A007 - Policy04",
  "salary": "$73,531.00 - $102,803.00 Per year",
  "salary_min": 73531.0,
  "salary_max": 102803.0,
  "salary_period": "year",
  "apply_by": "2025-11-17T23:59:00",
  "posted_on": "2025-10-31T00:00:00",
  "position_details": "5 English Permanent, 777 Bay St, Toronto, Toronto Region\n6 English Temporary, duration up to 12 months, 777 Bay St, Toronto, Toronto Region",
  "compensation_group": "Association of Management, Administrative and Professional Crown Employees of Ontario",
  "work_hours": "Schedule 6",
  "category": "Policy and Analysis",
  "note": "Note:",
  "about_the_job": "As a Policy Advisor, you will: \n• conduct research to help develop transit policies and programs.\n• review and support funding applications from municipalities for transit projects.\n• work with local governments and other partners to share information and answer questions.\n• track trends and data to help improve transit services across the province.\n• prepare reports and communications for senior leaders and stakeholders.",
  "what_you_bring": "Policy Experience:\nYou have experience with:\n• policy and legislative processes\n• program development and implementation\n• applying policy and research tools, methods and techniques\n• interpreting and applying policy, procedures and legislation\n\n\nResearch, evaluation and analysis:\nYou can:\n• apply experience with various research methodologies and techniques to gather qualitative and quantitative data, conduct environmental scans and identify trends and emerging issues\n• contribute to the development of innovative programs, implementation plans and standards/guidelines\n• demonstrate sound judgment, sensitivity and a high degree of political acuity\n• assess the effectiveness of policies/programs against Ministry initiatives and goals for evidence-based recommendations\n\n\nRelationship building and communication:\nYou have:\n• experience with creating and managing relationships with internal and external partners\n• consultation skills and can provide appropriate advice on policies, standards and programs to stakeholders\n• developed communication skills to respond to issues, provide recommendation and prepare reports using a variety of computer software\n• presentation skills to create, lead and present research findings to senior management\n\n\nPlanning and organizational:\nYou can:\n• plan, organize, and manage multiple tasks with competing deadlines ands shifting priorities\n• participate in project planning and tracking",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:55.504535",
  "matched_keyword": "Policy Advisor",
  "match_score": 100.0
}