{
  "job_id": "236445",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=236445",
  "title": "Integrated Resources Management (IRM) Technical Specialist - Bilingual (English/French)",
  "organization": "Ministry of Natural Resources",
  "division": "Regional Operations Division",
  "city": "North Bay",
  "posting_status": "Open",
  "position_language": "Bilingual English/French",
  "job_term": "1 Permanent",
  "job_code": "41111 - Resource Technician Sr 2 (B/U)",
  "salary": "$1,265.02 - $1,452.35 Per week*\n*Indicates the salary listed as per the OPSEU Collective Agreement.",
  "salary_min": 1265.02,
  "salary_max": 1452.35,
  "salary_period": "week",
  "apply_by": "2025-11-20T23:59:00",
  "posted_on": "2025-11-05T00:00:00",
  "position_details": "1 Bilingual English/French Permanent, 875 Gormanville Rd, North Bay, North Region",
  "compensation_group": "Ontario Public Service Employees Union",
  "work_hours": "Schedule 6",
  "category": "Lands and Resources",
  "note": "Note:",
  "about_the_job": "• lead and support the delivery of the regulatory aspects of MNR's forestry, fish and wildlife,&nbsp;lands and&nbsp;waters, and&nbsp;aggregate&nbsp;programs (e.g. via planning, licensing, compliance and inspections)\n• apply risk-based approaches and your innovative problem-solving skills to guide the delivery of the Ministry's compliance activities \n• play a key role in ensuring public safety and sustainable natural resource management through the delivery of various operational programs (e.g. flood/emergency response, dam/fishway operations, prevention of human and wildlife conflict)\n• share your natural resource management technical expertise with colleagues/management, as well as a wide variety of clients including the public, industry representatives and Indigenous communities\n\nLearn more about the role&nbsp;here!",
  "what_you_bring": "Mandatory requirement::\n• You must have a valid class 'G' driver's licence or equivalent, as recognized by the Province of Ontario to visit sites, usually in rural or remote settings. The offer of employment is conditional upon the successful candidates providing proof that they have a valid driver's licence upon being hired.\n• You must possess verbal French language skills at the advanced level. Your proficiency level will be confirmed before hire.\n\n\nCommunication and interpersonal skills::\n• You have experience in developing and maintaining positive business relationships, that enable you to collaborate effectively with clients, colleagues, and partners.\n• You can effectively communicate technical information to diverse audiences where the subject matter or organizational position may be contentious. \n• You have demonstrated the ability to both contribute to, and strengthen, high-performing teams.\n\n\nClient service delivery excellence::\n• You have strong client service and service delivery skills, enabling you to work well in a fast-paced environment. \n• You are resourceful and have well developed analytical/problem solving skills.\n• You can lead and support the delivery of organizational priorities using a collaborative approach.\n\n\nProgram expertise::\n• You can learn new, technically complex information, legislation and/or policies quickly where this information could be used to inform permitting, compliance or other client service functions.\n• You have a broad base of natural resource management technical expertise in one or more of the following program areas: \n- Forestry\n- Fish and wildlife (including managing human and wildlife conflicts)\n- Public land \n- Dam operations/emergency management \n- Aggregates\n\n\nCompliance and field experience::\n• You have experience conducting regulatory compliance activities using a risk-based approach, including using education and outreach to gain voluntary compliance.\n\n\nPlanning and coordination skills::\n• You can plan, coordinate and implement team activities that deliver organizational priorities.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:49.433399",
  "matched_keyword": "Manager",
  "match_score": 88.0
}