{
  "job_id": "235262",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235262",
  "title": "Senior Economic Officer - New York and Mexico",
  "organization": "Ministry of Economic Development, Job Creation and Trade",
  "division": "Trade and International Engagement Division / International Representation Branch",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "2 Temporary - up to 36 months",
  "job_code": "8A008N - ProgPlanSrEconOffr08",
  "salary": "$103,051.00 - $158,763.00 Per year",
  "salary_min": 103051.0,
  "salary_max": 158763.0,
  "salary_period": "year",
  "apply_by": "2025-11-17T23:59:00",
  "posted_on": "2025-10-27T00:00:00",
  "position_details": "2 English Temporary, duration up to 36 months, 777 Bay St, Toronto, Toronto Region",
  "compensation_group": "Association of Management, Administrative and Professional Crown Employees of Ontario",
  "work_hours": "Schedule 6",
  "category": "Finance and Economics",
  "note": "Note:",
  "about_the_job": "In both positions, you will:\n\n• Promote Ontario as a destination for foreign direct investment and a partner in international trade\n• Collaborate with provincial, federal, and international partners to advance Ontario's economic interests\n• Support incoming business delegations and high-level trade missions\n• Provide strategic advice to senior government and business leaders\n• Share market intelligence and insights to inform Ontario's trade strategies\n• Raise Ontario's profile through media, social media, and public speaking\n• Work with ministries, governments, businesses, and academic institutions to identify opportunities\n\nLocation-Specific Focus:\n\n• New York City - You'll focus on building Ontario's business relationships in New York and neighbouring U.S. territories, including Connecticut, Delaware, Maine, Massachusetts, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island, Vermont. You'll also help shape annual programming and strategic priorities for the region.\n• Mexico City - You'll lead Ontario's engagement in Mexico, helping define trade and investment strategies and implementing annual programming to support Ontario's economic goals.\n\nNote:\n\nNew York: you will be working at the Canadian Consulate General in New York City, USA.\nMexico: you will be working at the Canadian Embassy in Mexico City, Mexico.",
  "what_you_bring": "Mandatory requirements:\n• you have the ability to obtain and maintain Canadian Diplomatic Passport and Diplomatic Accreditation / Visa in host country(cannot hold citizenship of host country)\nNote: the above-noted requirement will also apply to any family members that may accompany the successful candidate to the host country\n• you are a Canadian Citizen\n• you have the ability to obtain and maintain Top Secret Security Clearance from the Government of Canada\n• you are able to undergo Medical / Fitness for Duty Assessment\n•Mexico location only - you are proficient in English as well as oral and written Spanish. Proficiency level will be verified by an Ontario Public Service approved evaluator.\n\n\nIndustry Knowledge::\n• you have extensive knowledge of Ontario's business, economic and innovation interests and objectives in New York or Mexico to attract investment and trade and build Ontario's innovation ecosystem\n• you have sound knowledge of Ontario's and the territory's governments, economies, decision-making processes and business cultures\n• you have knowledge of policy development, decision-making and program delivery processes\n\n\nStakeholder Management and Consultation Skills::\n• you can provide high-level consultation, advice and recommendations to senior officials to promote Ontario's business interests in the territory\n• you have negotiation skills to guide and influence stakeholder decisions\n• you demonstrate a high degree of political acuity to understand Ontario and the territory's socio-economic and political issues and identify potential opportunities, issues and impacts\n\n\nProject and Issues Management Skills::\n• you have analytical and problem-solving skills to synthesize complex and sensitive material, and handle a wide range of business issues\n• you have leadership and project management skills to lead complex projects and initiatives\n\n\nCommunication and Interpersonal Skills::\n• you have interpersonal and oral communication skills to give presentations, chair meetings and represent the organization\n• you have written communication skills to write high-level correspondence, briefing notes and reports\n\n\nComputer Proficiency::\n• you can prepare spreadsheets, correspondence, conduct research and prepare reports using computer software",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:42:19.737192",
  "matched_keyword": "Economist",
  "match_score": 88.0
}