{
  "job_id": "235727",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=235727",
  "title": "Assistant Health Care Manager",
  "organization": "Ministry of the Solicitor General",
  "division": "Southwest Detention Centre",
  "city": "Maidstone",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Temporary up to 12 months with the possibility of extension",
  "job_code": "I0912E - Social Services102",
  "salary": "$82,217.00 - $121,155.00 Per year",
  "salary_min": 82217.0,
  "salary_max": 121155.0,
  "salary_period": "year",
  "apply_by": "2025-11-17T23:59:00",
  "posted_on": "2025-10-31T00:00:00",
  "position_details": "1 English Temporary, duration up to 12 months, 4819 8th Concession Rd, RR3, Maidstone, West Region, Vulnerable Sector Check, Credit History Check, Local Police Databases Search, PIP/NICHE/RMS",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Health and Social Services",
  "note": "Note:",
  "about_the_job": "In this role, you will use your management and leadership skills, coupled with your knowledge of health care processes to assist in the oversight and delivery of patient-centred health care to inmates.\n\nSpecifically, you will:\n\n• assist in the development, implementation, review and evaluation of health care programs and services to ensure high standards are maintained, coordinating health care services/programs with other disciplines\n• assist in the development, planning and implementation of the delivery of health services education programs for inmates and staff\n• supervise a team of nurses in the provision of health care services, ensuring a safe environment for both inmates and staff\n• supervise the maintenance, distribution and security of all medications, including narcotic and controlled drugs, equipment, and medical and treatment supplies\n• supervise Medical Clerks, assigning duties, checking quality of work, and ensuring records are properly maintained to standards\n• provide coaching and counselling, and report inability to meet College of Nurses of Ontario standards\n• monitor adherence to budget allotments, maintaining and controlling equipment inventories\n\nLeadership in the OPS\n\nThe Ontario Public Service (OPS) Leadership Behaviours defines what it means to be a leader through the following expected behaviours and attributes:\n• You are committed to the responsibilities of being a leader by demonstrating authenticity, accountability and courage.\n• You are innovative by embracing positive disruption, maintaining a future mindset and leading with a common purpose.\n• You are collaborative by driving people-centered outcomes, being inclusive and helping staff and colleagues grow, every day.",
  "what_you_bring": "Mandatory requirements:\n• you are a Registered Nurse (RN) in good standing with the College of Nurses of Ontario\n\n\nLeadership, Management and Organizational Skills:\n• you have administrative and leadership skills to be responsible for the efficient and effective administration of health care programs and services on an assigned shift\n• you can ensure professional standards are met by developing, maintaining and evaluating procedures and methods for delivery of health services\n• you can lead the development and improvement of health care services and programs\n• you have leadership skills to supervise a team of Nurses, providing mentoring and coaching as needed\n\n\nSpecialized Knowledge:\n• you have knowledge of nursing administration, and health care programs and operations\n• you have knowledge of health care professional regulatory bodies, practices and standards to ensure compliance and can interpret relevant legislation (e.g. Regulated Health Care Professions Act, Health Care Consent Act, Mental Health Act)\n• you have the ability to acquire knowledge of correctional philosophies, policies and procedures relating to health care services in a security-based adult correctional institution\n• you have a general level of understanding about emergency response procedures\n\n\nRelationship Management and Communication Skills:\n• you have interpersonal and communication skills to respond to service delivery issues with inmates and their families, community agencies and organizations\n• you demonstrate the ability to exchange information and provide advice on offender needs to medical practitioners, and to discuss medical issues with offender family members.\n• you can liaise effectively with community partners such as Mental Health centres, Public Health departments, private physicians/specialists, and hospitals\n\n\nEvaluation and Analytical Skills:\n• you can maintain records and statistics to identify trends that have critical health care service delivery, policy and planning implications.\n• you can evaluate and ensure consistency of professional standards and procedures of health care are provided and maintained\n• you can assess risks and make sound decisions surrounding continued health care and treatment needs",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:58.511591",
  "matched_keyword": "Manager",
  "match_score": 100.0
}