{
  "job_id": "234315",
  "url": "https://www.gojobs.gov.on.ca/Preview.aspx?Language=English&JobID=234315",
  "title": "Manager, Volume-Based Acute Services",
  "organization": "Ministry of Health",
  "division": "Hospitals and Capital Division",
  "city": "Toronto",
  "posting_status": "Open",
  "position_language": "English",
  "job_term": "1 Temporary contract/assignment up to 24 months",
  "job_code": "M1108A - Prog Planning & Evaluation08",
  "salary": "$105,307.00 - $148,429.00 Per year",
  "salary_min": 105307.0,
  "salary_max": 148429.0,
  "salary_period": "year",
  "apply_by": "2025-11-21T23:59:00",
  "posted_on": "2025-11-06T00:00:00",
  "position_details": "1 English Temporary, duration up to 24 months, 56 Wellesley St, Toronto, Toronto Region",
  "compensation_group": "Management Compensation Plan",
  "work_hours": "Schedule 6",
  "category": "Management and General",
  "note": "Note:",
  "about_the_job": "We hold our leaders to high standards because we believe in their potential to drive meaningful change. In the Ontario Public Service, leadership means showing up with authenticity, acting with integrity, and having the courage to do what's right—even when it's hard.\n\nAs a leader, you'll be expected to create a team culture that encourages innovation, supports collaboration, and champions inclusion. You'll help build a diverse, anti-racist, and accessible workplace where everyone feels safe, respected, and able to thrive.\n\nLeadership is about impact—and in this role, you'll have the opportunity to make a meaningful one. You will:\n\nLead the planning, implementation, and evaluation of specialized hospital funding programs including Wait Times, Quality-Based Procedures (QBPs) and Diagnostic Imaging (MRI and CT).\nOversee funding allocations and ensure accountability for specialized hospital services and programs. \nBuild and maintain relationships with key stakeholders, including hospitals, clinicians, internal ministry partners, and external advisory bodies.\nProvide strategic advice and recommendations to senior leadership on program development, funding models, and implementation strategies.\nDrive continuous improvement, efficiency and transformational change in program delivery and operational processes.\nLead a team through change with empathy, emotional intelligence, and a trust-building approach to leadership.Meet Your New Team\n\nThis position reports to Kristin Taylor.\n\nThe Provincial Programs Branch is led by Kristin Taylor, a seasoned leader with 17 years of experience in the Ministry of Health. As Director, she oversees a team of 50 staff across six units, managing a diverse portfolio ranging from HIV to Naloxone to Cancer to Newborn Screening to Bariatrics to Surgical Wait Times. In a fast paced and occasionally chaotic environment, Kristin brings a sense of calm as well as a sense of humour. Her leadership fosters high performing and collaborative teams who make positive contributions to the healthcare system every day. Managing $8B in healthcare funding with such a varied portfolio requires strong relationships and trust among the team and Kristin prides herself on the positive culture of her branch and the close relationships that are built within. Kristin brings a unique set of skills to the table to support her team. She is a problem solver and can cut through the noise to help find solutions. While she has significant institutional knowledge, she is not afraid to take new approaches and rethink the way things are done. Known for a transparent and authentic leadership style, Kristin fosters a team environment grounded in open communication, shared goals, and mutual respect - where egos are left at the door and collaboration thrives.\n\nThe Provincial Programs Branch (PPB) provides oversight for a wide range of highly specialized or emerging clinical health services that require provincial leadership, governance, and coordination to meet the health care needs of Ontarians.\n\nThe Volume-Based Acute Services (VBAS) unit manages a portfolio of hospital based provincial programs that are typically funded by procedure volume, including Hospital Wait Times, Quality-Based Procedures (QBPs) and MRI and CT imaging. The unit works closely with the Ontario Health agency along with a broad range of hospital leadership and clinical experts who provide the ministry with expert advice and guidance.\n\nInformation Session\n\nJoin us for an information session on Microsoft Teams on Friday, November 14th at 12:00 where you will have a chance to find out more about the job, the team and the Branch.\n\nBe sure you add this event to your calendar, so you don't miss out!\n\n Click here to join the meeting\n\nMeeting ID: 279 624 233 677 \nPasscode: t9yx7kq7 \n\nIf you can't make it - no problem. Attendance at the session is optional and will have no impact on hiring decisions.",
  "what_you_bring": "Leadership Experience::\nTeam and Change Management: Experience leading professional teams, fostering inclusive environments, and supporting staff through change.\nCompassionate and Empathetic Leadership: Lead with empathy, compassion, and a trust-building approach to support your team. \nStrategic Oversight: Skilled in setting direction and aligning team efforts with organizational priorities. \nMentorship and Development: Committed to coaching and developing staff to achieve high performance and growth.\n\n\nProgram and Policy Expertise::\nProgram Design and Delivery: Experience developing, implementing, and evaluating complex health programs. \nPolicy Development: Knowledge of health system policy frameworks and evidence-informed funding models. \nCompliance and Accountability: Understanding of legislative requirements and program accountability mechanisms.\n\n\nPlanning and Project Management::\nStrategic Planning: Ability to establish objectives, manage resources, and drive operational efficiency. \nProject Management: Proven track record of leading initiatives from concept to execution. \nContinuous Improvement: Skilled in identifying opportunities for innovation and process enhancement.\n\n\nCommunications and Relationship Management::\nStakeholder Engagement: Build and maintain collaborative relationships with hospitals, clinicians, ministry partners, and external agencies. \nConsultation and Negotiation: Use effective communication and facilitation skills to build consensus, resolve issues, and support decision-making. \nClear and Compelling Communication: Translate complex information into plain language for diverse audiences, including senior leadership. \nEmotional Intelligence: Communicate with empathy, listen actively, and foster trust through respectful and thoughtful interactions.",
  "mandatory_requirements": null,
  "additional_info": null,
  "how_to_apply": null,
  "scraped_at": "2025-11-09T01:41:40.361297",
  "matched_keyword": "Manager",
  "match_score": 100.0
}