{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129203"
        },
        "metadata": {
            "job_title": "Remediation Program Engineer",
            "classification_title": "EG3 Engineer 3",
            "classification_code": "EG3",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Environment and Climate Change"
            ],
            "divisions": [
                "Environmental Programs and Remediation, Environmental Stewardship Division"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44662",
            "salary": {
                "raw_text": "EG3 $85,544.00 - $111,909.00 per year",
                "classification_code": "EG3",
                "min_amount": 85544.0,
                "max_amount": 111909.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 24, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "Manitoba Environment and Climate Change is seeking to fill two (2) regular full-time Remediation Program Engineers headquartered in Winnipeg. One position will focus on liability contaminated sites while the other will focus on quarry rehabilitation. Candidates must clearly state how they meet the qualifications and conditions of employment in their application."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must be registered or eligible for registration as a Professional Engineer with Engineers Geoscientists Manitoba (EGM) within 3 months of start date",
                "Ability to work outdoors year-round and in extreme temperatures",
                "Ability to travel within the province by ground and air, which may require overnight stays and possibly within a camp environment",
                "While at outdoor work sites, may be working alone or in remote environments with exposure to heavy construction equipment, noise, dust, hand/power tools, moving equipment, slip-trip-fall, carrying/twisting, insects, excavations, chemical and assorted types of waste exposures, animals, open water, vegetation and sharp objects",
                "Possess a valid class 5 driver’s license"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Undergraduate degree in Engineering (e.g. Environmental, Biosystems Engineering, Geotechnical) and a combination of education and specialized technical training may also be considered",
                "Must have appropriate scope-of-practice in (discipline/sub-discipline) particularly in site remediation, contaminated site management, or quarries",
                "Experience reading and interpreting construction plans, specifications and contract documents",
                "Experience with planning, design and construction of projects and writing various technical documents to support project planning and execution",
                "Ability to learn and work with appropriate industry software tools and technology to successfully complete assignments/projects",
                "Ability to prepare information for others regarding media inquiries and litigation related matters",
                "Ability to undertake independent research and develop proposals to introduce new industry innovations into department operations",
                "Ability to foster effective relationships with Indigenous communities and engage in meaningful Crown consultation while applying the principles of reconciliation"
            ],
            "desired": [
                "Experience and/or relevant training in project management",
                "Verbal and written proficiency in French"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "Remediation Program Engineers provide engineering services related to site remediation and rehabilitation in Manitoba. These positions include developing strategies and seeking approvals from relevant authorities to address outstanding concerns, verification of construction and engineering works by third parties, and procurement of specialised engineering consulting and construction rehabilitation services to investigate, assess, design, plan, and implement works and programs intended to minimise long term financial and environmental risks for the province.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44662",
                "unit": "Talent Acquisition - Executive Recruitment",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3C 0C4"
                ],
                "phone": "204-945-6892",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129203",
        "scraped_at": "2025-11-09T16:32:46.513926",
        "matched_keyword": "Program Analyst",
        "match_score": 85
    }
}