{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129176"
        },
        "metadata": {
            "job_title": "Policy & Program Analyst (Multiple Positions)",
            "classification_title": "PM2 Policy and Program Analyst 2",
            "classification_code": "PM2",
            "employment_types": [
                "Regular/full-time",
                "Term/full-time"
            ],
            "departments": [
                "Various Departments"
            ],
            "divisions": [
                "Various locations, Various Divisions"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44694",
            "salary": {
                "raw_text": "PM2 $68,106.00 - $87,851.00 per year",
                "classification_code": "PM2",
                "min_amount": 68106.0,
                "max_amount": 87851.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 17, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be established to fill similar regular and term positions, which will remain in effect for 12 months.",
            "classification_flex_text": "This competition may also be used to source candidates for Policy and Program Analysts at the PM1 classification.",
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Government of Manitoba is currently seeking qualified professionals to fill multiple regular and term Policy & Program Analysts (PM2) positions throughout the various Provincial Government Departments. Some Policy & Program Analyst positions are designated as bilingual (French/English), for these positions candidates must be able to read, write and verbally communicate in both official languages.",
                "Policy & Program Analysts at the PM2 level are involved at all stages of the policy and program development cycle including research, analysis, consultation, developing recommendations and evaluation of Manitoba government programs and policies. In addition, Policy & Program Analysts may provide centralized corporate support to their Department, manage special projects and initiatives, maintain responsibilities for strategic planning and corporate business processes, oversee communications, support public correspondence, and manage information systems.",
                "The Manitoba Government has a comprehensive benefit package which includes extended health care, health spending account, dental care, vision care, long term disability insurance, group life insurance, maternity/paternity leave, family related leave, and a defined pension plan (some pension plans allow for portability between the Civil Service Superannuation Board and employers)."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must be willing and able to work extended hours, including holidays, evenings and weekends as required.",
                "Must be able to travel by ground and air across Manitoba with possible overnight stays, as required. (required for some positions)",
                "Must be able to provide and maintain a satisfactory Criminal Record Check. (required for some positions)",
                "Must be able to provide and maintain a satisfactory Child Abuse and Adult Abuse Registry Check. (required for some positions)",
                "Must possess and maintain a valid full Class 5F Manitoba Driver's Licence with access to a personal vehicle. (required for some positions)",
                "Must be able to clear an Enhanced Security Check. (required for some positions)"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Post-secondary Degree or Diploma in Public or Business Administration, Social Sciences, Education, Law, Economics, Environmental Studies, or a related discipline. An equivalent combination of education, training and work experience may also be considered.",
                "Experience conducting research and analysis on legislation, regulations, policies and/or programs to make fact-based assessments or recommendations preferably within a work setting.",
                "Experience interpreting and applying policy, regulations and/or legislation",
                "Excellent written communication skills with experience writing a variety of documents and reports (such as reports, memos, letters) for different audiences.",
                "Strong verbal communication skills to effectively communicate with various stakeholders.",
                "Strong organizational and time management skills with the ability to manage multiple priorities with competing deadlines.",
                "Strong interpersonal skills to develop and maintain strong working relationships with various stakeholders.",
                "Ability to navigate sensitive issues with tact and diplomacy.",
                "Ability to work independently with minimal supervision.",
                "Experience working on projects preferably within a work setting, and preferably with knowledge of project management principles.",
                "Knowledge of, and sensitivity to, Indigenous issues to build relationships with Indigenous communities and organizations.",
                "Ability to read, write and verbally communicate in French. (required for some positions)"
            ],
            "desired": [],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "Reporting to their assigned Manager, Coordinator or Supervisor, the Policy & Program Analyst (PM2) will be responsible to research, review, evaluate and advise the applicable department on the feasibility of major programs and policy, and ensures consistency of programs with intended policy.",
            "items": [
                "Other key duties may include: contributing to the planning and execution of the Department’s strategic initiatives; drafting various documents for departmental senior management or senior analysts; participating in project management and strategic planning to assist in designing and developing research projects/studies; developing methodologies in the preparation of project budgets; participating in intra/interdepartmental project teams, committees and working groups; undertaking research to assist in planning, developing, implementing, monitoring and evaluating legislation, policies and initiatives; suggesting policy and program alternatives, recommendations and methods to achieve established objectives; consulting with external organizations to share information concerning programs in relation to government policy; and providing support to stakeholders, management, staff and branches by undertaking evidence-based research, analysis and evaluations."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44694",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129176",
        "scraped_at": "2025-11-09T16:32:26.530422",
        "matched_keyword": "Policy Analyst",
        "match_score": 95
    }
}