{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129121"
        },
        "metadata": {
            "job_title": "Senior Waterway Planning Engineer",
            "classification_title": "EG4 Engineer 4",
            "classification_code": "EG4",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Department of Transportation and Infrastructure"
            ],
            "divisions": [
                "Hydrologic Forecasting and Water Management, Engineering and Technical Services"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44658",
            "salary": {
                "raw_text": "EG4 $95,303.00 - $124,732.00 per year",
                "classification_code": "EG4",
                "min_amount": 95303.0,
                "max_amount": 124732.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 16, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Hydrologic Forecasting and Water Management Branch of the Department of Transportation and Infrastructure is seeking qualified candidates for the role of Senior Waterway Planning Engineer.",
                "To be considered for this competition, you must submit an Application Screening Form. Complete the application screening form at the link below or contact Human Resource Services under “Apply to” to request a copy. The selection board will rely on information provided in this form to determine whether a candidate will be invited for further assessment. In addition to the application screening form, please submit a cover letter and your resume."
            ]
        },
        "benefits": {
            "summary_paragraph": "Click here to access the application form.",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Bachelor’s degree in Civil/Water Resources Engineering",
                "Must be registered (or be eligible for registration) as a Professional Engineer with Engineers Geoscientists Manitoba (EGM)",
                "Must be willing and able to travel within Manitoba as required",
                "Must be able to occasionally work in an outdoor rough terrain environment in both winter and summer in extreme weather conditions"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Extensive experience in project management including managing extensive flood mitigation contracts, and appropriately handling project budgets and expenditures and meeting the deliverables of the project within time and budget",
                "Extensive experience in conducting hydraulic design, hydraulic modeling, water management studies and providing expert advise in problem assessment and analysis, identification of structural/infrastructure options with potential for hydraulic benefits and economic viability, and providing general and overall structural, infrastructure, and geotechnical inputs",
                "Experience undertaking technical review with a sound understanding of hydraulic and geotechnical principles and concepts of the program area (e.g. inspection, investigation, design)",
                "Working knowledge of hydraulic theories and principles, hydraulic assessment, riverbank stabilization design, slope stability design, erosion protection work design, and flood routing schemes",
                "Ability to work independently and in a team environment",
                "Strong analytical, problem solving and decision-making skills, including communicating complex and time sensitive issues with supervisor and the public",
                "Effective interpersonal skills with the ability to foster collaborative working relationship with various internal and external stakeholders",
                "Strong written communication skills including the ability to prepare technical and non-technical correspondence and reports",
                "Strong verbal communication skills"
            ],
            "desired": [],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "The Senior Waterway Planning Engineer is responsible for leading and delivering engineering planning work for flood mitigation projects. The Engineer is also responsible for management of temporary flood mitigation contracts. The Hydrologic Forecasting & Water Management Branch is responsible for producing accurate and timely hydrologic forecasts and information to the public, coordinate flood responses, assist in operation of provincial water related infrastructure for flood and drought mitigation. The branch is also responsible for conducting ice jam mitigation programs, community flood protection works, flood mitigation studies, providing hydrological analysis to other branches and administration of designated flood areas.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44658",
                "unit": "Talent Acquisition - Executive Recruitment",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3C 0C4"
                ],
                "phone": "204-945-6892",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "Click here to access the application form.",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44658.docx",
            "instruction_text": [
                "Click here to access the application form. WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129121",
        "scraped_at": "2025-11-09T16:34:18.038673",
        "matched_keyword": "Senior Analyst",
        "match_score": 85
    }
}