{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129198"
        },
        "metadata": {
            "job_title": "Manager, Client Services",
            "classification_title": "(XO4) Administrative Officer 4",
            "classification_code": "XO4",
            "employment_types": [
                "Term/full-time"
            ],
            "departments": [
                "Department of Labour and Immigration"
            ],
            "divisions": [
                "Employment Standards, Labour"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44710",
            "salary": {
                "raw_text": "(XO4) $2,868.83 - $3,696.78 bi-weekly",
                "classification_code": "XO4",
                "min_amount": 2868.83,
                "max_amount": 3696.78,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 20, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": null,
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Employment Standards Branch provides the public with information regarding Employment Standards issues such as unpaid wages, vacation wages and termination of employment. Officers investigate complaints filed by employees about possible non-compliance with the Employment Standards Code."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must provide and maintain a satisfactory Criminal Record Check",
                "Must be able to travel throughout the province to worksites by ground, water or air transportation which may require overnight stays"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Post-secondary degree in Labour Studies, Law and/or certification from a recognized law enforcement training academy (such as Northwest Academy) and experience in the technical application of law enforcement with a focus on conducting investigations according to rules of natural justice and procedural fairness. An equivalent combination of education, training and experience may be considered",
                "Extensive experience in the interpretation and enforcement of labour legislation such as Employment Standards, Canada Labour Code, Labour Relations and Workplace Safey and Health.",
                "Extensive experience conducting investigations and/or assessing complaints in a regulatory environment.",
                "Experience supervising staff, including training, mentoring and managing the quality of work performed.",
                "Interpersonal skills with the ability to develop and maintain strong working relationships with staff, internal and external stakeholders",
                "Effective verbal communication skills and the ability to articulate ideas in a concise and effective manner.",
                "Effective written communication skills with the ability to prepare correspondence, reports, and other material.",
                "Strong organizational skills with the ability to manage multiple or competing priorities within tight time frames.",
                "Strong decision-making and problem-solving skills.",
                "Ability to work independently.",
                "Political acumen and the ability to manage confidential and politically sensitive information in an appropriate manner."
            ],
            "desired": [],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "The Manager of Client Services is responsible for the effective delivery of programs and services pertaining to the Intake Unit. This includes day to day supervision of professional staff in the discharge of Employment Standards’ mandate to investigate complaints and ensure compliance with legislation under the Branch’s administration. The services promote fair and equitable treatment in Manitoba workplaces, with significant impact on provincial employees, businesses and the general public. As a member of the Management team, the Manager of Client Services participates in decisions regarding divisional and fiscal management and program planning consistent with the mission and vision of the organization.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44710",
                "unit": "600-330 Portage Avenue",
                "branch": "Winnipeg, MB",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3C 0C4"
                ],
                "phone": "204-948-4160",
                "fax": "204-948-2193",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129198",
        "scraped_at": "2025-11-09T16:32:51.099418",
        "matched_keyword": "Manager",
        "match_score": 95
    }
}