{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129127"
        },
        "metadata": {
            "job_title": "Apprenticeship Training Coordinator - Application Form Updated",
            "classification_title": "ATC Apprenticeship Training Coordinator",
            "classification_code": null,
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Business, Mining, Trade and Job Creation"
            ],
            "divisions": [
                "Apprenticeship Manitoba, Workforce Development & Training"
            ],
            "locations": [
                "The Pas MB, Winnipeg MB"
            ],
            "advertisement_number": "44643",
            "salary": {
                "raw_text": "ATC $62,300.00 - $81,213.00 per year",
                "classification_code": null,
                "min_amount": 62300.0,
                "max_amount": 81213.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 13, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and remain in effect for 12 months. This competition may be used to appoint successful candidate(s) to current and future regular, term or acting status appointments subject to staffing approval.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "Apprenticeship Training Coordinators perform the vital function of linking with industry, training providers, employers and apprentices in carrying out specific functions under the Apprenticeship and Certification Act, General Regulation and over 50 trade regulations and by-laws.",
                "To be considered for this competition you must submit an application form. See below for further instructions."
            ]
        },
        "benefits": {
            "summary_paragraph": "Click here to access the application form.",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must provide and maintain a satisfactory Criminal Record Check & Child Abuse Registry Check",
                "A journeyperson certificate of qualification, or equivalent designation from out of province sectors",
                "Valid Manitoba Class 5F Driver's license and regular access to a reliable vehicle",
                "Must be physically capable of performing the duties of the position including sitting, standing, lifting and carrying related equipment weighing up to 20 lbs",
                "Must be willing and able to travel throughout the province of Manitoba and Canada as needed"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Experience teaching or training students/junior staff including the creation and delivery of presentations",
                "Experience interpreting and communicating guidelines, policies and procedures to the public",
                "Experience working with industry stakeholders, employers, trades people and apprentices including balancing the training and business needs of these individual groups",
                "Excellent organizational and time management skills with the ability to set priorities and meet deadlines",
                "Strong verbal communication skills with the ability to deliver presentations to a variety of audiences",
                "Strong written communication skills, including the ability to write reports",
                "Strong problem solving skills and the ability to use sound judgement",
                "Excellent interpersonal skills with the ability to work in a team environment"
            ],
            "desired": [
                "A Vocational Education Diploma or Adult Education Certificate, or equivalent experience providing teaching at an educational institution",
                "Experience directly supervising apprentices while working in a certified journeypersons role",
                "Conflict resolution skills"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "Apprenticeship Training Coordinators (ATC's) ensure the quality of technical and practical training in apprenticeship programs, monitor and administer agreements and training, invigilate examinations, and implement regulatory requirements including compulsory certification for employers and apprentices. Apprenticeship Training Coordinators are also responsible for the consultation and coordination with industry, communities, training providers and intergovernmental agencies regarding apprenticeship training needs that meet the changing labour market and demand for skilled labour in Manitoba. A detailed position description is available upon request.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44643",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "Click here to access the application form.",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44643.docx",
            "instruction_text": [
                "To be considered for this competition you must submit an application form. Complete the application form at the link below or contact Human Resource Services under “Apply to” to request a copy of the application form. The selection board will rely only on information provided in this form to determine whether a candidate will be invited for further assessment. Note: You are not required to submit a cover letter, but may be asked to submit a resume, references, or other documentation at a later point if invited for further consideration. Click here to access the application form. WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129127",
        "scraped_at": "2025-11-09T16:33:47.787918",
        "matched_keyword": "Program Coordinator",
        "match_score": 85
    }
}