{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129172"
        },
        "metadata": {
            "job_title": "Helitac Officer",
            "classification_title": "FR4 Fire Ranger 4",
            "classification_code": "FR4",
            "employment_types": [],
            "departments": [
                "Departmental"
            ],
            "divisions": [
                "32 weeks March - October"
            ],
            "locations": [
                "Lac du Bonnet MB"
            ],
            "advertisement_number": "44559",
            "salary": {
                "raw_text": "FR4 $1,910.40 - $2,095.20 bi-weekly Plus Remoteness Allowance and Qualification Pay, if applicable.",
                "classification_code": "FR4",
                "min_amount": 1910.4,
                "max_amount": 2095.2,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 10, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 6 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "Manitoba Wildfire Service is seeking a qualified candidate for the role of Helitac Officer (FR4) in the Lac du Bonnet fire area. Under the direction of the Area Fire Manager or designate, the incumbent provides leadership and supervision to Initial Attack Crews on a daily basis. The Helitac Officer coordinates, implements and directs wildfire suppression strategies, tactics, training and participates in both provincial and national deployments as and when needed."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must possess and maintain a full stage Manitoba Class 5 driver's licence or equivalent.",
                "Must be willing and able to work weekends and overtime as required.",
                "Must be physically capable of performing the duties required of this job including lifting 27 kg (60lbs).",
                "Must maintain current First Aid/CPR certification.",
                "Must be willing and able to be deployed provincially, inter-provincially or internationally."
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Experience as a Crew Leader on an Initial Attack Crew.",
                "Experience interpreting fire weather, fire behaviour and implementing wildfire suppression tactics.",
                "Experience in fire equipment maintenance and usage.",
                "Supervisory experience providing training, guidance and performance management.",
                "Knowledge of fire fighting aircraft and their capabilities.",
                "Strong leadership skills.",
                "Strong oral communication skills.",
                "Strong written communication skills."
            ],
            "desired": [
                "Knowledge of Workplace Health and Safety legislation and procedures.",
                "Knowledge of Wildfire Service policy and procedure, operational guidelines and administration practices.",
                "Completion of training in wildfire suppression courses."
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": null,
            "items": [
                "Responsible for the readiness of the Helitac Base including personnel, equipment and aircraft resources.",
                "Ensures all members of Initial Attack crews are trained within the provincial and national standards.",
                "May act as Incident Commander on forest fires.",
                "Supervise the maintenance of fire suppression equipment to the provincial standards.",
                "Complete Initial Attack Fire Reports, morning messages, DIFARS and other reports as required.",
                "Responsible for work performance of wildfire personnel.",
                "Ensure staff and workplace is compliant with workplace safety and health legislation.",
                "Supervise district work and/or construction projects as required."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44559",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129172",
        "scraped_at": "2025-11-09T16:33:38.241133",
        "matched_keyword": "Finance Officer",
        "match_score": 85
    }
}