{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129191"
        },
        "metadata": {
            "job_title": "Manager, Broadband and Public Safety Communications",
            "classification_title": "PM3 Planning and Program Analyst 3",
            "classification_code": "PM3",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Innovation and New Technology"
            ],
            "divisions": [
                "Corporate Services; Policy and Strategic Priorities"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44712",
            "salary": {
                "raw_text": "PM3 $74,839.00 - $96,438.00 per year",
                "classification_code": "PM3",
                "min_amount": 74839.0,
                "max_amount": 96438.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 16, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Manager, Broadband and Public Safety Communications provides strategic oversight and leadership in the management of government-wide programs and contracts for provision of broadband, cellular, satellite, and public safety communication technologies. This role is critical in supporting Manitoba’s digital infrastructure strategy and ensuring service reliability and quality across the province. The position also serves as a subject matter expert in communications technologies, advising on trends, challenges, and opportunities across converging technologies to inform policy development and strategic investment. This role ensures high service performance, contract compliance, and innovation in communication services delivery."
            ]
        },
        "benefits": {
            "summary_paragraph": "Click here to access the application form.",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must provide and maintain a satisfactory Criminal Record Check",
                "Must be able to work overtime when required",
                "Ability to travel within Manitoba",
                "Must possess and maintain a valid Manitoba Class 5F Driver's Licence or similar from another jurisdiction"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Post-secondary education in public administration, engineering, telecommunications, information technology, or a related field. An equivalent combination of education, training, and experience may be considered.",
                "Knowledge of broadband infrastructure, wireless, cellular, and/or satellite communication systems and emerging technologies.",
                "Experience providing policy advice or recommendations related to digital infrastructure, connectivity, or public safety communication services.",
                "Excellent verbal communication skills",
                "Excellent written communication skills with the ability to prepare executive-level documents and present to senior audiences.",
                "Experience managing projects or leading cross-functional initiatives with multiple stakeholders and tight timelines.",
                "Strong analytical skills and attention to detail",
                "Strong political acumen and the ability to manage confidential, controversial or politically sensitive information in anappropriate manner.",
                "Strong organizational and time management skills.",
                "Strong interpersonal skills with the ability to develop and maintain strong working relationships"
            ],
            "desired": [
                "Knowledge of public safety communication systems and emergency telecommunications infrastructure.",
                "Experience working in or with public sector organizations or regulatory bodies on broadband policy or telecommunications planning."
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": null,
            "items": [
                "Provide subject matter expertise on broadband, cellular, satellite, and public safety communications technologies to support cross-departmental policy development and strategic decision-making.",
                "Monitor developments in communication infrastructure and broadband technologies to provide informed recommendations to senior leadership.",
                "Lead and/or support strategic initiatives and cross-government working groups to enhance digital connectivity, broadband access, and resilience across Manitoba.",
                "Manage the contract lifecycle for the public safety communications services (PSCS) digital radio network, overseeing performance monitoring, contract renewals, risk mitigation, reporting, and vendor relationship management.",
                "Collaborate with legal, procurement, and technical teams to ensure telecommunications service agreements and broadband initiatives meet operational needs and policy priorities.",
                "Represent the department in provincial and intergovernmental forums related to digital infrastructure, broadband expansion, and emergency communication systems.",
                "Prepare and present briefing notes, policy options, and reports to executive leadership related to broadband investment, telecommunications trends, and service performance."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44712",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "Click here to access the application form.",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44712.docx",
            "instruction_text": [
                "To be considered for this competition you must submit an application form. NOTE: Only those who providethe application form will be considered. See below for further instructions. Click here to access the application form.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129191",
        "scraped_at": "2025-11-09T16:33:04.749219",
        "matched_keyword": "Manager",
        "match_score": 95
    }
}