{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129166"
        },
        "metadata": {
            "job_title": "Director of Corporate Services and Finance",
            "classification_title": "FI6 Financial Officer 6",
            "classification_code": "FI6",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Elections Manitoba"
            ],
            "divisions": [
                "Corporate Services and Finance"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44681",
            "salary": {
                "raw_text": "FI6 $84,182.00 - $109,658.00 per year",
                "classification_code": "FI6",
                "min_amount": 84182.0,
                "max_amount": 109658.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 11, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": null,
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "Elections Manitoba (EM) is an integrity-driven organization dedicated to ensuring free, fair, and accessible elections for the people of Manitoba. As an independent office of the Manitoba Legislative Assembly, EM is steadfast in upholding the core values of democracy. The team at EM is committed to fairness, integrity, respect, excellence, participation, innovation, and accountability, striving to create an environment where every voice is heard and every vote counts.",
                "We are seeking a detailed-orientation and hands-on leader to join our Senior Leadership Team as the Director of Corporate Services and Finance. This is a unique and meaningful role for someone who thrives on purpose-driven work, is committed to public service, and excels in a fast-paced environment where adaptability and sound judgment are essential.",
                "As Director, you will balance day-to-day operations with strategic oversight across the various administrative and corporate functions for Elections Manitoba as well as ensuring campaign finance is delivered as mandated in The Election Financing Act (EFA). The ideal candidate enjoys coaching, implementing, and coordinating corporate administrative services and finance functions.",
                "If you’re driven by results and developing others, we encourage you to apply. This is more than a leadership role — it’s an opportunity to serve the people of Manitoba with integrity and purpose."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "The incumbent must be, and remain, politically non-partisan in both perception and fact",
                "Satisfactory criminal records check",
                "Must possess a valid Manitoba Driver’s License with access to a vehicle to use for work-related purposes",
                "Ability and willingness to travel throughout Manitoba when operations require"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [],
            "desired": [],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "As a member of the Senior Leadership Team, the Director of Corporate Services and Finance is accountable for coaching, performance management and mentoring staff across two portfolios; administrative and corporate functions for EM as well as ensuring campaign finance is delivered as mandated in The Election Financing Act (EFA). The position provides oversight of innovative and flexible solutions, processes, practices to manage and implement financial and administrative services, campaign review programs, information sharing, approval of and development of legislative requirements for different stakeholders, and internal controls for the cost-effective delivery of corporate and electoral events.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44681",
                "unit": "Manitoba Legislative Assembly",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg MB",
                    ",",
                    "R3C 3R6"
                ],
                "phone": "204-945-7279",
                "fax": "204-948-3115",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129166",
        "scraped_at": "2025-11-09T16:34:06.115253",
        "matched_keyword": "Finance Officer",
        "match_score": 85
    }
}