{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129200"
        },
        "metadata": {
            "job_title": "Special Programs Coordinator",
            "classification_title": "CL4 Clerk 4",
            "classification_code": "CL4",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Environment and Climate Change"
            ],
            "divisions": [
                "Parks, Parks & Trails"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44697",
            "salary": {
                "raw_text": "CL4 $55,472.00 - $64,777.00 per year",
                "classification_code": "CL4",
                "min_amount": 55472.0,
                "max_amount": 64777.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 20, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 6 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Department of Environment and Climate Change is seeking a customer focused individual to fill the position of Special Programs Coordinator. This is a senior clerical position that works within the Recreation and Education Section to deliver quality public recreation programming to seasonal campers and other groups. Individuals that enjoy working with the public and multi-tasking, often within tight timeframes, are encouraged to apply. To be considered for this competition you must submit an application form and resume. See below for further instructions."
            ]
        },
        "benefits": {
            "summary_paragraph": "Click here to access the application form.",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must possess and maintain a valid Class 5 Full Driver's licence.",
                "Must be willing and able to travel periodically throughout the province of Manitoba.",
                "Must possess and maintain a satisfactory Criminal Record Check",
                "Must be willing and able to work extended hours periodically as required."
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Extensive experience in providing clerical and administrative support for a large-scale public-facing program.",
                "Experience providing customer service to diverse segments of the public, including dealing with complaints and conflict resolution.",
                "Proven effective verbal communication skills, including the ability to deal with the public over the phone and in-person",
                "Experience with Microsoft Office Suite including Word, Excel and Outlook or similar software programs.",
                "Strong analytical, problem solving and decision-making skills.",
                "Experience preparing financial reports and/or reconciliations.",
                "Ability to work with high level of accuracy, thoroughness, and attention to detail.",
                "Effective organizational skills with the ability to multitask while working on concurrent assignments with strict deadlines.",
                "Strong interpersonal skills, including the ability to work cooperatively in a team environment and with the public.",
                "Proven effective written communication skills",
                "Experience interpreting and applying policies and procedures.",
                "Ability to work independently with minimal supervision."
            ],
            "desired": [
                "Knowledge of seasonal camping and Manitoba's provincial park campgrounds.",
                "Ability to read, write, and verbally communicate fluently in French"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "The Special Programs Coordinator position coordinates and administers approximately 1500 campsites in the annual Seasonal Camping Program and related public draws, as well as the Permanent Trailer Village Program and manages the flow of program information to customers, field office, branch and public information officers. It is responsible for the reconciliation of draw records and $1.5 million in revenues to the department. It will also co-ordinate the Commercial Concessionaire Program and the Campground Host Program with field staff and the public. Responsibilities also include the preparation and development of annual parks statistics. Lastly, it will support the Parks Reservation Service and the nightly camping program during peak times.",
            "items": [
                "To be considered for this competition you must submit an application form and resume. Complete the application form at the link below or contact Human Resource Services under “Apply to” to request a copy of the application form. The selection board will rely only on information provided in this form and resume to determine whether a candidate will be invited for further assessment. Note: You are not required to submit a cover letter, but may be asked to submit references, or other documentation at a later point if invited for further consideration.",
                "Click here to access the application form."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44697",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "Click here to access the application form.",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44697.docx",
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129200",
        "scraped_at": "2025-11-09T16:32:31.581215",
        "matched_keyword": "Program Coordinator",
        "match_score": 85
    }
}