{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129036"
        },
        "metadata": {
            "job_title": "Engineer-In-Training/Project Engineer",
            "classification_title": "EG1 Engineer 1",
            "classification_code": "EG1",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Department of Transportation and Infrastructure"
            ],
            "divisions": [
                "Bridges and Highway Structures, Engineering and Technical Services"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44561",
            "salary": {
                "raw_text": "EG1 $58,990.00 - $77,184.00 per year",
                "classification_code": "EG1",
                "min_amount": 58990.0,
                "max_amount": 77184.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 14, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "Manitoba Transportation and Infrastructure offers a structured comprehensive EIT Development Program where we provide you with training and experience to support your goal of becoming a Professional Engineer. With your current experience as the foundation, your personal development plan will ensure that you get experience performing varied and challenging work related to roadway construction, drainage, project management and related engineering/design. We will support your professional and educational development with inhouse and external training and provide guidance and mentorship through our large dynamic group of Professional Engineers. We offer comprehensive management training and coaching to help you prepare for one of the many possible opportunities for advancement in the Department. We offer a competitive salary in addition to a comprehensive benefits plan, which includes extended health benefits, health spending account, dental, vision, long-term disability, maternity and parental leave, and a pension plan.",
                "Positions will be of interest to candidates whose academics and experience aligns with one or more of the following engineering streams:",
                "To be considered for this competition you must submit an application form. See below for further instructions."
            ]
        },
        "benefits": {
            "summary_paragraph": "APPLICATION FORM",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must be able to work in an outdoor rough terrain environment and be exposed to notable hazards such as construction equipment, roadway traffic, noise, dust, hand/power tools, insects, vegetation, & sharp objects",
                "Must be enrolled (or eligible) as an Member in Training with Engineers Geoscientists Manitoba",
                "Must possess a valid Class 5 Driver's Licence",
                "Must have a degree in Civil Engineering or graduating in February or May 2026",
                "Must be able to travel frequently to work sites within the province by ground and/or air transportation"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Effective written communication skills",
                "Effective verbal communication skills",
                "Strong interpersonal skills",
                "Ability to work respectfully and productively within teams",
                "Excellent planning, organizing, and follow-up skills",
                "Ability to make sound decisions",
                "Leadership skills",
                "Experience with design and analysis",
                "Desired for Traffic Engineering and Water Infrastructure: Experience in Infrastructure Construction and Construction Inspection"
            ],
            "desired": [
                "Experience in Infrastructure Construction and Construction Inspection"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "EIT’s work under the guidance and direction of a Professional Engineer while in the program. The objective of this opportunity is to develop the EIT into a Project Engineer at the full working level of Engineer 2 (EG2). Following successful completion of Manitoba Infrastructure’s EIT Development Program and upon receiving your professional designation, candidates will be eligible for promotion to the EG2 level.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44561",
                "unit": "Talent Acquisition - Executive Recruitment",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3C 0C4"
                ],
                "phone": "204-945-6892",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "APPLICATION FORM",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44561.docx",
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129036",
        "scraped_at": "2025-11-09T16:34:28.149305",
        "matched_keyword": "Project Coordinator",
        "match_score": 85
    }
}