{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129165"
        },
        "metadata": {
            "job_title": "Bilingual Interpretation Project Lead",
            "classification_title": "TS3 Translator 3",
            "classification_code": "TS3",
            "employment_types": [
                "Regular/full-time"
            ],
            "departments": [
                "Municipal and Northern Relations"
            ],
            "divisions": [
                "Translation Services, Francophone Affairs Secretariat"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44668",
            "salary": {
                "raw_text": "TS3 $84,163.00 - $108,921.00 per year",
                "classification_code": "TS3",
                "min_amount": 84163.0,
                "max_amount": 108921.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 13, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to women, Indigenous people, visible minorities and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Francophone Affairs Secretariat is seeking to fill the position of Bilingual Interpretation Project Lead to support the Translation Services Unit, which is a central agency mandated to provide English and French translation, interpretation and terminology management services for departments, Crown organizations, the Courts and the Legislative Assembly.",
                "The Government of Manitoba offers a complete and comprehensive benefit package which includes paid vacation, extended health, health spending, dental/drug/vision, long term disability, supportive employment program, maternity/parental leave, defined pension plan (some pension plans allow for portability between the Civil Service Superannuation Board and employers)."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must be willing to work on evenings and weekends as necessary to meet operational requirements",
                "Must be able to communicate fluently (verbal and written) in English and French"
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Post-secondary education in administration or project management. An equivalent combination of education and experience may be considered.",
                "Experience in managing or supporting the coordination of projects, including responsibility for budget and task assignments.",
                "Demonstrated ability to leverage opportunities for innovation, find creative solutions to issues, and successfully manage change.",
                "Outstanding organizational and planning to be able to establish priorities, coordinate the workload of multiple contractors and meet competing deadlines.",
                "Excellent interpersonal skills with the ability to build and maintain good working relationships with clients and suppliers.",
                "Excellent problem-solving skills with the ability to independently analyze situations to determine feasibility, cost-effectiveness, alignment with legislation, and negotiate alternative solutions.",
                "Excellent verbal communication skills in French",
                "Excellent verbal communication skills in English",
                "Excellent written communication skills in French",
                "Excellent written communication skills in English"
            ],
            "desired": [
                "Familiarity with the language industry or previous experience working in a translation/interpretation service"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": null,
            "items": [
                "Manage the delivery of interpretation services for public bodies, including the courts and the Legislative Assembly, to ensure the official language rights of Manitobans are respected.",
                "Coordinate the work of freelance interpreters to facilitate the implementation of multiple assignments across the province.",
                "Act as point-of-contact for clients and service providers to support the effective delivery of interpretation services.",
                "Oversee the budget and track expenditure to ensure the responsible use of government funds."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44668",
                "unit": "600-330 Portage Avenue",
                "branch": "Winnipeg, MB",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3C 0C4"
                ],
                "phone": "204-948-4160",
                "fax": "204-948-2193",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129165",
        "scraped_at": "2025-11-09T16:33:21.947842",
        "matched_keyword": "Project Coordinator",
        "match_score": 85
    }
}