{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=129195"
        },
        "metadata": {
            "job_title": "Manager, Accounting Services",
            "classification_title": "FI5 Financial Officer 5",
            "classification_code": "FI5",
            "employment_types": [
                "Term/full-time"
            ],
            "departments": [
                "Department of Families"
            ],
            "divisions": [
                "Financial & Administrative Services , Administration & Finance"
            ],
            "locations": [
                "Winnipeg MB"
            ],
            "advertisement_number": "44701",
            "salary": {
                "raw_text": "FI5 $80,702.00 - $105,857.00 per year",
                "classification_code": "FI5",
                "min_amount": 80702.0,
                "max_amount": 105857.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 17, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions and will remain in effect for 12 months.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Financial and Administrative Services Branch (FASB) provides a broad range of financial and administrative support services to the various divisions within the Department of Families. The Accounting Services team within the Financial and Administrative Services Branch is responsible for processing financial transactions for the department. The manager is required to work independently in a team environment, demonstrate flexibility and effectiveness with changing environments, tasks, responsibilities and actively seeks new processes that provide service more effectively or efficiently.",
                "To be considered for this competition you must submit a cover letter and resume (Word or PDF only)."
            ]
        },
        "benefits": {
            "summary_paragraph": null,
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must be able to provide and maintain a satisfactory Criminal Record Check.",
                "Must be able to provide and maintain a satisfactory Child Abuse Registry Check ."
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Post-secondary education in Finance, Accounting related field, or equivalent combination of education and senior-level financial experience may be considered.",
                "Experience applying the General Manual of Administration (GMA), Financial Administration Manual (FAM), and Delegation of Financial Signing Authority (DFSA).",
                "Experience interpreting and applying financial and administrative policies, and internal controls.",
                "In depth experience with SAP financial management module with respect to all accounting transactions, procurement, and reporting.",
                "Experience supervising and leading staff in a transformation focused environment.",
                "Strong analytical skills to research and translate problems and proposals into advice and recommendations for staff and senior management.",
                "Strong verbal communication skills.",
                "Strong written communication skills.",
                "Strong interpersonal skills with the ability to interact with a wide range internal and external stakeholders.",
                "Strong organizational and time management skills with the ability to prioritize and delegate work in a deadline driven environment."
            ],
            "desired": [
                "Ability to read, write and verbally communicate in French."
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": "The Manager of Accounting Services is accountable to support senior management both in the Administration & Finance division and in various program areas in carrying out functions associated with accounting transactions including commitment, accrual and cost accounting, reconciliations; and treasury duties. The incumbent provides interpretation, advice, and recommendations on expenditure, and liability controls. The incumbent review reconciliations on financial control accounts to ensure the accurate reporting and control of expenditures and liabilities. The incumbent also provide leadership to the Accounting Services unit within the Financial and Administrative Services Branch.",
            "items": []
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44701",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": false,
            "application_form_link_text": null,
            "application_form_url": null,
            "instruction_text": [
                "WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "129195",
        "scraped_at": "2025-11-09T16:32:37.095599",
        "matched_keyword": "Manager",
        "match_score": 95
    }
}