{
    "job_posting": {
        "search_keyword": null,
        "source": {
            "jurisdiction": "Manitoba",
            "job_board": "Government of Manitoba Careers",
            "url": "https://jobsearch.gov.mb.ca/search.action?ID=128965"
        },
        "metadata": {
            "job_title": "Financial Clerk",
            "classification_title": "CL3 Clerk 3",
            "classification_code": "CL3",
            "employment_types": [
                "Regular/full-time",
                "Term/full-time"
            ],
            "departments": [
                "Various Departments"
            ],
            "divisions": [
                "Various Departments, Various Departments"
            ],
            "locations": [
                "Various rural locations MB, Various urban locations MB"
            ],
            "advertisement_number": "44527",
            "salary": {
                "raw_text": "CL3 $47,264.00 - $55,567.00 per year",
                "classification_code": "CL3",
                "min_amount": 47264.0,
                "max_amount": 55567.0,
                "frequency": "per year",
                "currency": "CAD"
            },
            "closing_date": "November 19, 2025",
            "closing_time": null
        },
        "employment_equity": {
            "intro_paragraph": "The Manitoba government recognizes the importance of building an exemplary public service reflective of the citizens it serves, where diverse abilities, backgrounds, cultures, identities, languages and perspectives drives a high standard of service and innovation. The Manitoba government supports equitable employment practices and promotes representation of designated groups (women, Indigenous people, persons with disabilities, visible minorities).",
            "equity_factor_statement": "Employment Equity is a factor in selection for this competition. Consideration will be given to Indigenous people and persons with disabilities.",
            "designated_groups": [
                "women",
                "Indigenous people",
                "persons with disabilities",
                "visible minorities"
            ]
        },
        "competition_notes": {
            "eligibility_list_text": "An eligibility list may be created for similar positions in Winnipeg and other locations across Manitoba and may remain in effect for 12 months. This competition may be used to appoint successful candidate(s) to current and future regular, term or acting status appointments subject to staffing approvals. This competition will be used to fill positions at the Clerk 3 level of varying employment tenures, language requirements, security requirements, conditions of employment and work locations depending on the needs of the positions being staffed.",
            "classification_flex_text": null,
            "usage_text": null
        },
        "position_overview": {
            "summary_paragraphs": [
                "The Manitoba government is seeking highly motivated individuals to work within various departments. If you are looking for a rewarding and exciting career, this is a great opportunity to join our team. The Manitoba government has a comprehensive compensation and benefits package which includes extended health, health spending, dental, vision, long term disability, supportive employment, sick leave, paid vacation, maternity/paternity leave, family related leave and a defined pension plan. The Manitoba government also provides ongoing professional and educational development for its employees.",
                "To be considered for this competition you must submit an application form and resume. See below for further instructions."
            ]
        },
        "benefits": {
            "summary_paragraph": "Click here to access the application form.",
            "benefit_items": []
        },
        "conditions_of_employment": {
            "heading": "Conditions of Employment:",
            "items": [
                "Must be legally entitled to work in Canada",
                "Must provide and maintain a satisfactory Criminal Record Check, Criminal Record Check with Vulnerable Sector Search, Adult Abuse Registry Check and Child Abuse Registry Check may be required for some positions.",
                "Must provide and maintain a satisfactory Enhanced Security Screening may be required for some positions.",
                "Completion of satisfactory credit screening and credit check may be required for some positions."
            ]
        },
        "qualifications": {
            "heading": "Qualifications",
            "essential": [
                "Completion of a Business Administration and/or Accounting Diploma or Certificate. A combination of related education, training and experience may be considered",
                "Experience performing accounting transactions including accounts payable, accounts receivable, reconciliations, creating financial reports and/or maintaining financial records",
                "Strong organizational and time management skills with the ability to prioritize workloads and effectively manage deadlines",
                "Ability to work with a high level of accuracy, thoroughness and attention to detail",
                "Strong interpersonal skills that facilitate effective working relationships with colleagues, other departments and a variety of stakeholders",
                "Ability to manage confidential and sensitive information",
                "Proficiency working with Microsoft Office Suite (Outlook, Word, Excel) or similar programs",
                "Effective written communication skills with experience drafting and editing correspondence or other communication",
                "Effective verbal communication skills to clearly and professionally communicate with internal and external stakeholders",
                "Ability to work independently with minimal supervision",
                "Experience interpreting and applying policies and/or procedures"
            ],
            "desired": [
                "Experience working with SAP (Financial Module) or an equivalent financial management software",
                "Ability to read, write and verbally communicate fluently in French"
            ],
            "equivalency_text": null
        },
        "duties": {
            "heading": "Duties",
            "intro": null,
            "items": [
                "Processing financial transactions (Accounts Payable and Accounts Receivable) and maintaining accurate financial records;",
                "Preparing and processing invoices, receipts, and payments,;",
                "Timekeeping entries, payroll related support;",
                "acting as a financial clerical liaison/resource for branch/division staff i.e. responding to inquiries and resolving financial issues;",
                "Maintaining confidential financial information and records."
            ]
        },
        "application_instructions": {
            "apply_to_block": {
                "advertisement_number": "44527",
                "unit": "Talent Acquisition",
                "branch": "Human Resource Services",
                "address_lines": [
                    "Winnipeg, MB",
                    ",",
                    "R3B 2A9"
                ],
                "phone": "204-945-7518",
                "fax": "204-945-0601",
                "email": null
            },
            "requires_application_form": true,
            "application_form_link_text": "Click here to access the application form.",
            "application_form_url": "https://www.gov.mb.ca/govjobs/doc/Screening_Application_Form/application_form_for_screening_44527.docx",
            "instruction_text": [
                "To be considered for this competition you must submit an application form and resume. Complete the application form at the link below or contact Human Resource Services under “Apply to” to request a copy of the application form. The selection board will rely only on information provided in the form and resume to determine whether a candidate will be invited for further assessment. Note: You are not required to submit a cover letter, but may be asked to submit references, or other documentation at a later point if invited for further consideration. Click here to access the application form. WHEN APPLYING TO THIS POSITION, PLEASE INDICATE THE ADVERTISEMENT NUMBER AND POSITION TITLE IN THE SUBJECT LINE AND/OR BODY OF YOUR EMAIL.",
                "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
                "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
                "We thank all who apply and advise that only those selected for further consideration will be contacted."
            ],
            "accommodation_text": "Applicants may request reasonable accommodation related to the materials or activities used throughout the selection process. When applying to this position, please indicate the advertisement number and position title in the subject line and/or body of your email. Your cover letter, resumé and/or application must clearly indicate how you meet the qualifications.",
            "grievance_notice": "Please be advised that job competitions for represented positions may be grieved by internal represented applicants. Should a selection grievance be filed, information from the competition file will be provided to the grievor's representative. Personal information irrelevant to the grievance and other information protected under legislation will be redacted.",
            "contact_note": "We thank all who apply and advise that only those selected for further consideration will be contacted."
        }
    },
    "scraping_metadata": {
        "job_id": "128965",
        "scraped_at": "2025-11-09T16:34:01.511008",
        "matched_keyword": "Data Entry Clerk",
        "match_score": 85
    }
}