{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Cyber-Security-Risk-Advisor-%28Program-Manager%29-NS-B3K-2A6/597038917/"
    },
    "metadata": {
      "job_title": "Cyber Security Risk Advisor (Program Manager)",
      "classification": "Program Manager",
      "competition_number": "47342",
      "department": "Cyber Security & Digital Solutions",
      "location": "HALIFAX",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-23T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "At CSDS, we prioritize people—both within our team and in the communities we serve. Our mission is to redefine how Nova Scotians engage with government by creating accessible, reliable digital solutions centered around user needs.\n\nIn today’s tech-driven world, CSDS empowers government departments with essential digital solutions to meet Nova Scotians’ expectations. As a trusted partner across government, we enable departments to fulfill their mandates with secure, user-friendly services. From healthcare and education to public safety, we collaborate to transform how services are designed and delivered.\n\nWe don’t just implement technology; we modernize outdated systems and reimagine processes. Our agile, data-driven approach ensures that digital services are both efficient and adaptable to Nova Scotia’s evolving needs.\n\nJoining CSDS means contributing to work that makes a real difference. From providing vital tech support to healthcare professionals to strengthening cybersecurity and developing scalable digital platforms, you’ll play a key role in building a more inclusive, responsive government for Nova Scotians.\n\nTogether, we’re setting new standards for digital public service, delivering resilient solutions that meet today’s needs—and anticipate tomorrow’s challenges."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "We are seeking a strategic, relationship-driven Cybersecurity Risk Advisor to help advance a modern, resilient, and secure digital government. This is a leadership role that goes beyond traditional security management, it's about enabling secure-by-design delivery of digital services while supporting a culture of shared accountability and continuous improvement.\n\nAs the Cybersecurity Risk Advisor, you will build relationships and advance the awareness , knowledge, and application of cyber security as an important part of everything we do. You will play a key role in building a robust cyber security-by- design program, fostering a cybersecurity risk-aware culture by engaging early and often with business owners, delivery teams, and partners across government, healthcare, and education sectors. You will help stakeholders understand their risk ownership responsibilities and embed security requirements throughout the delivery lifecycle.\n\nYou will contribute directly to the development of cybersecurity policies, standards, and guidelines, ensuring they are aligned with current delivery practices."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "As the Cybersecurity Risk Advisor, you will be responsible for:\n\n\n\nBuilding strong, collaborative relationships with partners, stakeholders, and contributors to support a shared understanding and continuous improvement of cybersecurity posture.\nProactively engaging with delivery teams and partners to embed security risk management throughout the delivery lifecycle.\nPromoting shared accountability by helping teams understand and fulfill their roles in managing cybersecurity risk.\nBalancing user expectations with the need to implement practical and effective cybersecurity requirements.\nCollaborating within other areas of government and the department to develop cybersecurity policies, standards and guidelines.\nProviding guidance on best practices for secure system architecture and design.\nMonitoring performance against key performance indicators and providing recommendations based on data",
      "bullets": [
        "Building strong, collaborative relationships with partners, stakeholders, and contributors to support a shared understanding and continuous improvement of cybersecurity posture.",
        "Proactively engaging with delivery teams and partners to embed security risk management throughout the delivery lifecycle.",
        "Promoting shared accountability by helping teams understand and fulfill their roles in managing cybersecurity risk.",
        "Balancing user expectations with the need to implement practical and effective cybersecurity requirements.",
        "Collaborating within other areas of government and the department to develop cybersecurity policies, standards and guidelines.",
        "Providing guidance on best practices for secure system architecture and design.",
        "Monitoring performance against key performance indicators and providing recommendations based on data"
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "To be considered for this opportunity, you hold experience and expertise in the following areas:\n\n\n\nUndergraduate degree in Computer Science, Engineering, Science or related technical degree.\nMinimum of 2 years in a leadership role focused on building programs and leading change.\nIn depth knowledge and experience advancing cyber security as a discipline within large, complex environments.\nDemonstrated ability to work collaboratively and lead change with multi-disciplinary teams in complex, multi-stakeholder environments.\nProven ability to communicate effectively, facilitate discussions, and build strong relationships.\nExperience in secure system design and modern delivery practices such as Agile and DevSecOps.\nDemonstrated experience applying recognized cybersecurity frameworks and standards, such as NIST, ISO/IEC 27001, or equivalent.\n\n\nIn addition, you have the following experience and skills:\n\n\n\nThe ability to influence at senior levels (e.g. with senior executive teams and deputies).\nUser-centered, innovative and product management approaches to ensuring the secure delivery of services.\n\n\nWe will assess the above qualifications and competencies using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks. We recognize that everyone brings different skills and experiences to the table and that not everyone \"checks all the boxes\". We encourage you to apply anyway! Tell us why you're the right fit for the job.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "Undergraduate degree in Computer Science, Engineering, Science or related technical degree.",
        "Minimum of 2 years in a leadership role focused on building programs and leading change.",
        "In depth knowledge and experience advancing cyber security as a discipline within large, complex environments.",
        "Demonstrated ability to work collaboratively and lead change with multi-disciplinary teams in complex, multi-stakeholder environments.",
        "Proven ability to communicate effectively, facilitate discussions, and build strong relationships.",
        "Experience in secure system design and modern delivery practices such as Agile and DevSecOps.",
        "Demonstrated experience applying recognized cybersecurity frameworks and standards, such as NIST, ISO/IEC 27001, or equivalent.",
        "The ability to influence at senior levels (e.g. with senior executive teams and deputies).",
        "User-centered, innovative and product management approaches to ensuring the secure delivery of services."
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": null
    },
    "benefits": {
      "heading": "Benefits",
      "body": "The Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs.  For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "www.nspssp.ca"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "While this position is based in Halifax, travel throughout the province may be required periodically. You will be required to work in an office environment during normal business hours (08:00-16:30) and support a 24/7 critical service and environment."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "Applicants are required to complete a series of questions as part of the online application process."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace. Our Employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless Career Paths.",
        "A Dynamic, client-focused office environment where service excellence and teamwork are our focus."
      ]
    },
    "compensation": {
      "pay_grade": "EC 12",
      "salary_range": {
        "raw_text": "Salary Range:  $3,760.89 - $4,701.11 Bi-Weekly",
        "min_amount": 3760.89,
        "max_amount": 4701.11,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597038917",
    "scraped_at": "2025-11-09T03:54:39.166446",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}