{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Executive-Director%2C-Tax%2C-Economics-and-Fiscal-Policy-NS-B3J1V9/596820517/"
    },
    "metadata": {
      "job_title": "Executive Director, Tax, Economics and Fiscal Policy",
      "classification": null,
      "competition_number": "47291",
      "department": "Finance and Treasury Board",
      "location": "HALIFAX",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-14T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "At the Department of Finance and Treasury Board, we work to preserve the financial capacity of the Province’s programs and services by providing the Government of Nova Scotia advice on fiscal sustainability. We strive to provide financial leadership, analysis, and policy development to ensure government priorities are well coordinated and fiscally responsible. As stewards of the Province’s financial affairs, we deliver a wide range of corporate fiscal management services, including the preparation of the provincial budget, financial accounting and reporting, forecasting, borrowing, lending, financial advisory, taxation and gaming, pension and financial institution regulation."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "Reporting to the Associate Deputy Minister, the Executive Director, Tax, Economics and Fiscal Policy is accountable for providing leadership and oversight of tax legislation, administration of the provincial tax system, overall assessment and development of Nova Scotia’s tax policy, and administration of various provincial tax credit and rebate programs as well as federal-provincial fiscal arrangements.\n\nThe Executive Director advances Nova Scotia’s interests by providing strong representation on a wide range of federal/provincial, regional and interdepartmental committees.\n\nThis position oversees a division that is responsible for analyzing and forecasting the macroeconomic environment and provision of economic impact assessments and studies related to economic and revenue consequences of fiscal and other policy decisions as well as impacts of external events, investments, and projects."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "Ensure the Government of Nova Scotia is provided with the fiscal, economic, taxation and statistical analysis and policy recommendations required to facilitate decision-making related to federal-provincial fiscal arrangements, provincial tax policy and tax measures.\nProvide strong representation on a wide range of federal/provincial, regional and interdepartmental committees and task groups; negotiate credits agreements; and oversee the development of related strategic policy options and recommendations for Government's consideration.\nOversee and/or participate in the development and drafting of tax legislation; review, design/enhance, develop, and implement select tax measures, and manage their administration.\nDevelop briefing materials on current economic conditions/events, evaluate interaction of other measurements and economy, provide analyses, data and advice to other departments and agencies.\nManage the provision of economic impact analyses and recommendations to Government, the timely development of the Province's short and long-term economic and fiscal projections, and the estimates and forecast of the Province's revenues produced in the Provincial Budget.\nDevelop reliable and timely data, promote the use of appropriate standards and procedures for the collection and analysis of statistics, and represent the Province’s statistical interests.",
      "bullets": [
        "Ensure the Government of Nova Scotia is provided with the fiscal, economic, taxation and statistical analysis and policy recommendations required to facilitate decision-making related to federal-provincial fiscal arrangements, provincial tax policy and tax measures.",
        "Provide strong representation on a wide range of federal/provincial, regional and interdepartmental committees and task groups; negotiate credits agreements; and oversee the development of related strategic policy options and recommendations for Government's consideration.",
        "Oversee and/or participate in the development and drafting of tax legislation; review, design/enhance, develop, and implement select tax measures, and manage their administration.",
        "Develop briefing materials on current economic conditions/events, evaluate interaction of other measurements and economy, provide analyses, data and advice to other departments and agencies.",
        "Manage the provision of economic impact analyses and recommendations to Government, the timely development of the Province's short and long-term economic and fiscal projections, and the estimates and forecast of the Province's revenues produced in the Provincial Budget.",
        "Develop reliable and timely data, promote the use of appropriate standards and procedures for the collection and analysis of statistics, and represent the Province’s statistical interests."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "The ideal candidate will have a bachelor’s degree in a relevant discipline (e.g. economics, finance, statistics,business administration / commerce or public administration), plus 7 years of related experience; or a master’s/post-graduate designation in a relevant discipline. They will also have several years of progressive leadership experience, with a minimum of 5 years in a professional/management role.\n\n \n\nAn acceptable equivalent combination of education, training and experience may be considered.\n\n\n\nIn addition to the above, the following skills and experience are required:\n\n \n\nProven project management, problem-solving and analytical skills, coupled with the ability to maintain a broad, province-wide perspective and make informed, strategic decisions that align with organizational goals.\nExceptional communication skills (written and verbal) and ability to build and maintain relationships. Strong attention to detail, with a history of providing sound advice and accurate information.\nDemonstrated ability to lead and support individuals and teams in planning, organizing, and prioritizing tasks to achieve objectives efficiently and effectively.\n\n \n\nWe will assess the above qualifications and competencies using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "Proven project management, problem-solving and analytical skills, coupled with the ability to maintain a broad, province-wide perspective and make informed, strategic decisions that align with organizational goals.",
        "Exceptional communication skills (written and verbal) and ability to build and maintain relationships. Strong attention to detail, with a history of providing sound advice and accurate information.",
        "Demonstrated ability to lead and support individuals and teams in planning, organizing, and prioritizing tasks to achieve objectives efficiently and effectively."
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "http://www.nspssp.ca/"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "This position is based in a comfortable office environment in Halifax. Occasional travel within Nova Scotia and Canada is required. Standard hours of work are 35 hours/week from Monday to Friday."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": null
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace.  Our employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless career paths.",
        "A dynamic, client focused office environment where service excellence and teamwork are our focus."
      ]
    },
    "compensation": {
      "pay_grade": "EC 16",
      "salary_range": {
        "raw_text": "Salary Range:  $5,556.38 - $6,945.46 Bi-Weekly",
        "min_amount": 5556.38,
        "max_amount": 6945.46,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "596820517",
    "scraped_at": "2025-11-09T03:54:23.524278",
    "matched_keyword": "Economist",
    "match_score": 88.0
  }
}