{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Manager%2C-Project-Manager-NS-B3J2A8/597132717/"
    },
    "metadata": {
      "job_title": "Manager, Project Manager",
      "classification": null,
      "competition_number": "47424",
      "department": "Health and Wellness",
      "location": "HALIFAX",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-26T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Department of Health and Wellness offers opportunities to grow and advance in a dynamic sector that touches the lives of all Nova Scotians. Along with our partners, including the Nova Scotia Health Authority and the IWK Health Centre, we’re committed to continually improving our health care system. With a focus on collaborative primary health care, continuing care, improved supports for mental health and addictions, digital health, capital infrastructure, and more, the department is thinking differently about how to plan, fund, legislate and monitor to improve access and service delivery. To do this, we’re recruiting leaders at all levels of the organization who embrace a challenge and believe in their ability to make a difference."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "The Health Transformation Office was established in April 2022 to work with and support health system partners to deliver on government’s strategic plan: Action for Health. In particular, the team is focused on helping ensure implementation of a set of priority initiatives that are foundational to the transformation of Nova Scotia’s healthcare system.  \n\nAs the Performance Manager, you will work as part of a small team supporting partners including Nova Scotia Health, IWK, Department of Seniors and Long-Term Care, Office of Addictions and Mental Health, and Office of Healthcare Professionals Recruitment and other related government departments, to coordinate and collaborate across the health system to:\n\n\n\nBe a source of truth on transformation and ensure transparency across the system\nClearly and consistently communication progress toward transformation outcomes\nImprove coordination across transformation initiatives\nCoordinate resources and funding required for initiative success\n\n\nThe performance manager will work with colleagues across the healthcare system to deliver a performance program for healthcare system transformation, ensuring fulsome monitoring and reporting of achieved outcomes, risks associated with not achieving outcomes and the impact on Nova Scotians, healthcare providers and the system overall."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "Reporting to the Executive Director, the Manager acts as support to strategic health system priorities, the administration and operational requirements of the Office, and corporate and other ad hoc asks as required. This includes, but is not limited to:\n\n\n\nProviding leadership to performance functions through coordination and collaboration with colleagues in key functions (analytics, finance, policy) cross the healthcare system\nEnsuring strategic reporting aligns with the goals and priorities government has set for healthcare transformation by making connections and effective decisions which support system thinking.\nWorking closely with SDO team members to support and advise priorities focus areas to help them meet their stated outcomes. \nLeading conversations and facilitation meetings to land on planning, critical milestones and cross priority dependencies.\nManaging the Office budget, procurement and other administrative functions.\nSupporting the system priority governance structures.\nSupporting executive council submissions.\n\n\nThis role works with and across leadership teams in the health system and is a critical enabler to strengthening collaboration and trust across partners.",
      "bullets": [
        "Providing leadership to performance functions through coordination and collaboration with colleagues in key functions (analytics, finance, policy) cross the healthcare system",
        "Ensuring strategic reporting aligns with the goals and priorities government has set for healthcare transformation by making connections and effective decisions which support system thinking.",
        "Working closely with SDO team members to support and advise priorities focus areas to help them meet their stated outcomes.",
        "Leading conversations and facilitation meetings to land on planning, critical milestones and cross priority dependencies.",
        "Managing the Office budget, procurement and other administrative functions.",
        "Supporting the system priority governance structures.",
        "Supporting executive council submissions."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "As our next Manager, you will have a (graduate or bachelor’s) degree in a related field, experience working in a dynamic, changing environment, and a track record of leading and delivering results. You will also have significant experience working closely with a broad range of internal and external groups. Experience in the healthcare system will be considered an asset.\n\nYou are a leader with a demonstrated ability to execute and deliver actions in the short-term, along with experience in developing and implementing a vision with a longer-term outlook. You are a systems thinker who is a strong communicator and relationship builder and have a bias for candid and open discussions, both with internal and external parties. You have a proven track record of building meaningful relationships within your workplace, but also across and outside of government/health system.\n\nYou have an ability to take in new information and quickly synthesize it to provide excellent advice, rooted in good judgement and professional expertise. You are well-organized, capable of prioritizing work and are flexible and open to changing course if new information, evidence or a changing environment presents itself. You are comfortable challenging the status quo and taking risks (within reasonable limits). You enjoy and can move quickly between detail-oriented work and the big picture. You are naturally curious, enjoy working in a range of policy areas, and constantly ask questions to ensure a deep understanding of a new topic area. You will cultivate a work environment that respects public service values.\n\nWe will assess the above qualifications and competencies using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "An equivalent combination of training, education and experience will be considered. Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "The Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs.  For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "www.nspssp.ca"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "Most of your time is spent in a comfortable office setting with frequent travel to site visits as required.\n \nYour normal work week is 35 hours/week, 7 hours/day; however, you may be required to work weekends and occasionally work overtime."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": null
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace. Our Employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless Career Paths.",
        "A Dynamic, client-focused office environment where service excellence and teamwork are our focus."
      ]
    },
    "compensation": {
      "pay_grade": "EC 12",
      "salary_range": {
        "raw_text": "Salary Range:  $3,760.89 - $4,701.11 Bi-Weekly",
        "min_amount": 3760.89,
        "max_amount": 4701.11,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597132717",
    "scraped_at": "2025-11-09T03:53:13.852215",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}