{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Category-Manager-%28Manager%2C-Strategic-Sourcing%29-NS-B3J-1M7/597112117/"
    },
    "metadata": {
      "job_title": "Category Manager (Manager, Strategic Sourcing)",
      "classification": "Manager, Strategic Sourcing",
      "competition_number": "47373",
      "department": "Service Nova Scotia",
      "location": "HALIFAX",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-25T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "SNS-Procurement is evolving to become an ethical leader in government procurement service delivery. We are committed to:\n\n \n\nResponsible management of public resources\nStrong client focus\nOptimized sourcing solutions\nTransparency, compliance, and sustainable accountability\n\n \n\nOur team ensures an open, fair process that maximizes competition and delivers best value, while supporting environmental, economic, and societal goals. We provide expert guidance to government departments and NSHA in developing creative, sustainable procurement solutions for complex needs.\n\n \n\n \n\n \n\nWhat is Procurement? \n\n \n\nProcurement encompasses activities such as establishing requirements, conducting market research, sourcing, and negotiating contracts to acquire products or services. This role is focused on procurement and is not considered a supply chain or logistics position.  Our function is to explore supply market opportunities and implement sourcing strategies that achieve the best outcomes for our organization, stakeholders, and the province of Nova Scotia."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "Reporting to the Procurement Operations Manager, the IT/Digital Category Manager leads a team of Procurement Specialists in the IT/Digital portfolio, ensuring exceptional service delivery and a strong focus on client needs. You will foster a dedicated, engaged team through mentorship, collaboration, and a commitment to diversity and a healthy workplace.\n\n \n\nThe IT/Digital Procurement team manages the full procurement process for IT/Digital goods and services, supporting strategic sourcing, tactical procurement, and contract management for significant business initiatives. The team plays a key role in advancing Nova Scotia’s digital leadership by investing in technology for positive client experiences and service excellence. Additionally, the team supports the NSHA IM/IT group in delivering integrated clinical information management and IT support across the healthcare continuum.\n\n \n\nTypical responsibilities include:\n\n \n\nSupport the Operations Manager in maintaining best practice standards and fostering a supportive, results-driven team environment.\nFacilitating and mentoring procurement specialists through complex RFPs, contract negotiations, and providing guidance on public procurement best practices\nPromote innovative procurement methods\nCoordinating category plans with clients, including project deliverables, costs, and savings"
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": null,
      "bullets": []
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "To succeed in this role, you will have:\n\n \n\nA post-secondary degree in a relevant discipline (e.g., Business Administration, Engineering, Commerce) and at least 5 years’ experience in a senior procurement role managing complex projects, or an equivalent combination of education and experience, including:\n\n \n\nPreferred skills and experience:\n\n \n\nExperience in public (Gov)/private procurement, developing complex RFPs, and negotiating agreements\nDriven, energetic leadership experience with high professional integrity with demonstrated experience mentoring, coaching, and developing procurement professionals to achieve individual and team success in diverse environments.\nExpertise in the sourcing development process, including opportunity assessment, requirements definition, market research, strategy development and execution, evaluation methodologies, and contract implementation\nProject and change management\nAbility to analyze market trends, total cost of ownership, and develop multi-year category management plans\nStrong organizational, time management, and motivational skills\nKnowledge of Canadian procurement law and trade agreements in public (Gov) procurement\nCommitment to service excellence and continuous improvement\nExperience handling conflicts and service delivery escalations\nProficiency in MS Office (Excel, Word, PowerPoint)\n\n \n\nAssets:\n\n \n\nPublic Procurement certification or Supply Chain designation (e.g., PSPP, CPPO, SCMP, SMT Certificate) or working towards certification\nExperience in IT/Digital procurement\nExperience with SAP (procurement modules) and SAP Ariba\n\n \n\nAssessment of qualifications may include written exams, standardized tests, presentations, interviews, and reference checks. Applications should detail relevant experiences and timelines.\n\n \n\n \n\nKey competencies: Analytical Thinking, Teamwork & Collaboration, Action Management, Client Orientation, Developing Others, Team Leadership, Initiative, Effective Communication, Relationship Building, Strategic Orientation, Intercultural Diversity Proficiency.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "Experience in public (Gov)/private procurement, developing complex RFPs, and negotiating agreements",
        "Driven, energetic leadership experience with high professional integrity with demonstrated experience mentoring, coaching, and developing procurement professionals to achieve individual and team success in diverse environments.",
        "Expertise in the sourcing development process, including opportunity assessment, requirements definition, market research, strategy development and execution, evaluation methodologies, and contract implementation",
        "Project and change management",
        "Ability to analyze market trends, total cost of ownership, and develop multi-year category management plans",
        "Strong organizational, time management, and motivational skills",
        "Knowledge of Canadian procurement law and trade agreements in public (Gov) procurement",
        "Commitment to service excellence and continuous improvement",
        "Experience handling conflicts and service delivery escalations",
        "Proficiency in MS Office (Excel, Word, PowerPoint)",
        "Public Procurement certification or Supply Chain designation (e.g., PSPP, CPPO, SCMP, SMT Certificate) or working towards certification",
        "Experience in IT/Digital procurement",
        "Experience with SAP (procurement modules) and SAP Ariba"
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "http://www.nspssp.ca/"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": null
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This is a permanent, full-time position based in Halifax, Nova Scotia. The anticipated start date for this position is approximately February 1, 2026."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career",
        "Engaging workplace: our Employees feel valued, respected, connected, and tuned in, we have forward-thinking policies and strategies",
        "Countless career paths",
        "Department specific flexible working schedules"
      ]
    },
    "compensation": {
      "pay_grade": "EC 11",
      "salary_range": {
        "raw_text": "Salary Range:  $3,418.96 - $4,273.75 Bi-Weekly",
        "min_amount": 3418.96,
        "max_amount": 4273.75,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597112117",
    "scraped_at": "2025-11-09T03:53:07.273640",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}