{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Manager%2C-Building-Infrastructure-NS-B3J-2N2/597025017/"
    },
    "metadata": {
      "job_title": "Manager, Building Infrastructure",
      "classification": null,
      "competition_number": "47360",
      "department": "Public Works",
      "location": "HALIFAX",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-16T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "Building and maintaining our provincial infrastructure and public works is no small job.\n\nBuilding Infrastructure Design and Construction at the Department of Public Works is responsible for the design, construction and major renovation of government buildings and facilities and delivery of building project services for government departments, health authorities, school boards and community colleges, as well as crown corporations. We’re looking at new ways of delivering our services to government in these challenging times. If you want to be part of a forward-thinking, collaborative environment, this may be the right opportunity for you. Preference will be given to equity seeking candidates."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "As a Manager, Building Infrastructure you will be professionally responsible for the delivery of a portfolio of major construction/renovation projects for provincial buildings. You will manage a team of project managers and senior architects assigned to these projects and be supported by a professional technical engineering services team."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "The Manager, Building Infrastructure is responsible for a large portfolio of new construction, renovation, and addition projects, from planning through to design, construction and commissioning, and use for its Provincial Department Clients. The Manager leads a multi-discipline group of project managers, design leads, technical and support staff within the department, as well as resourcing external consultants as required. Projects undertaken by the Manager, Building Infrastructure range in approximate value from $1,000,000.00 to $500,000,000.00 and include complex projects such as hospitals, schools, correctional facilities, courthouses and highway maintenance facilities.\n\nThe Manager, Building Infrastructure oversees the delivery of a program portfolio, while taking professional responsibility for delivery of critical projects. This includes:\n\n \n\nDeveloping relationships with client department representatives for those projects within the project portfolio to meet their short and long term needs for building infrastructure project delivery.\nDeveloping and maintaining the vision and goals for projects, and ensuring they are in line with the department’s broader vision and goals.\nExploring innovative solutions to resolve project challenges, integrating and analysing complex and diverse information sources.\nDelivering expert research, analysis, consultation, and advice on project design, construction, and delivery issues with the goal of continuous improvement to project management delivery.\n\n\nIn addition, your effective leadership abilities are key in managing the development, implementation, and administration of:\n\n \n\nProvincial design standards\nConsultant/Contractor procurement strategies\nContract development and negotiation\n\n\nYou will collaborate regularly with external industry groups such as the Nova Scotia Association of Architects, Engineers Nova Scotia, Consulting Engineers of Nova Scotia, and Construction Association of Nova Scotia. You will also work closely with internal groups and client departments with respect to their design and construction needs, as well as Procurement Services on matters relating to the Procurement of Design and Construction services.\n\nYou will also contribute to the strategy and policy decisions of the Division and develop plans for initiatives to improve the performance of design, estimating and inspections, in support of the Division’s overall performance improvement objectives.",
      "bullets": [
        "Developing relationships with client department representatives for those projects within the project portfolio to meet their short and long term needs for building infrastructure project delivery.",
        "Developing and maintaining the vision and goals for projects, and ensuring they are in line with the department’s broader vision and goals.",
        "Exploring innovative solutions to resolve project challenges, integrating and analysing complex and diverse information sources.",
        "Delivering expert research, analysis, consultation, and advice on project design, construction, and delivery issues with the goal of continuous improvement to project management delivery.",
        "Provincial design standards",
        "Consultant/Contractor procurement strategies",
        "Contract development and negotiation"
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "As the Manager, Building Infrastructure, you must be either a Licensed Architect (licenced or eligible to be licenced with Nova Scotia Association of Architects) or a Professional Engineer (registered or eligible to be registered with Engineers Nova Scotia). You are a senior level architect or engineer with many years of experience in the building design and construction industry, possessing strong technical experience, coupled with progressive experience managing and coaching staff. In this role, it is critical that you are an excellent communicator who maintains good relationships with colleagues, clients, industry, senior management and your staff.\n\nYou must have a knowledge of, and experience with:\n\n \n\nbuilding construction;\nlegislative requirements dealing with building design and construction (including, but not limited to, National Building Code of Canada, Nova Scotia Building Code Regulations, National Energy Code);\ndevelopment and management of construction budgets and construction schedules; and\nproject management principles.\n\n\nFamiliarity with the following are considered assets:\n\n \n\noperational budgets;\nconsultant procurement methods and contracts;\nmethods of project delivery (including design-bid-build, design-build and construction management);\nNet Zero Energy and Low Carbon sustainable building solutions and the major sustainable rating systems in Canada, and;\nthe Department’s Design Requirements Manual DC 350.\n\n\nWe will assess the above qualifications using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "building construction;",
        "legislative requirements dealing with building design and construction (including, but not limited to, National Building Code of Canada, Nova Scotia Building Code Regulations, National Energy Code);",
        "development and management of construction budgets and construction schedules; and",
        "project management principles.",
        "operational budgets;",
        "consultant procurement methods and contracts;",
        "methods of project delivery (including design-bid-build, design-build and construction management);",
        "Net Zero Energy and Low Carbon sustainable building solutions and the major sustainable rating systems in Canada, and;",
        "the Department’s Design Requirements Manual DC 350."
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": null
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "http://www.nspssp.ca/"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "Your normal work week is 35 hours/week, 7 hours/day. You may be required to work overtime on occasion.\n\nThe majority of your work is conducted in a comfortable office environment with moderate travel required within and outside of the Province.\n\nThere is pressure to meet deadlines while managing a diverse number of projects that require ongoing planning/revising. You must be able to manage stressful, complex situations and balance many different issues and considerations. Work is often subject to extensive scrutiny and criticism by the public and by the diverse communities served."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "Travel throughout the province is required; as such you must have a valid driver’s license and ability to travel throughout the province."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace. Our Employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless Career Paths."
      ]
    },
    "compensation": {
      "pay_grade": "EC 13",
      "salary_range": {
        "raw_text": "Salary Range:  $4,136.98 - $5,171.21 Bi-Weekly",
        "min_amount": 4136.98,
        "max_amount": 5171.21,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597025017",
    "scraped_at": "2025-11-09T03:54:31.092489",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}