{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/DARTMOUTH-Program-Administration-Officer-3-%28PCC-Watch-Officer%29%286-positions%29-NS-B3J-3N5/597021517/"
    },
    "metadata": {
      "job_title": "Program Administration Officer 3 (PCC Watch Officer)(6 positions)",
      "classification": "PCC Watch Officer",
      "competition_number": "47362",
      "department": "Emergency Management",
      "location": "DARTMOUTH",
      "type_of_employment": "Permanent",
      "union_status": "NSGEU - NSPG",
      "closing_date": "2025-11-14T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Nova Scotia Department of Emergency Management (NSDEM) is responsible for leading disaster and emergency planning, preparedness, response, and recovery activities on behalf of the Province of Nova Scotia. The objective of the Department is to ensure that Nova Scotians are safe, prepared, and resilient in the face of disasters and emergencies. The Department leads the coordination and co-operation of partners and resources during provincial level critical incidents, administers the province’s 911 service, maintains critical communications infrastructure, and supports operations of our regional emergency management centres. The Department also works to ensure critical government services continue to function. \n \nThe Incident Management and 911 Branch is dedicated to ensuring the safety and resilience of our Province by:\n\nRapidly coordinating provincial response and critical infrastructure partner resources\nSetting standards in the provincial emergency management program for training and exercising\nEffectively managing incidents to minimize impact and restore normalcy as quickly as possible\nEnsuring integrated emergency responses through the Provincial Coordination Centre \nManaging and modernizing the emergency 911 system including the move to Next Generation 911"
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "NSDEM is seeking to hire six (6) PCC Watch Officers to the NSDEM Provincial Coordination Centre (PCC) within the Incident Management Division. \n\n\nReporting to a NSDEM PCC Watch Supervisor within Incident Management Division, the PCC Watch Desk is a specialized operations support unit that provides the province’s emergency managers, public safety coordination & command staff, and government leadership with real-time situational awareness. This position will monitor information coming in from various sources including news outlets, and social media channels. The PCC Watch Desk serves as a portal to the Province’s Department of Emergency Management in meeting departmental priorities, objectives, and an enhanced Level of Service to all Nova Scotians. \n\n\nAs a PCC Watch Officer, you will have a critical role in ensuring the safety and security of Nova Scotians by supporting emergency response operations. Acting as a key liaison for the PCC Watch Desk, you will monitor and assess emergency situations, communicate essential information, and support decision-making processes during crises."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "As a key member of the PCC Watch Desk team, you will play an essential role in creating and maintaining a real-time common operating picture for government decision-makers and partners. Your efforts will directly support effective emergency response and decision-making by gathering, analyzing, and disseminating critical information in a fast-paced environment, 24/7. In addition, you will: \n\nMonitor real-time emergency events, assess their potential impacts, and provide preliminary analysis.\nEscalate incidents to the PCC Watch Supervisor as necessary to ensure rapid response and resolution.\nProvide accurate, timely, and concise information to emergency management teams and other stakeholders.\nServe as a primary point of contact for municipalities, provincial / federal departments, and external agencies such as police, fire departments, and volunteer organizations.\nFacilitate seamless communication between emergency management partners and the PCC, ensuring coordinated emergency response actions.\nAssist the PCC Watch Supervisor in maintaining the operational readiness of the Watch Desk.\nSupport the preparation and delivery of situational briefings for senior leadership.\nMaintain detailed, accurate logs and records of all incidents for future reference and analysis.\nReview and evaluate information from diverse sources to enhance emergency response efforts, record-keeping, and data analysis.\nAssist in developing standard operating procedures, policies, and other projects as assigned.\nResearch and help implement innovative programs to enhance the mission and capabilities of the PCC Watch Desk and its partners.",
      "bullets": [
        "Monitor real-time emergency events, assess their potential impacts, and provide preliminary analysis.",
        "Escalate incidents to the PCC Watch Supervisor as necessary to ensure rapid response and resolution.",
        "Provide accurate, timely, and concise information to emergency management teams and other stakeholders.",
        "Serve as a primary point of contact for municipalities, provincial / federal departments, and external agencies such as police, fire departments, and volunteer organizations.",
        "Facilitate seamless communication between emergency management partners and the PCC, ensuring coordinated emergency response actions.",
        "Assist the PCC Watch Supervisor in maintaining the operational readiness of the Watch Desk.",
        "Support the preparation and delivery of situational briefings for senior leadership.",
        "Maintain detailed, accurate logs and records of all incidents for future reference and analysis.",
        "Review and evaluate information from diverse sources to enhance emergency response efforts, record-keeping, and data analysis.",
        "Assist in developing standard operating procedures, policies, and other projects as assigned.",
        "Research and help implement innovative programs to enhance the mission and capabilities of the PCC Watch Desk and its partners."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "Bachelor’s degree + 5 years related experience; or an equivalent combination of training and experience.\n\nExperience working as a member of an emergency response team or full-time EOC in response to an emergency;\nExperience providing front-line emergency response services during emergencies;\nConsiderable knowledge of emergency management technologies;\nExperience working in Public Safety under stressful conditions making critical decisions using sound judgment.\n\n \n\nAlthough not essential, the following are considered assets:\n\n3 years of full-time experience in an emergency management related field.\nFull time work experience working in an emergency management or public safety related operations center that operates on a 24/7 basis;\nDemonstrated experience in editing and maintaining websites and portals (Drupal, WordPress), combined with experience creating, posting content, and sharing on professional social media platforms including X and Facebook\nProven ability to develop and maintain contingency plans, standard operating procedures (SOPs), response plans, and/or partnership agreements.\nAdvanced certifications (e.g., CEM designation) are considered an asset.\nIncident Management System (ICS) certifications (100, 200, 300, 400) & experience;\nBilingual (English/French)\n\nWe will assess the above qualifications and competencies using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "Experience working as a member of an emergency response team or full-time EOC in response to an emergency;",
        "Experience providing front-line emergency response services during emergencies;",
        "Considerable knowledge of emergency management technologies;",
        "Experience working in Public Safety under stressful conditions making critical decisions using sound judgment.",
        "3 years of full-time experience in an emergency management related field.",
        "Full time work experience working in an emergency management or public safety related operations center that operates on a 24/7 basis;",
        "Demonstrated experience in editing and maintaining websites and portals (Drupal, WordPress), combined with experience creating, posting content, and sharing on professional social media platforms including X and Facebook",
        "Proven ability to develop and maintain contingency plans, standard operating procedures (SOPs), response plans, and/or partnership agreements.",
        "Advanced certifications (e.g., CEM designation) are considered an asset.",
        "Incident Management System (ICS) certifications (100, 200, 300, 400) & experience;",
        "Bilingual (English/French)"
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "We recognize equivalent combinations of training, education, and experience, providing opportunities for individuals with diverse backgrounds to contribute their skills and expertise. Equivalencies include:\n\nCompletion of a related master’s degree and three (3) years of experience.\nCompletion of a related diploma and seven (7) years of experience.\nAt least nine (9) years of related experience with no education\n\n \n\nApplicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short- and Long-Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "http://www.nspssp.ca/"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "The PCC Watch Officer collects information regarding potential and actual risks, threats and ongoing incidents that may have operational consequences for Nova Scotia. Often functioning in a high-stress and time-critical environment, the PCC Watch Officer must determine the validity, urgency, and significance of this information and disseminate it to relevant parties.\n\n\nThe PCC Watch Unit operates 24/7. PCC Watch Officers will work shift work, a combination of 12hr day shifts and 12hr night shifts. This includes working on weekends and statutory holidays.\n\n\nAs there is normally only one PCC Watch Supervisor and one PCC Watch Officer on shift at any point in time, employees work collaboratively while supporting the coordination and response to an emergency.\n\n\nYou may be required to travel to remote worksite locations, load vehicles, carry and setup equipment in a variety of locations, and travel during inclement weather conditions. \n\n \n\nDue to the multiple spheres of action and scope of responsibilities that this position requires, there is significant mental pressure, requiring resilience. Must be available to participate in the on-call Duty Officer stand-by rotation and available to support the response and recovery of emergency events as required in the Provincial Coordination Centre.\n\n \n\nThis position will be based in at the NSDEM headquarters in Dartmouth."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This position requires the following:\n\na valid Canadian Driver's License\nImmediate access to a licenced, safety-inspected, and operational motor vehicle.\nAbility to acquire a Level 2 (Secret) Government Security clearance."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace. Our Employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless Career Paths.",
        "Department Specific Flexible working schedules."
      ]
    },
    "compensation": {
      "pay_grade": "PR 13",
      "salary_range": {
        "raw_text": "Salary Range:  $2,556.10 - $3,107.16 Bi-Weekly",
        "min_amount": 2556.1,
        "max_amount": 3107.16,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597021517",
    "scraped_at": "2025-11-09T03:53:34.527420",
    "matched_keyword": "Program Administration Officer",
    "match_score": 100.0
  }
}