{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Project-Coordinator-Intern-%28Program-Admin-Officer-1%29-NS-B3J-2A8/597063717/"
    },
    "metadata": {
      "job_title": "Project Coordinator Intern (Program Admin Officer 1)",
      "classification": "Program Admin Officer 1",
      "competition_number": "47366",
      "department": "Office of Addictions and Mental Health",
      "location": "HALIFAX",
      "type_of_employment": "Internship",
      "union_status": "NSGEU - NSPG",
      "closing_date": "2025-11-17T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Office of Addictions and Mental Health (OAMH) works in close partnership with Nova Scotia Health and IWK Health’s Mental Health and Addictions programs. Together, we aim to ensure that Nova Scotians receive the right care, in the right place, at the right time, from the right provider. OAMH also collaborates with a range of community-based organizations to fund and support vital mental health and addictions services across the province. In addition to supporting traditional clinical services, OAMH focuses on addressing the social determinants of health by working with partners within and across government departments. A key responsibility of OAMH is to promote harm reduction and ensure that mental health and addiction services in Nova Scotia are delivered using evidence-informed, anti-stigma approaches. We are recruiting a Project Coordinator Intern with the OAMH. This is your opportunity to gain experience in Government which has an impact on the mental health of Nova Scotians."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "The Project Coordinator Intern is a new opportunity in OAMH. You will provide support for the Community Wellness Framework - i.e., assisting in the development of a contracts database, organizing the collection/collation/review of contracts, developing a scheduled review process to ensure community partners are adhering to reporting requirements, providing analysis and summary reports for each contract, developing the visualization of key metrics, and supporting the Community Liaison Coordinator in fulfilling the program administration function as needed. You will also assist OAMH in creating a new process for updating and maintaining its records management more efficiently. You will work closely with intersectoral partners including, but not limited to, intradepartmental, provincial, federal, and territorial colleagues, the NSHA and IWK, the private and non-profit sector, and broader community.\n\nYou will gain valuable practical experience in government grant administration, project management, accountability, organization and dissemination of data in a large organizational context, evaluation/adherence to contractual requirements, file organization and management, working in teams, multi-tasking, adherence to deadlines, and setting and delivering on goals."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "Supporting project management towards the completion of policy and project initiatives which require coordination and collaboration across multiple sectors.\nProviding input into the advancement of an accountability framework with results-based management tools, processes and indicators that monitor and assess risk, impact, and progress of system performance.\nCoordinating and maintaining contracts and agreements with health system and community partners with emphasis on accountability, data sharing and reporting standards and consistency with OAMH priorities.\nProviding technical guidance on acquiring, organizing, protecting and processing data to fulfill business objectives.\nResearching best practices in data management and records management.\nParticipating on teams to provide support to staff in various working groups, both within OAMH and collaboratively with staff from other departments, NSHA and IWK, private and non-profit sector, and community-based organizations.\n\n \n\nAs the Project Coordinator Intern, you will report to a Program Director in OAMH.",
      "bullets": [
        "Supporting project management towards the completion of policy and project initiatives which require coordination and collaboration across multiple sectors.",
        "Providing input into the advancement of an accountability framework with results-based management tools, processes and indicators that monitor and assess risk, impact, and progress of system performance.",
        "Coordinating and maintaining contracts and agreements with health system and community partners with emphasis on accountability, data sharing and reporting standards and consistency with OAMH priorities.",
        "Providing technical guidance on acquiring, organizing, protecting and processing data to fulfill business objectives.",
        "Researching best practices in data management and records management.",
        "Participating on teams to provide support to staff in various working groups, both within OAMH and collaboratively with staff from other departments, NSHA and IWK, private and non-profit sector, and community-based organizations."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "As the successful candidate you have graduated within the past three years from a university, community college, or a recognized trade school. Preference will be for the candidate to have graduated from Library Sciences, Data or Information Management, or Commerce or Business Administration with a major/minor in applied computer science.\n\n\n\nYou will have demonstrated experience in database development and management, data visualization, records management, secondary research methods, and working with teams. You will also be a fluent user of Microsoft Excel and other Microsoft applications including Word, Outlook and Power Point. Evidence of initiative and drive are essential. \n\n\n\nYou will demonstrate experience either through school-based work or job experience with the following:\n\nA strong analytical mind who can also think conceptually and see the big picture.\nHighly developed communications skills and using tact and diplomacy to communicate effectively.\nDemonstrated experience working on projects to achieve objectives, work collaboratively, and motivate people and teams.\nDemonstrated understanding and respect of cultural differences including a commitment to recognizing diversity both between and within cultural groups.\nA strong commitment to be a team player.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "A strong analytical mind who can also think conceptually and see the big picture.",
        "Highly developed communications skills and using tact and diplomacy to communicate effectively.",
        "Demonstrated experience working on projects to achieve objectives, work collaboratively, and motivate people and teams.",
        "Demonstrated understanding and respect of cultural differences including a commitment to recognizing diversity both between and within cultural groups.",
        "A strong commitment to be a team player."
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "An equivalent combination of training, education and experience will be considered. Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "The Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs.  For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "www.nspssp.ca"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "Most of your time is spent in a comfortable office setting. Your normal work week is 35 hours/week, 7 hours/day."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This is a TERM employment opportunity with an anticipated end date of November 30, 2027.  The appointment status (‘term’, ‘temporary’ or ‘casual’) is dependent on the start date of the successful candidate."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "Engaging workplace. Our Employees feel valued, respected, connected, and tuned in. We have forward-thinking policies and strategies.",
        "Countless Career Paths.",
        "A Dynamic, client-focused office environment where service excellence and teamwork are our focus."
      ]
    },
    "compensation": {
      "pay_grade": "PR 06",
      "salary_range": {
        "raw_text": "Salary Range:  $2,004.96 - $2,084.99 Bi-Weekly",
        "min_amount": 2004.96,
        "max_amount": 2084.99,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597063717",
    "scraped_at": "2025-11-09T03:51:42.934173",
    "matched_keyword": "Program Coordinator",
    "match_score": 95.0
  }
}