{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/DARTMOUTH-Manager-%28Superintendent%29%2C-Talent-Acquisition%2C-Training-and-Development-NS-B3J-1V7/596991817/"
    },
    "metadata": {
      "job_title": "Manager (Superintendent), Talent Acquisition, Training and Development",
      "classification": "Superintendent",
      "competition_number": "46843",
      "department": "Justice",
      "location": "DARTMOUTH",
      "type_of_employment": "Permanent",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-13T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Court Services Division of the Nova Scotia Department of Justice is dedicated to excellent service and the provision of fair and accessible system of justice, including court administration and security.\n\nThe Division provides administrative support to the courts listed: Nova Scotia Court of Appeal, Supreme Court of Nova Scotia (including Family Division), Provincial Court, Family Court, Small Claims Court, Probate Court and Bankruptcy Court. The courts act independently from the government to address individual cases.\n\nSheriff's work focuses on the safety and security of the judiciary, justice system participants, including persons in custody and the public. With approximately 270 staff, Sheriff Services are represented in every county of Nova Scotia.\n\nSheriffs are responsible for:\n\nCourt security\nTransportation of persons in custody to and from institutions and all levels of court\nThe service of civil and criminal documents\nThe execution of court orders"
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "As the Manager, Talent Acquisition, Training and Development you will hold the rank of Superintendent and report to a Deputy Chief. In addition to responsibilities associated to TA, training and development, as a Superintendent, you are also an integral part of Nova Scotia Sheriff Services Senior Management Team (SMT).\n\nYou are directly accountable for providing strategic leadership to a TA, Training and Development Coordinator (Sergeant) and multiple full and part time trainers.\n\nYou are additionally accountable for overseeing the design, implementation, management and evaluation of all TA, Training and Development Programs, including the largest CEW Program in Atlantic Canada.\n\nSheriff Services must be in full compliance with policies and best practices related to training, Crisis Intervention and De-escalation (CID), Use of Force (UOF) and intermediate weapons systems, weapons, including Conducted Energy Weapons (CEWs). As the Manager you are part of a team of managers who review and/or investigate UOF incidents and will be required to render professional judgement to ensure compliance to the National UOF Framework (NUFF), policy and training standards. In hiring qualified staff, you are responsible for applying the policies of the Public Service Commission, as it relates to Sheriff Services.\n\nAs well, in this position you will foster positive working relationships and partnerships with justice and policing and public safety partners.\n\n\nAs the Manager you will have peace officer status in accordance with Section 2 of the Criminal Code as it is defined as Sheriff Officer."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": null,
      "bullets": []
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": null,
      "required_education": null,
      "required_experience": null,
      "required_bullets": [],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "http://www.nspssp.ca/"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": null
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This is a Permanent employment opportunity with Sheriff Services, located in Dartmouth, NS."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career",
        "Engaging workplace: our employees feel valued, respected, connected, and tuned in, we have forward-thinking policies and strategies",
        "Countless career paths",
        "A dynamic, client-focused office environment where service excellence and teamwork are our focus"
      ]
    },
    "compensation": {
      "pay_grade": "EC 11",
      "salary_range": {
        "raw_text": "Salary Range:  $3,418.96 - $4,273.75 Bi-Weekly",
        "min_amount": 3418.96,
        "max_amount": 4273.75,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "596991817",
    "scraped_at": "2025-11-09T03:54:46.581345",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}