{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Manager%2C-Investigations-and-Compliance-NS-B3J-3K5/597212417/"
    },
    "metadata": {
      "job_title": "Manager, Investigations and Compliance",
      "classification": null,
      "competition_number": "47442",
      "department": "Labour, Skills and Immigration",
      "location": "HALIFAX",
      "type_of_employment": "Term",
      "union_status": "Exclusion - Non Union - NSPG",
      "closing_date": "2025-11-23T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Department of Labour, Skills and Immigration (LSI) works to provide fairness, safety, and prosperity for all Nova Scotians by helping them live, learn, and work to their highest potential.  We have a staff of more than 500 employees working in offices throughout Nova Scotia. Together we are responsible for workplace safety, fire safety, pensions, immigration, apprenticeship, adult education, and many other facets of everyday life."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "Reporting to the Director of Investigations & Compliance, the Manager of Investigations & Compliance provides operational and program management to the Immigration and Population Growth (IPG) Branch as it relates to program integrity. His/her mandate is to demonstrate leadership, direction, and guidance on matters of program fraud risk prevention as it relates to immigration programs delivered by IPG, oversight of compliance operations, quality assurance functions, and to support the Director in the work carried out by the Investigations & Compliance Unit."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "Some of the primary accountabilities in this role include:\n\nLead investigations and compliance operations, ensuring staff, programs, and resources are effectively deployed. Provide ongoing mentorship and coaching to Program Investigators. \nManage a team of professionals to develop and execute strategic plans aligned with departmental and government priorities.\nMonitor performance and support staff development. \nDevelop and implement a comprehensive quality assurance framework for internal processes with clear standards and measurable benchmarks to enhance program effectiveness. \nMonitoring of compliance, investigations and risk assessment processes to identify systemic issues and support continuous improvement. Implement approved revisions and provide strategic guidance on complex issues in collaboration with internal and external partners. \nInterpret policies, procedures, legislation, and new initiatives to support consistent application and mitigate risks across the organization. \nAdvise managers, employees, clients, and stakeholders on legislative changes and operational impacts. \nBuild and maintain collaborative relationships with internal and external stakeholders. Establish systems for monitoring and reporting operational issues and policy implementation. \nOversee internal and external communications systems with guidance from senior leadership. \nRepresent the Department on stakeholder committees to establish protocols. Respond to Ministerial requests and prepare speaking notes for media relations as required.",
      "bullets": [
        "Lead investigations and compliance operations, ensuring staff, programs, and resources are effectively deployed. Provide ongoing mentorship and coaching to Program Investigators.",
        "Manage a team of professionals to develop and execute strategic plans aligned with departmental and government priorities.",
        "Monitor performance and support staff development.",
        "Develop and implement a comprehensive quality assurance framework for internal processes with clear standards and measurable benchmarks to enhance program effectiveness.",
        "Monitoring of compliance, investigations and risk assessment processes to identify systemic issues and support continuous improvement. Implement approved revisions and provide strategic guidance on complex issues in collaboration with internal and external partners.",
        "Interpret policies, procedures, legislation, and new initiatives to support consistent application and mitigate risks across the organization.",
        "Advise managers, employees, clients, and stakeholders on legislative changes and operational impacts.",
        "Build and maintain collaborative relationships with internal and external stakeholders. Establish systems for monitoring and reporting operational issues and policy implementation.",
        "Oversee internal and external communications systems with guidance from senior leadership.",
        "Represent the Department on stakeholder committees to establish protocols. Respond to Ministerial requests and prepare speaking notes for media relations as required."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "To be successful in this position, you must demonstrate the following qualifications:\n\n\n\nA post-secondary degree in a related discipline, or equivalent.\nSeveral years of recent experience in team management, program administration in collaboration with internal and external stakeholders\nProfessional writing, editing, and evidence verification skills\nPresentation and verbal communication\nAbility to provide sound guidance in challenging situations\nProven ability to master subject matter expertise, lead program modernization initiatives, manage competing priorities and demands effectively\nHigh level of intercultural proficiency.\nDemonstrated experience leading or conducting complex investigations, audits, or compliance reviews involving evidence collection, analysis, and enforcement actions. This excludes roles focused solely on routine regulatory monitoring, licensing assessments, or policy interpretation without direct investigative responsibilities.\n\n\nThe following would be considered assets:\n\n\n\nExperience with procedural fairness procedures and processes, or judicial review proceedings\n\n\n\nRequired competencies for this position include: Decisiveness, Strategic Orientation, Developing Others, Team Leadership, Self-Awareness & Personal Impact, Effective Interactive Communication, Partnering & Relationship Building, Intercultural & Diversity Proficiency.\n\nWe will assess the above qualifications and competencies using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "A post-secondary degree in a related discipline, or equivalent.",
        "Several years of recent experience in team management, program administration in collaboration with internal and external stakeholders",
        "Professional writing, editing, and evidence verification skills",
        "Presentation and verbal communication",
        "Ability to provide sound guidance in challenging situations",
        "Proven ability to master subject matter expertise, lead program modernization initiatives, manage competing priorities and demands effectively",
        "High level of intercultural proficiency.",
        "Demonstrated experience leading or conducting complex investigations, audits, or compliance reviews involving evidence collection, analysis, and enforcement actions. This excludes roles focused solely on routine regulatory monitoring, licensing assessments, or policy interpretation without direct investigative responsibilities.",
        "Experience with procedural fairness procedures and processes, or judicial review proceedings"
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "An equivalent combination of training, education and experience will be considered. Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "The Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs.  For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "www.nspssp.ca"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": null
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This is a TERM employment opportunity with an anticipated end date of December 31, 2027. The appointment status (‘term’, ‘temporary’ or ‘casual’) is dependent on the start date of the successful candidate.\n\nApplicants are required to complete a series of questions as part of the online application process."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career",
        "Engaging workplace: our employees feel valued, respected, connected, and tuned in, we have forward-thinking policies and strategies",
        "Countless career paths",
        "A Dynamic, client-focused office environment where service excellence and teamwork are our focus."
      ]
    },
    "compensation": {
      "pay_grade": "EC 12",
      "salary_range": {
        "raw_text": "Salary Range:  $3,760.89 - $4,701.11 Bi-Weekly",
        "min_amount": 3760.89,
        "max_amount": 4701.11,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca.\n\n \n\nCurrent government employees may access this posting through the link below:\n\n \n\n \n\nPLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information. \n\n \n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597212417",
    "scraped_at": "2025-11-09T03:53:21.859222",
    "matched_keyword": "Manager",
    "match_score": 100.0
  }
}