{
  "job_posting": {
    "source": {
      "jurisdiction": "Nova Scotia",
      "job_board": "Government of Nova Scotia",
      "url": "https://jobs.novascotia.ca/job/HALIFAX-Senior-Policy-Analyst-%28Program-Admin-Officer-4%29-NS-B3J2R8/597235617/"
    },
    "metadata": {
      "job_title": "Senior Policy Analyst (Program Admin Officer 4)",
      "classification": "Program Admin Officer 4",
      "competition_number": "47380",
      "department": "Office of Addictions and Mental Health",
      "location": "HALIFAX",
      "type_of_employment": "Term",
      "union_status": "NSGEU - NSPG",
      "closing_date": "2025-11-23T00:00:00",
      "closing_time": "11:59 PM",
      "closing_timezone": "Atlantic Time"
    },
    "about_us": {
      "heading": "About Us",
      "body": "The Office of Addictions and Mental Health (OAMH) leads provincial efforts to promote mental wellness and provide accessible education, prevention, treatment, and recovery services for mental health and addictions. OAMH funds and supports the delivery of services across Nova Scotia through its partnership with mental health and addictions programs offered by the Nova Scotia Health Authority (NSHA), IWK Health (IWK), and numerous community-based organizations. In addition to traditional mental health and addiction support, our work also includes interventions and actions that will help address the social determinants of health, including collaboration with our partners within and across government departments."
    },
    "about_our_opportunity": {
      "heading": "About Our Opportunity",
      "body": "The Senior Policy Analyst with the Office of Mental Health and Addictions (OMHA) works closely with intersectoral partners including, but not limited to, intradepartmental, provincial, federal and territorial colleagues, the NSH and IWK, and the private and non-profit sector. In this role, you provide expertise and advisory services to staff and partners with respect to research and policy development as well as work with senior leadership on key policy, research, and procedural matters.\n\nYou will play a pivotal role in supporting evidence-informed decision-making at OAMH. This includes interpreting and communicating data clearly and effectively, engaging directly with provincial, intergovernmental, and community partners, and representing OAMH on interdepartmental initiatives. You work will directly contribute to driving meaningful change across the mental health and addictions system."
    },
    "primary_accountabilities": {
      "heading": "Primary Accountabilities",
      "intro": "As a Senior Policy Analyst, you will be responsible for and collaborate on developing, implementing, and managing large projects usually involving all phases of work from strategic planning and policy development through to successful implementation. Within a typical day you will be responsible for:\n\n\n\nLeading identified OAMH research and policy functions\nDeveloping and evaluating policy options and related background material\nLeading aspects of the legislative process, including preparation of submissions to Executive Council\nPreparing reports, briefing books and responses relating to health system issues in Nova Scotia\nLeading and/or participating in working groups on specific policy issues\nWorking within a team to coordinate key participant consultations and other public meetings\nPreparing briefing notes and correspondence for senior leaders on a wide range of matters related to OMHA's mandate.",
      "bullets": [
        "Leading identified OAMH research and policy functions",
        "Developing and evaluating policy options and related background material",
        "Leading aspects of the legislative process, including preparation of submissions to Executive Council",
        "Preparing reports, briefing books and responses relating to health system issues in Nova Scotia",
        "Leading and/or participating in working groups on specific policy issues",
        "Working within a team to coordinate key participant consultations and other public meetings",
        "Preparing briefing notes and correspondence for senior leaders on a wide range of matters related to OMHA's mandate."
      ]
    },
    "qualifications_and_experience": {
      "heading": "Qualifications and Experience",
      "requirements_intro": "As our next Senior Policy Analyst, you hold a bachelor's degree in a health-related field plus six (6) years of related experience or a Masters degree with 4 years of progressive experience in the design and development of policies and programs.\n\nYou will demonstrate experience with the following:\n\n\n\nConducting and clearly communicating complex problems informed by research and policy analysis in meaningful ways\nPreparing high-quality written materials, including reports and briefing documents\nBuilding collaborative relationships and working effectively with a range of collaborators\nNavigating and applying knowledge of the provincial legislative and policy environment\nUsing Microsoft Office applications including Word, Excel, Outlook, PowerPoint fluently, experience with data visualization programs an asset\nUnderstanding legislation relevant to the OMHA mandate.\n\n\nIn addition, you possess:\n\n\n\nStrong leadership skills and sound independent judgment\nInitiative and the ability to work both independently and collaboratively\nExcellent organisational skills, with the ability to manage change and balance competing priorities\nThe capacity to deliver high-level work under tight deadlines, while exercising discretion and critical thinking\nPersonal interaction skills that facilitate working cohesively in a team environment",
      "required_education": null,
      "required_experience": null,
      "required_bullets": [
        "Conducting and clearly communicating complex problems informed by research and policy analysis in meaningful ways",
        "Preparing high-quality written materials, including reports and briefing documents",
        "Building collaborative relationships and working effectively with a range of collaborators",
        "Navigating and applying knowledge of the provincial legislative and policy environment",
        "Using Microsoft Office applications including Word, Excel, Outlook, PowerPoint fluently, experience with data visualization programs an asset",
        "Understanding legislation relevant to the OMHA mandate.",
        "Strong leadership skills and sound independent judgment",
        "Initiative and the ability to work both independently and collaboratively",
        "Excellent organisational skills, with the ability to manage change and balance competing priorities",
        "The capacity to deliver high-level work under tight deadlines, while exercising discretion and critical thinking",
        "Personal interaction skills that facilitate working cohesively in a team environment"
      ],
      "additional_skills_bullets": [],
      "asset_heading": "Assets",
      "asset_bullets": [
        "Familiarity with the structure, processes, and key collaborators within government",
        "Knowledge of, or experience in, the field of mental health and addictions; and",
        "Background in public policy development and analysis"
      ],
      "equivalency_heading": "Equivalency",
      "equivalency_text": "An equivalent combination of training, education and experience will be considered. Applicants relying on education and experience equivalencies must demonstrate such equivalencies in their application."
    },
    "benefits": {
      "heading": "Benefits",
      "body": "Based on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs.  For information on all our Benefit program offerings, click here: Benefits for government employees.",
      "benefits_link_text": "Benefits for government employees",
      "benefits_link_url": "www.nspssp.ca"
    },
    "working_conditions": {
      "heading": "Working Conditions",
      "body": "Most of your time is spent in a comfortable office setting. Your normal work week is 35 hours/week, 7 hours/day."
    },
    "additional_information": {
      "heading": "Additional Information",
      "body": "This is a TERM employment opportunity with anticipated end date of August 19, 2026.  The appointment status (‘term’, ‘temporary’ or ‘casual’) is dependent on the start date of the successful candidate."
    },
    "what_we_offer": {
      "heading": "What We Offer",
      "bullets": [
        "Career Development where you have access to career guidance, tools, resources, and ongoing training for every stage of your career.",
        "An engaged workplace where we foster respect and recognition.",
        "Forward-thinking policies and strategies.",
        "countless career paths.",
        "Department Specific Flexible working schedules."
      ]
    },
    "compensation": {
      "pay_grade": "PR 17",
      "salary_range": {
        "raw_text": "Salary Range:  $3,107.16 - $3,649.33 Bi-Weekly",
        "min_amount": 3107.16,
        "max_amount": 3649.33,
        "frequency": "Bi-Weekly",
        "currency": "CAD"
      }
    },
    "statements": {
      "employment_equity": {
        "heading": "Employment Equity Statement",
        "body": "Our goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve.  The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented.  If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application."
      },
      "accommodation": {
        "heading": "Accommodation Statement",
        "body": "We are committed to providing an inclusive and accessible recruitment process. Candidates may request accommodations based on any grounds protected by the Human Rights Act. If you require an accommodation throughout the recruitment process, please contact us at competitions@novascotia.ca."
      }
    },
    "application_instructions": {
      "internal_applicants_text": null,
      "external_applicants_text": null,
      "incomplete_applications_note": null,
      "contact_email": "Competitions@novascotia.ca"
    }
  },
  "scraping_metadata": {
    "job_id": "597235617",
    "scraped_at": "2025-11-09T03:53:56.595259",
    "matched_keyword": "Policy Analyst",
    "match_score": 100.0
  }
}